{"CompareString": "Compares two character strings, for a locale specified by identifier.", "CompareStringA": "Compares two character strings, for a locale specified by identifier.", "ConvertDefaultLocale": "Converts a default locale value to an actual locale identifier.", "EnumCalendarInfoA": "Enumerates calendar information for a specified locale.", "EnumCalendarInfoExA": "Enumerates calendar information for a locale specified by identifier.", "EnumCalendarInfoExEx": "Enumerates calendar information for a locale specified by name.", "EnumCalendarInfoExW": "Enumerates calendar information for a locale specified by identifier.", "EnumCalendarInfoW": "Enumerates calendar information for a specified locale.", "EnumDateFormatsA": "Enumerates the long date, short date, or year/month formats that are available for a specified locale.", "EnumDateFormatsExA": "Enumerates the long date, short date, or year/month formats that are available for a specified locale.", "EnumDateFormatsExEx": "Enumerates the long date, short date, or year/month formats that are available for a locale specified by name.", "EnumDateFormatsExW": "Enumerates the long date, short date, or year/month formats that are available for a specified locale.", "EnumDateFormatsW": "Enumerates the long date, short date, or year/month formats that are available for a specified locale.", "EnumLanguageGroupLocalesA": "Enumerates the locales in a specified language group.", "EnumLanguageGroupLocalesW": "Enumerates the locales in a specified language group.", "EnumSystemCodePagesA": "Enumerates the code pages that are either installed on or supported by an operating system.", "EnumSystemCodePagesW": "Enumerates the code pages that are either installed on or supported by an operating system.", "EnumSystemGeoID": "Enumerates the geographical location identifiers that are available on the operating system.", "EnumSystemGeoNames": "Enumerates the two-letter International Organization for Standardization codes for geographical locations that are available on the operating system.", "EnumSystemLanguageGroupsA": "Enumerates the language groups that are either installed on or supported by an operating system.", "EnumSystemLanguageGroupsW": "Enumerates the language groups that are either installed on or supported by an operating system.", "EnumSystemLocalesA": "Enumerates the locales that are either installed on or supported by an operating system.", "EnumSystemLocalesEx": "Enumerates the locales that are either installed on or supported by an operating system.", "EnumSystemLocalesW": "Enumerates the locales that are either installed on or supported by an operating system.", "EnumTimeFormatsA": "Enumerates the time formats that are available for a locale specified by identifier.", "EnumTimeFormatsEx": "Enumerates the time formats that are available for a locale specified by name.", "EnumTimeFormatsW": "Enumerates the time formats that are available for a locale specified by identifier.", "EnumUILanguagesA": "Enumerates the user interface languages that are available on the operating system and calls the callback function with every language in the list.", "EnumUILanguagesW": "Enumerates the user interface languages that are available on the operating system and calls the callback function with every language in the list.", "FILEMUIINFO_GET_CULTURE": "Gets the locale name associated with the language name offset information in the dwLanguageNameOffset member of a FILEMUIINFO structure.", "FILEMUIINFO_GET_MAIN_TYPEID": "Gets the main module types array element associated with the type identifier size and offset in a FILEMUIINFO structure.", "FILEMUIINFO_GET_MAIN_TYPEIDS": "Gets the main module types array associated with the type identifier offset information in the dwTypeIDMainOffset member of a FILEMUIINFO structure.", "FILEMUIINFO_GET_MAIN_TYPENAMES": "Gets the main module names multistring array associated with the type name offset information in the dwTypeNameMainOffset member of a FILEMUIINFO structure.", "FILEMUIINFO_GET_MUI_TYPEID": "Gets the MUI module types array element associated with the type identifier size and offset information in a FILEMUIINFO structure.", "FILEMUIINFO_GET_MUI_TYPEIDS": "Gets the MUI module types array associated with the type identifier offset information in the dwTypeIDMUIOffset member of a FILEMUIINFO structure.", "FILEMUIINFO_GET_MUI_TYPENAMES": "Gets the MUI module names multistring array associated with the type name offset information in the dwTypeNameMUIOffset member of a FILEMUIINFO structure.", "FindNLSString": "Locates a Unicode string or its equivalent in another Unicode string for a locale specified by identifier.", "FindNLSStringEx": "Locates a Unicode string or its equivalent in another Unicode string for a locale specified by name.", "FoldStringA": "Maps one Unicode string to another, performing the specified transformation.", "GetACP": "Retrieves the current Windows ANSI code page identifier for the operating system.", "GetCalendarInfoA": "Retrieves information about a calendar for a locale specified by identifier.", "GetCalendarInfoEx": "Retrieves information about a calendar for a locale specified by name.", "GetCalendarInfoW": "Retrieves information about a calendar for a locale specified by identifier.", "GetCPInfo": "Retrieves information about any valid installed or available code page.", "GetCPInfoExA": "Retrieves information about any valid installed or available code page.", "GetCPInfoExW": "Retrieves information about any valid installed or available code page.", "GetCurrencyFormatA": "Formats a number string as a currency string for a locale specified by identifier.", "GetCurrencyFormatEx": "Formats a number string as a currency string for a locale specified by name.", "GetCurrencyFormatW": "Formats a number string as a currency string for a locale specified by identifier.", "GetDurationFormat": "Formats a duration of time as a time string for a locale specified by identifier.", "GetDurationFormatEx": "Formats a duration of time as a time string for a locale specified by name.", "GetFileMUIInfo": "Retrieves resource-related information about a file.", "GetFileMUIPath": "Retrieves the path to all language-specific resource files associated with the supplied LN file.", "GetGeoInfoA": "Retrieves information about a specified geographical location.", "GetGeoInfoEx": "Retrieves information about a geographic location that you specify by using a two-letter International Organization for Standardization code.", "GetGeoInfoW": "Retrieves information about a specified geographical location.", "GetLocaleInfoA": "Retrieves information about a locale specified by identifier.", "GetLocaleInfoEx": "Retrieves information about a locale specified by name.", "GetLocaleInfoW": "Retrieves information about a locale specified by identifier.", "GetNLSVersion": "Retrieves information about the current version of a specified NLS capability for a locale specified by identifier.", "GetNLSVersionEx": "Retrieves information about the current version of a specified NLS capability for a locale specified by name.", "GetNumberFormatA": "Formats a number string as a number string customized for a locale specified by identifier.", "GetNumberFormatEx": "Formats a number string as a number string customized for a locale specified by name.", "GetNumberFormatW": "Formats a number string as a number string customized for a locale specified by identifier.", "GetOEMCP": "Returns the current original equipment manufacturer code page identifier for the operating system.", "GetProcessPreferredUILanguages": "Retrieves the process preferred UI languages.", "GetStringScripts": "Provides a list of scripts used in the specified Unicode string.", "GetStringTypeA": "Deprecated.", "GetSystemDefaultLangID": "Returns the language identifier for the system locale.", "GetSystemDefaultLCID": "Returns the locale identifier for the system locale.", "GetSystemDefaultLocaleName": "Retrieves the system default locale name.", "GetSystemDefaultUILanguage": "Retrieves the language identifier for the system default UI language of the operating system, also known as the install language on Windows Vista and later.", "GetSystemPreferredUILanguages": "Retrieves the system preferred UI languages.", "GetThreadLocale": "Returns the locale identifier of the current locale for the calling thread.", "GetThreadPreferredUILanguages": "Retrieves the thread preferred UI languages for the current thread.", "GetThreadUILanguage": "Returns the language identifier of the first user interface language for the current thread.", "GetUILanguageInfo": "Retrieves a variety of information about an installed UI language", "GetUserDefaultGeoName": "Retrieves the two-letter International Organization for Standardization code for the default geographical location of the user.", "GetUserDefaultLangID": "Returns the language identifier of the Region Format setting for the current user.", "GetUserDefaultLCID": "Returns the locale identifier for the user default locale.", "GetUserDefaultLocaleName": "Retrieves the user default locale name.", "GetUserDefaultUILanguage": "Returns the language identifier for the user UI language for the current user.", "GetUserGeoID": "Retrieves information about the geographical location of the user.", "GetUserPreferredUILanguages": "Retrieves information about the user preferred UI languages.", "IdnToAscii": "Converts an internationalized domain name representation of the ASCII string that represents the name in the Punycode transfer encoding syntax.", "IdnToNameprepUnicode": "Converts an internationalized domain name or another internationalized label to the NamePrep form specified by Network Working Group RFC 3491, but does not perform the additional conversion to Punycode.", "IdnToUnicode": "Converts the Punycode form of an internationalized domain name or another internationalized label to the normal Unicode UTF-16 encoding syntax.", "IS_HIGH_SURROGATE": "Determines if a character is a UTF-16 high surrogate code point, ranging from 0xd800 to 0xdbff, inclusive.", "IS_LOW_SURROGATE": "Determines if a character is a UTF-16 low surrogate code point, ranging from 0xdc00 to 0xdfff, inclusive.", "IS_SURROGATE_PAIR": "Determines if the specified code units form a UTF-16 surrogate pair.", "IsDBCSLeadByte": "Determines if a specified character is a lead byte for the system default Windows ANSI code page for the code page.", "IsDBCSLeadByteEx": "Determines if a specified character is potentially a lead byte.", "IsNLSDefinedString": "Determines if each character in a string has a defined result for a specified NLS capability.", "IsNormalizedString": "Verifies that a string is normalized according to Unicode 4.0 TR#15.", "IsValidCodePage": "Determines if a specified code page is valid.", "IsValidLanguageGroup": "Determines if a language group is installed or supported on the operating system.", "IsValidLocale": "Determines if the specified locale is installed or supported on the operating system.", "IsValidLocaleName": "Determines if the specified locale name is valid for a locale that is installed or supported on the operating system.", "IsValidNLSVersion": "Determines if the NLS version is valid for a given NLS function.", "LCIDToLocaleName": "Converts a locale identifier to a locale name.", "LCMapStringA": "For a locale specified by identifier, maps one input character string to another using a specified transformation, or generates a sort key for the input string.", "LCMapStringEx": "For a locale specified by name, maps an input character string to another using a specified transformation, or generates a sort key for the input string.", "LCMapStringW": "For a locale specified by identifier, maps one input character string to another using a specified transformation, or generates a sort key for the input string.", "LoadStringByReference": "Unsupported.", "LocaleNameToLCID": "Converts a locale name to a locale identifier.", "NormalizeString": "Normalizes characters of a text string according to Unicode 4.0 TR#15.", "NotifyUILanguageChange": "Unsupported.", "ResolveLocaleName": "Finds a possible locale name match for the supplied name.", "SetCalendarInfoA": "Sets an item of locale information for a calendar.", "SetCalendarInfoW": "Sets an item of locale information for a calendar.", "SetLocaleInfoA": "Sets an item of information in the user override portion of the current locale.", "SetLocaleInfoW": "Sets an item of information in the user override portion of the current locale.", "SetProcessPreferredUILanguages": "Sets the process preferred UI languages for the application process.", "SetThreadLocale": "Sets the current locale of the calling thread.", "SetThreadPreferredUILanguages": "Sets the thread preferred UI languages for the current thread.", "SetThreadUILanguage": "Sets the user interface language for the current thread.", "SetUserGeoID": "Sets the geographical location identifier for the user.", "SetUserGeoName": "Sets the geographic location for the current user to the specified two-letter International Organization for Standardization code.", "VerifyScripts": "Compares two enumerated lists of scripts."}