{"AccessibleChildren": "Retrieves the child ID or IDispatch of each child within an accessible container object.", "AccessibleObjectFromEvent": "Retrieves the address of the IAccessible interface for the object that generated the event that is currently being processed by the client's event hook function.", "AccessibleObjectFromPoint": "Retrieves the address of the IAccessible interface pointer for the object displayed at a specified point on the screen.", "AccessibleObjectFromWindow": "Retrieves the address of the specified interface for the object associated with the specified window.", "AccNotifyTouchInteraction": "Allows an assistive technology (AT) application to notify the system that it is interacting with UI through a Windows Automation API (such as Microsoft UI Automation) as a result of a touch gesture from the user.", "AccSetRunningUtilityState": "Sets system values that indicate whether an assistive technology (AT) application's current state affects functionality that is typically provided by the system.", "CreateStdAccessibleObject": "Creates an accessible object with the methods and properties of the specified type of system-provided user interface element.", "CreateStdAccessibleProxy": "Creates an accessible object that has the properties and methods of the specified class of system-provided user interface element.", "GetOleaccVersionInfo": "Retrieves the version number and build number of the Microsoft Active Accessibility file Oleacc.dll.", "GetRoleText": "Retrieves the localized string that describes the object's role for the specified role value.", "GetStateText": "Retrieves a localized string that describes an object's state for a single predefined state bit flag. Because state values are a combination of one or more bit flags, clients call this function more than once to retrieve all state strings.", "LresultFromObject": "Returns a reference, similar to a handle, to the specified object. Servers return this reference when handling WM_GETOBJECT.", "ObjectFromLresult": "Retrieves a requested interface pointer for an accessible object based on a previously generated object reference.", "WindowFromAccessibleObject": "Retrieves the window handle that corresponds to a particular instance of an IAccessible interface."}