{"CloseTrace": "The CloseTrace function closes a trace processing session that was created with OpenTrace.", "ControlTraceA": "The ControlTrace function flushes, queries, updates, or stops the specified event tracing session.", "ControlTraceW": "The ControlTrace function flushes, queries, updates, or stops the specified event tracing session.", "CreateTraceInstanceId": "A RegisterTraceGuids-based event provider uses the CreateTraceInstanceId function to create a unique transaction identifier and map it to a registration handle.", "EnableTrace": "A trace session controller calls EnableTrace to configure how an ETW event provider logs events to a trace session.", "EnableTraceEx": "A trace session controller calls EnableTraceEx to configure how an ETW event provider logs events to a trace session.", "EnableTraceEx2": "A trace session controller calls EnableTraceEx2 to configure how an ETW event provider logs events to a trace session.", "EnumerateTraceGuids": "Retrieves information about event trace providers that are currently running on the computer.", "EnumerateTraceGuidsEx": "Retrieves information about event trace providers that are currently running on the computer.", "FlushTraceA": "The FlushTrace function causes an event tracing session to immediately deliver buffered events for the specified session.", "FlushTraceW": "The FlushTrace function causes an event tracing session to immediately deliver buffered events for the specified session.", "GetTraceEnableFlags": "A RegisterTraceGuids-based event provider uses the GetTraceEnableFlags function to retrieve the enable flags specified by the trace controller to indicate which category of events to trace.", "GetTraceEnableLevel": "A RegisterTraceGuids-based event provider uses the GetTraceEnableLevel function to retrieve the enable level specified by the trace controller to indicate which level of events to trace.", "GetTraceLoggerHandle": "A RegisterTraceGuids-based event provider uses the GetTraceLoggerHandle function to retrieve the handle of the event tracing session to which it should write events.", "OpenTraceA": "The OpenTrace function opens an ETW trace processing handle for consuming events from an ETW real-time trace session or an ETW log file.", "OpenTraceW": "The OpenTrace function opens an ETW trace processing handle for consuming events from an ETW real-time trace session or an ETW log file.", "ProcessTrace": "Delivers events from one or more trace processing sessions to the consumer.", "QueryAllTracesA": "The QueryAllTraces function retrieves the properties and statistics for all event tracing sessions for which the caller has permissions to query.", "QueryAllTracesW": "The QueryAllTraces function retrieves the properties and statistics for all event tracing sessions for which the caller has permissions to query.", "QueryTraceA": "The QueryTrace function retrieves the property settings and session statistics for the specified event tracing session.", "QueryTraceProcessingHandle": "Retrieves information about an ETW trace processing session opened by OpenTrace.", "QueryTraceW": "The QueryTrace function retrieves the property settings and session statistics for the specified event tracing session.", "RegisterTraceGuidsA": "Registers a Classic ETW event trace provider and the event trace classes that it uses to generate events.", "RegisterTraceGuidsW": "Registers a Classic ETW event trace provider and the event trace classes that it uses to generate events.", "RemoveTraceCallback": "The RemoveTraceCallback function stops an EventCallback function from receiving events for an event trace class.", "SetTraceCallback": "The SetTraceCallback function specifies an EventCallback function to process events for the specified event trace class.", "StartTraceA": "The StartTrace function starts an event tracing session.", "StartTraceW": "The StartTrace function starts an event tracing session.", "StopTraceA": "The StopTrace function stops the specified event tracing session.", "StopTraceW": "The StopTrace function stops the specified event tracing session.", "TraceEvent": "A RegisterTraceGuids-based event provider uses the TraceEvent function to send a structured event to an event tracing session.", "TraceEventInstance": "A RegisterTraceGuids-based event provider uses the TraceEventInstance function to send a structured event to an event tracing session with an instance identifier.", "TraceMessage": "A RegisterTraceGuids-based event to an event tracing session.", "TraceMessageVa": "A RegisterTraceGuids-based event to an event tracing session using va_list parameters.", "TraceQueryInformation": "Provides information about an event tracing session.", "TraceSetInformation": "Configures event tracing session settings.", "UnregisterTraceGuids": "Unregisters a Classic ETW event trace provider that was registered using RegisterTraceGuids.", "UpdateTraceA": "The UpdateTrace function updates the property setting of the specified event tracing session.", "UpdateTraceW": "The UpdateTrace function updates the property setting of the specified event tracing session."}