{"Acquire": "The IDirectInputJoyConfig8::Acquire method acquires joystick configuration mode.", "AddNewHardware": "The IDirectInputJoyConfig8::AddNewHardware method displays the Add New Hardware dialog box which guides the user through installing a new input device.", "AddRef": "The IDirectInputJoyConfig8::AddRef method increases the reference count of the DirectInputJoyConfig object by 1.", "DeleteConfig": "The IDirectInputJoyConfig8::DeleteConfig method deletes configuration information about a joystick.", "DeleteType": "The IDirectInputJoyConfig8::DeleteType method removes information about a joystick type.", "DestroyEffect": "The IDirectInputEffectDriver::DestroyEffect method removes an effect from the device.", "DeviceID": "The IDirectInputEffectDriver::DeviceID method sends the driver the identity of the device.", "DownloadEffect": "The IDirectInputEffectDriver::DownloadEffect method sends an effect to the device.", "EnumTypes": "The IDirectInputJoyConfig8::EnumTypes method enumerates the joystick types currently supported by DirectInput.", "Escape": "The IDirectInputEffectDriver::Escape method escapes to the driver.", "GetConfig": "The IDirectInputJoyConfig8::GetConfig method obtains information about a joystick's configuration.", "GetEffectStatus": "The IDirectInputEffectDriver::GetEffectStatus method obtains information about the status of an effect.", "GetForceFeedbackState": "The IDirectInputEffectDriver::GetForceFeedbackState method retrieves the force-feedback state for the device.", "GetTypeInfo": "The IDirectInputJoyConfig8::GetTypeInfo method obtains information about a joystick type.", "GetUserValues": "The IDirectInputJoyConfig8::GetUserValues method obtains information about user settings for the joystick.", "GetVersions": "The IDirectInputEffectDriver::GetVersions method obtains version information about the force-feedback hardware and driver.", "OpenAppStatusKey": "The IDirectInputJoyConfig8::OpenAppStatusKey method opens the root key of the application status registry keys, and obtains a handle to the key as a return parameter.", "OpenTypeKey": "The IDirectInputJoyConfig8::OpenTypeKey method opens the registry key associated with a joystick type.", "QueryInterface": "The IDirectInputJoyConfig8::QueryInterface method determines whether the DirectInputJoyConfig object supports a particular COM interface.", "Release": "The IDirectInputJoyConfig8::Release method decreases the reference count of the DirectInputJoyConfig object by 1.", "SendForceFeedbackCommand": "The IDirectInputEffectDriver::SendForceFeedbackCommand method changes the force-feedback state for the device.", "SendNotify": "The IDirectInputJoyConfig8::SendNotify method notifies device drivers and applications that changes to the device configuration have been made.", "SetConfig": "The IDirectInputJoyConfig8::SetConfig method creates or redefines configuration information about a joystick.", "SetCooperativeLevel": "The IDirectInputJoyConfig8::SetCooperativeLevel method establishes the cooperation level for the instance of the device.", "SetGain": "The IDirectInputEffectDriver::SetGain method sets the overall device gain.", "SetTypeInfo": "The IDirectInputJoyConfig8::SetTypeInfo method creates a new joystick type or redefines information about an existing joystick type.", "SetUserValues": "The IDirectInputJoyConfig8::SetUserValues method sets the user settings for the joystick.", "StartEffect": "The IDirectInputEffectDriver::StartEffect method begins the playback of an effect.", "StopEffect": "The IDirectInputEffectDriver::StopEffect method halts the playback of an effect.", "Unacquire": "The IDirectInputJoyConfig8::Unacquire method unacquires joystick configuration mode."}