{"AddFile": "Adds a single file to the job.", "AddFiles": "Use the AddFiles method to add one or more files to download to the job.", "AddFileSet": "Adds multiple files to a job.", "AddFileWithRanges": "Adds a file to a download job and specifies the ranges of the file you want to download.", "Cancel": "Deletes the job from the transfer queue and removes related temporary files from the client.", "CancelGroup": "Use the CancelGroup method to remove the group from the queue.", "ClearHelperToken": "Discards the helper token, and does not change the usage flags.", "ClearPeers": "Removes all peers from the list of peers that can serve content.", "ClearRecords": "Removes all the records and files from the cache.", "Clone": "Use the Clone method to create another IEnumBackgroundCopyJobs1 enumerator that contains the same enumeration state as the current one.", "Complete": "Ends the job and saves the transferred files on the client.", "CreateGroup": "Use the CreateGroup method to create a new group and add it to the download queue.", "CreateJob": "Use the CreateJob method to add a new job to the group.", "DeleteRecord": "Deletes a record and file from the cache.", "DeleteUrl": "Deletes all cache records and the file from the cache for the given URL.", "DisableBITSUploads": "Use the DisableBITSUploads method to disable BITS upload on the virtual directory to which the ADSI object points.", "DiscoverPeers": "Generates a list of peers that can serve content.", "EnableBITSUploads": "Use the EnableBITSUploads method to enable BITS upload on the virtual directory to which the ADSI object points.", "EnumFiles": "Retrieves an IEnumBackgroundCopyFiles interface pointer that you use to enumerate the files in a job.", "EnumGroups": "Use the EnumGroups method to retrieve a list of groups that the current user owns.", "EnumJobs": "Use the EnumJobs method to retrieve a list of jobs in the group.", "EnumPeers": "Gets an IEnumBitsPeers interface pointer that you use to enumerate the peers that can serve content.", "EnumRecords": "Gets an IEnumBitsPeerCacheRecords interface pointer that you use to enumerate the records in the cache.", "FileRangesTransferred": "BITS calls your implementation of the FileRangesTransferred method when one or more file ranges have been downloaded.", "FileTransferred": "BITS calls your implementation of the FileTransferred method when BITS successfully finishes transferring a file.", "get_GroupID": "Use the get_GroupID method to retrieve the group's identifier.", "get_JobID": "Use the get_JobID method to retrieve the job's identifier.", "get_Size": "Use the get_Size method to retrieve the size of all files in the group to download.", "GetCleanupTask": "Use the GetCleanupTask method to retrieve an interface pointer to the cleanup task associated with the virtual directory.", "GetCleanupTaskName": "Use the GetCleanupTaskName method to retrieve the name of the cleanup task associated with the virtual directory.", "GetClientCertificate": "Retrieves the client certificate from the job.", "GetConfigurationFlags": "Gets the configuration flags that determine if the computer serves content to peers and can download content from peers.", "GetCount": "Use the GetCount method to retrieve a count of the number of jobs in the enumeration.", "GetCustomHeaders": "Retrieves the custom headers set by an earlier call to IBackgroundCopyJobHttpOptions::SetCustomHeaders.", "GetDescription": "Retrieves the description of the job.", "GetDisplayName": "Retrieves the display name for the job.", "GetError": "Retrieves the error interface after an error occurs.", "GetErrorContextDescription": "Retrieves the description of the context in which the error occurred.", "GetErrorCount": "Retrieves the number of times BITS tried to transfer the job and an error occurred.", "GetErrorDescription": "Retrieves a description for the specified error code.", "GetFile": "Use the GetFile method to retrieve the remote and local file names for the given file in the job.", "GetFileACLFlags": "Retrieves the flags that identify the owner and ACL information to maintain when transferring a file using SMB.", "GetFileCount": "Use the GetFileCount method to retrieve the number of files in the job.", "GetFileModificationTime": "Gets the date and time that the file was last modified on the server.", "GetFileRanges": "Retrieves the ranges that you want to download from the remote file.", "GetFileSize": "Gets the size of the file.", "GetFilledFileRanges": "Returns the set of file ranges that have been downloaded.", "GetGroup": "Use the GetGroup method to retrieve a group from the download queue.", "GetHelperTokenFlags": "Returns the usage flags for a token that is associated with a BITS transfer job.", "GetHelperTokenSid": "Returns the SID of the helper token if one is set.", "GetHttpMethod": "Retrieves a wide string containing the HTTP method name for the BITS transfer.", "GetId": "Gets the identifier that uniquely identifies the record in the cache.", "GetJob": "Use the GetJob method to retrieve a job from the group.", "GetLastAccessTime": "Gets the date and time that the file was last accessed.", "GetLocalName": "Retrieves the local name of the file.", "GetMaximumCacheSize": "Gets the maximum size of the cache.", "GetMaximumContentAge": "Gets the age by when files are removed from the cache.", "GetMaximumDownloadTime": "Retrieves the maximum time that BITS will spend transferring the files in the job.", "GetMinimumRetryDelay": "Retrieves the minimum length of time that the service waits after encountering a transient error condition before trying to transfer the file.", "GetNoProgressTimeout": "Retrieves the length of time that the service tries to transfer the file after a transient error condition occurs.", "GetNotifyCmdLine": "Retrieves the program to execute when the job enters the error or transferred state.", "GetNotifyFlags": "Retrieves the event notification flags for the job.", "GetNotifyInterface": "Retrieves the interface pointer to your implementation of the IBackgroundCopyCallback interface.", "GetObject": "Use the GetObject method to retrieve a pointer to the IBITSExtensionSetup interface.", "GetOriginUrl": "Gets the origin URL of the cached file.", "GetOwner": "Retrieves the identity of the job's owner.", "GetOwnerElevationState": "Gets a value that determines if the token of the owner was elevated at the time they created or took ownership of the job.", "GetOwnerIntegrityLevel": "Gets the integrity level of the token of the owner that created or took ownership of the job.", "GetPeerCachingFlags": "Retrieves flags that determine if the files of the job can be cached and served to peers and if BITS can download content for the job from peers.", "GetPeerDownloadStats": "Specifies statistics about the amount of data downloaded from peers and origin servers.", "GetPeerName": "Gets the server principal name that uniquely identifies the peer.", "GetPriority": "Retrieves the priority level for the job.", "GetProgress": "Use the GetProgress method to retrieve the job's progress.", "GetProp": "Use the GetProp method to retrieve a property value from the group.", "GetProperty": "A generic method for getting BITS job properties.", "GetProtocol": "Retrieves the protocol used to transfer the file.", "GetProxySettings": "Retrieves the proxy information that the job uses to transfer the files.", "GetRecord": "Gets a record from the cache.", "GetRemoteName": "Retrieves the remote name of the file.", "GetReplyData": "Retrieves an in-memory copy of the reply data from the server application.", "GetReplyFileName": "Retrieves the name of the file that contains the reply data from the server application.", "GetReplyProgress": "Retrieves progress information related to the transfer of the reply data from an upload-reply job.", "GetSecurityFlags": "Retrieves the flags for HTTP that determine whether the certificate revocation list is checked and certain certificate errors are ignored, and the policy to use when a server redirects the HTTP request.", "GetState": "Retrieves the state of the job.", "GetStatus": "Use the GetStatus method to retrieve the state of the job.", "GetTemporaryName": "Gets the full path of the temporary file that contains the content of the download.", "GetTimes": "Retrieves job-related time stamps, such as the time that the job was created or last modified.", "GetType": "Retrieves the type of transfer being performed, such as a file download or upload.", "GetValidationState": "Gets the current validation state of this file.", "IsAuthenticated": "Determines whether the peer is authenticated.", "IsAvailable": "Determines whether the peer is available to serve content.", "IsDownloadedFromPeer": "Gets a value that determines if any part of the file was downloaded from a peer.", "IsFileValidated": "Determines whether the file has been validated.", "JobError": "BITS calls your implementation of the JobError method when the state of the job changes to BG_JOB_STATE_ERROR.", "JobModification": "BITS calls your implementation of the JobModification method when the job has been modified.", "JobTransferred": "BITS calls your implementation of the JobTransferred method when all of the files in the job have been successfully transferred.", "MakeCustomHeadersWriteOnly": "Sets the HTTP custom headers for this job to be write-only.", "Next": "Use the Next method to retrieve the specified number of items in the enumeration sequence.", "OnStatus": "Implement the OnStatus method to receive notification when the group is complete or an error occurs.", "RemoveClientCertificate": "Removes the client certificate from the job.", "RemoveCredentials": "Removes credentials from use.", "ReplaceRemotePrefix": "Replaces the beginning text of all remote names in the download job with the specified string.", "RequestFileRanges": "Adds a new set of file ranges to be prioritized for download.", "Reset": "Use the Reset method to reset the enumeration sequence to the beginning.", "Resume": "Activates a new job or restarts a job that has been suspended.", "ResumeGroup": "Use the ResumeGroup method to start a group that has been suspended in the download queue.", "SetClientCertificateByID": "Specifies the identifier of the client certificate to use for client authentication in an HTTPS request.", "SetClientCertificateByName": "Specifies the subject name of the client certificate to use for client authentication in an HTTPS request.", "SetConfigurationFlags": "Sets the configuration flags that determine if the computer can serve content to peers and can download content from peers.", "SetCredentials": "Specifies the credentials to use for a proxy or remote server user authentication request.", "SetCustomHeaders": "Specifies one or more custom HTTP headers to include in HTTP requests.", "SetDescription": "Provides a description of the job.", "SetDisplayName": "Specifies a display name for the job.", "SetFileACLFlags": "Specifies the owner and ACL information to maintain when using SMB to download or upload a file.", "SetHelperToken": "Sets the helper token to impersonate the token of the COM client.", "SetHelperTokenFlags": "Sets the usage flags for a token that is associated with a BITS transfer job.", "SetHttpMethod": "Overrides the default HTTP method used for a BITS transfer.", "SetMaximumCacheSize": "Specifies the maximum size of the cache.", "SetMaximumContentAge": "Specifies when files are removed from the cache based on age.", "SetMaximumDownloadTime": "Sets the maximum time that BITS will spend transferring the files in the job.", "SetMinimumRetryDelay": "Sets the minimum length of time that BITS waits after encountering a transient error condition before trying to transfer the file.", "SetNoProgressTimeout": "Sets the length of time that BITS tries to transfer the file after a transient error condition occurs.", "SetNotifyCmdLine": "Specifies a program to execute if the job enters the BG_JOB_STATE_ERROR or BG_JOB_STATE_TRANSFERRED state.", "SetNotifyFlags": "Specifies the type of event notification you want to receive, such as job transferred events.", "SetNotifyInterface": "Identifies your implementation of the IBackgroundCopyCallback interface to BITS.", "SetPeerCachingFlags": "Sets flags that determine if the files of the job can be cached and served to peers and if the job can download content from peers.", "SetPriority": "Specifies the priority level of your job.", "SetProp": "Use the SetProp method to set the property value for a group property.", "SetProperty": "A generic method for setting BITS job properties.", "SetProxySettings": "Specifies which proxy to use to transfer files.", "SetRemoteName": "Changes the remote name to a new URL in a download job.", "SetReplyFileName": "Specifies the name of the file to contain the reply data from the server application.", "SetSecurityFlags": "Sets flags for HTTP that determine whether the certificate revocation list is checked and certain certificate errors are ignored, and the policy to use when a server redirects the HTTP request.", "SetServerCertificateValidationInterface": "Server certificates are sent when an HTTPS connection is opened.", "SetValidationState": "Sets the validation state of this file.", "Skip": "Use the Skip method to skip the next specified number of elements in the enumeration sequence.", "Suspend": "Suspends a job.", "SuspendGroup": "Use the SuspendGroup method to pause a group in the download queue.", "SwitchToForeground": "Use the SwitchToForeground method to download the group in the foreground instead of the background.", "TakeOwnership": "Changes ownership of the job to the current user.", "UpdateDownloadPosition": "Specifies a position to prioritize downloading missing data from.", "ValidateServerCertificate": "A callback method that you implement that will be called so that you can validate the server certificates sent when an HTTPS connection is opened."}