{"CfCloseHandle": "Closes the file or directory handle returned by CfOpenFileWithOplock.", "CfConnectSyncRoot": "Initiates bi-directional communication between a sync provider and the sync filter API.", "CfConvertToPlaceholder": "Converts a normal file/directory to a placeholder file/directory.", "CfCreatePlaceholders": "Creates one or more new placeholder files or directories under a sync root tree.", "CfDisconnectSyncRoot": "Disconnects a communication channel created by CfConnectSyncRoot.", "CfExecute": "The main entry point for all connection key based placeholder operations.", "CfGetCorrelationVector": "Allows the sync provider to query the current correlation vector for a given placeholder file.", "CfGetPlaceholderInfo": "Gets various characteristics of a placeholder file or folder.", "CfGetPlaceholderRangeInfo": "Gets range information about a placeholder file or folder.", "CfGetPlaceholderStateFromAttributeTag": "Gets a set of placeholder states based on the FileAttributes and ReparseTag values of the file.", "CfGetPlaceholderStateFromFileInfo": "Gets a set of placeholder states based on the various information of the file.", "CfGetPlaceholderStateFromFindData": "Gets a set of placeholder states based on the WIN32_FIND_DATA structure.", "CfGetPlatformInfo": "Gets the platform version information.", "CfGetSyncRootInfoByHandle": "Gets various characteristics of the sync root containing a given file specified by a file handle.", "CfGetSyncRootInfoByPath": "Gets various sync root information given a file under the sync root.", "CfGetTransferKey": "Initiates a transfer of data into a placeholder file or folder.", "CfGetWin32HandleFromProtectedHandle": "Converts a protected handle to a Win32 handle so that it can be used with all handle-based Win32 APIs.", "CfHydratePlaceholder": "Hydrates a placeholder file by ensuring that the specified byte range is present on - disk in the placeholder.", "CfOpenFileWithOplock": "Opens an asynchronous opaque handle to a file or directory and sets up a proper oplock on it based on the open flags.", "CfQuerySyncProviderStatus": "Queries a sync provider to get the status of the provider.", "CfReferenceProtectedHandle": "Allows the caller to reference a protected handle to a Win32 handle which can be used with non-CfApi Win32 APIs.", "CfRegisterSyncRoot": "Performs a one time sync root registration.", "CfReleaseProtectedHandle": "Releases a protected handle referenced by CfReferenceProtectedHandle.", "CfReleaseTransferKey": "Releases a transfer key obtained by CfGetTransferKey.", "CfReportProviderProgress": "Allows a sync provider to report progress out-of-band.", "CfReportSyncStatus": "Allows a sync provider to notify the platform of its status on a specified sync root without having to connect with a call to CfConnectSyncRoot first.", "CfRevertPlaceholder": "Reverts a placeholder back to a regular file, stripping away all special characteristics such as the reparse tag, the file identity, etc.", "CfSetCorrelationVector": "Allows a sync provider to instruct the platform to use a specific correlation vector for telemetry purposes on a placeholder file.", "CfSetInSyncState": "Sets the in-sync state for a placeholder file or folder.", "CfSetPinState": "This sets the pin state of a placeholder, used to represent a users intent.", "CfUnregisterSyncRoot": "Unregisters a previously registered sync root.", "CfUpdatePlaceholder": "Updates characteristics of the placeholder file or directory.", "CfUpdateSyncProviderStatus": "Updates the current status of the sync provider."}