{"AddAtomA": "Adds a character string to the local atom table and returns a unique value identifying the string.", "AddAtomW": "Adds a character string to the local atom table and returns a unique value identifying the string.", "AddClipboardFormatListener": "Places the given window in the system-maintained clipboard format listener list.", "ChangeClipboardChain": "Removes a specified window from the chain of clipboard viewers.", "CloseClipboard": "Closes the clipboard.", "CountClipboardFormats": "Retrieves the number of different data formats currently on the clipboard.", "DdeAbandonTransaction": "Abandons the specified asynchronous transaction and releases all resources associated with the transaction.", "DdeAccessData": "Provides access to the data in the specified Dynamic Data Exchange object.", "DdeAddData": "Adds data to the specified Dynamic Data Exchange object.", "DdeClientTransaction": "Begins a data transaction between a client and a server.", "DdeCmpStringHandles": "Compares the values of two string handles.", "DdeConnect": "Establishes a conversation with a server application that supports the specified service name and topic name pair.", "DdeConnectList": "Establishes a conversation with all server applications that support the specified service name and topic name pair.", "DdeCreateDataHandle": "Creates a Dynamic Data Exchange object and fills the object with data from the specified buffer.", "DdeCreateStringHandleA": "Creates a handle that identifies the specified string.", "DdeCreateStringHandleW": "Creates a handle that identifies the specified string.", "DdeDisconnect": "Terminates a conversation started by either the DdeConnect or DdeConnectList function and invalidates the specified conversation handle.", "DdeDisconnectList": "Destroys the specified conversation list and terminates all conversations associated with the list.", "DdeEnableCallback": "Enables or disables transactions for a specific conversation or for all conversations currently established by the calling application.", "DdeFreeDataHandle": "Frees a Dynamic Data Exchange object and deletes the data handle associated with the object.", "DdeFreeStringHandle": "Frees a string handle in the calling application.", "DdeGetData": "Copies data from the specified Dynamic Data Exchange object to the specified local buffer.", "DdeGetLastError": "Retrieves the most recent error code set by the failure of a Dynamic Data Exchange Management Library function and resets the error code to DMLERR_NO_ERROR.", "DdeImpersonateClient": "Impersonates a Dynamic Data Exchange client application in a DDE client conversation.", "DdeInitializeA": "Registers an application with the Dynamic Data Exchange Management Library function.", "DdeInitializeW": "Registers an application with the Dynamic Data Exchange Management Library function.", "DdeKeepStringHandle": "Increments the usage count associated with the specified handle.", "DdeNameService": "Registers or unregisters the service names a Dynamic Data Exchange server supports.", "DdePostAdvise": "Causes the system to send an XTYP_ADVREQ transaction to the calling callback function for each client with an active advise loop on the specified topic and item.", "DdeQueryConvInfo": "Retrieves information about a Dynamic Data Exchange transaction and about the conversation in which the transaction takes place.", "DdeQueryNextServer": "Retrieves the next conversation handle in the specified conversation list.", "DdeQueryStringA": "Copies text associated with a string handle into a buffer.", "DdeQueryStringW": "Copies text associated with a string handle into a buffer.", "DdeReconnect": "Enables a client Dynamic Data Exchange Management Library application to attempt to reestablish a conversation with a service that has terminated a conversation with the client.", "DdeSetQualityOfService": "Specifies the quality of service application desires for future DDE conversations it initiates.", "DdeSetUserHandle": "Associates an application-defined value with a conversation handle or a transaction identifier.", "DdeUnaccessData": "Unaccesses a Dynamic Data Exchange object.", "DdeUninitialize": "Frees all Dynamic Data Exchange Management Library resources associated with the calling application.", "DeleteAtom": "Decrements the reference count of a local string atom.", "EmptyClipboard": "Empties the clipboard and frees handles to data in the clipboard.", "EnumClipboardFormats": "Enumerates the data formats currently available on the clipboard.", "FindAtomA": "Searches the local atom table for the specified character string and retrieves the atom associated with that string.", "FindAtomW": "Searches the local atom table for the specified character string and retrieves the atom associated with that string.", "FreeDDElParam": "Frees the memory specified by the lParam parameter of a posted Dynamic Data Exchange message.", "GetAtomNameA": "Retrieves a copy of the character string associated with the specified local atom.", "GetAtomNameW": "Retrieves a copy of the character string associated with the specified local atom.", "GetClipboardData": "Retrieves data from the clipboard in a specified format.", "GetClipboardFormatNameA": "Retrieves from the clipboard the name of the specified registered format.", "GetClipboardFormatNameW": "Retrieves from the clipboard the name of the specified registered format.", "GetClipboardOwner": "Retrieves the window handle of the current owner of the clipboard.", "GetClipboardSequenceNumber": "Retrieves the clipboard sequence number for the current window station.", "GetClipboardViewer": "Retrieves the handle to the first window in the clipboard viewer chain.", "GetOpenClipboardWindow": "Retrieves the handle to the window that currently has the clipboard open.", "GetPriorityClipboardFormat": "Retrieves the first available clipboard format in the specified list.", "GetUpdatedClipboardFormats": "Retrieves the currently supported clipboard formats.", "GlobalAddAtomA": "Adds a character string to the global atom table and returns a unique value identifying the string.", "GlobalAddAtomExA": "Adds a character string to the global atom table and returns a unique value identifying the string.", "GlobalAddAtomExW": "Adds a character string to the global atom table and returns a unique value identifying the string.", "GlobalAddAtomW": "Adds a character string to the global atom table and returns a unique value identifying the string.", "GlobalDeleteAtom": "Decrements the reference count of a global string atom.", "GlobalFindAtomA": "Searches the global atom table for the specified character string and retrieves the global atom associated with that string.", "GlobalFindAtomW": "Searches the global atom table for the specified character string and retrieves the global atom associated with that string.", "GlobalGetAtomNameA": "Retrieves a copy of the character string associated with the specified global atom.", "GlobalGetAtomNameW": "Retrieves a copy of the character string associated with the specified global atom.", "ImpersonateDdeClientWindow": "Enables a Dynamic Data Exchange server application to impersonate a DDE client application 's security context.", "InitAtomTable": "Initializes the local atom table and sets the number of hash buckets to the specified size.", "IsClipboardFormatAvailable": "Determines whether the clipboard contains data in the specified format.", "MAKEINTATOM": "Converts the specified atom into a string, so it can be passed to functions which accept either atoms or strings.", "OpenClipboard": "Opens the clipboard for examination and prevents other applications from modifying the clipboard content.", "PackDDElParam": "Packs a Dynamic Data Exchange lParam value into an internal structure used for sharing DDE data between processes.", "PFNCALLBACK": "An application-defined callback function used with the Dynamic Data Exchange Management Library functions.", "RegisterClipboardFormatA": "Registers a new clipboard format.", "RegisterClipboardFormatW": "Registers a new clipboard format.", "RemoveClipboardFormatListener": "Removes the given window from the system-maintained clipboard format listener list.", "ReuseDDElParam": "Enables an application to reuse a packed Dynamic Data Exchange lParam parameter, rather than allocating a new packed lParam.", "SetClipboardData": "Places data on the clipboard in a specified clipboard format.", "SetClipboardViewer": "Adds the specified window to the chain of clipboard viewers.", "UnpackDDElParam": "Unpacks a Dynamic Data ExchangelParam value received from a posted DDE message."}