{"_TrackMouseEvent": "Posts messages when the mouse pointer leaves a window or hovers over a window for a specified amount of time.", "Animate_Close": "Closes an AVI clip.", "Animate_Create": "Creates an animation control.", "Animate_IsPlaying": "Checks to see if an Audio-Video Interleaved clip is playing.", "Animate_Open": "Opens an AVI clip and displays its first frame in an animation control.", "Animate_OpenEx": "Opens an AVI clip from a resource in a specified module and displays its first frame in an animation control.", "Animate_Play": "Plays an AVI clip in an animation control.", "Animate_Seek": "Directs an animation control to display a particular frame of an AVI clip.", "Animate_Stop": "Stops playing an AVI clip in an animation control.", "Button_GetIdealSize": "Gets the size of the button that best fits the text and image, if an image list is present.", "Button_GetImageList": "Gets the BUTTON_IMAGELIST structure that describes the image list that is set for a button control.", "Button_GetNote": "Gets the text of the note associated with a command link button.", "Button_GetNoteLength": "Gets the length of the note text that may be displayed in the description for a command link.", "Button_GetSplitInfo": "Gets information for a specified split button control.", "Button_GetTextMargin": "Gets the margins used to draw text in a button control.", "Button_SetDropDownState": "Sets the drop down state for a specified button with style of BS_SPLITBUTTON.", "Button_SetElevationRequiredState": "Sets the elevation required state for a specified button or command link to display an elevated icon.", "Button_SetImageList": "Assigns an image list to a button control.", "Button_SetNote": "Sets the text of the note associated with a specified command link button.", "Button_SetSplitInfo": "Sets information for a specified split button control.", "Button_SetTextMargin": "Sets the margins for drawing text in a button control.", "ComboBox_GetCueBannerText": "Gets the cue banner text displayed in the edit control of a combo box.", "ComboBox_GetMinVisible": "Gets the minimum number of visible items in the drop-down list of a combo box.", "ComboBox_SetCueBannerText": "Sets the cue banner text that is displayed for the edit control of a combo box.", "ComboBox_SetMinVisible": "Sets the minimum number of visible items in the drop-down list of a combo box.", "CreateMappedBitmap": "Creates a bitmap for use in a toolbar.", "CreateStatusWindowA": "Creates a status window, which is typically used to display the status of an application.", "CreateStatusWindowW": "Creates a status window, which is typically used to display the status of an application.", "CreateToolbarEx": "Creates a toolbar window and adds the specified buttons to the toolbar.", "CreateUpDownControl": "Creates an up-down control.", "DateTime_CloseMonthCal": "Closes the date and time picker control.", "DateTime_GetDateTimePickerInfo": "Gets information for a specified date and time picker control.", "DateTime_GetIdealSize": "Gets the size needed to display the control without clipping.", "DateTime_GetMonthCal": "Gets the handle to a date and time picker's child month calendar control.", "DateTime_GetMonthCalColor": "Gets the color for a given portion of the month calendar within a date and time picker control.", "DateTime_GetMonthCalFont": "Gets the font that the date and time picker control's child month calendar control is currently using.", "DateTime_GetMonthCalStyle": "Gets the style of a specified date and time picker control.", "DateTime_GetRange": "Gets the current minimum and maximum allowable system times for a date and time picker control.", "DateTime_GetSystemtime": "Gets the currently selected time from a date and time picker control and places it in a specified SYSTEMTIME structure.", "DateTime_SetFormat": "Sets the display of a date and time picker control based on a given format string.", "DateTime_SetMonthCalColor": "Sets the color for a given portion of the month calendar within a date and time picker control.", "DateTime_SetMonthCalFont": "Sets the font to be used by the date and time picker control's child month calendar control.", "DateTime_SetMonthCalStyle": "Sets the style for a specified date and time picker control.", "DateTime_SetRange": "Sets the minimum and maximum allowable system times for a date and time picker control.", "DateTime_SetSystemtime": "Sets a date and time picker control to a given date and time.", "DefSubclassProc": "Calls the next handler in a window's subclass chain.", "DrawInsert": "Draws the insert icon in the parent window of the specified drag list box.", "DrawShadowText": "Draws text that has a shadow.", "DrawStatusTextA": "The DrawStatusText function draws the specified text in the style of a status window with borders.", "DrawStatusTextW": "The DrawStatusText function draws the specified text in the style of a status window with borders.", "Edit_EnableSearchWeb": "Enables or disables the Search with Bing context menu item in edit controls.", "Edit_GetCaretIndex": "Gets the character index of the caret location for a given edit control.", "Edit_GetCueBannerText": "Gets the text that is displayed as a textual cue, or tip, in an edit control.", "Edit_GetEndOfLine": "Gets the end of line character used for the content of the edit control.", "Edit_GetExtendedStyle": "Gets the extended styles that are currently in use for a given edit control.", "Edit_GetFileLine": "Gets the text of the specified file.", "Edit_GetFileLineCount": "Gets the number of file.", "Edit_GetFileLineFromChar": "Gets the index of the file.", "Edit_GetFileLineIndex": "Gets the index of the file line of text based on the specified visible line.", "Edit_GetFileLineLength": "Gets the length of the file.", "Edit_GetHilite": "This macro is not implemented.", "Edit_GetZoom": "Gets the current zoom ratio of an edit control.", "Edit_HideBalloonTip": "Hides any balloon tip associated with an edit control.", "Edit_NoSetFocus": "Prevents a single-line edit control from receiving keyboard focus.", "Edit_SearchWeb": "Invokes the Search with Bing context menu item in edit controls.", "Edit_SetCaretIndex": "Sets the character index at which to locate the caret.", "Edit_SetCueBannerText": "Sets the text that is displayed as the textual cue, or tip, for an edit control.", "Edit_SetCueBannerTextFocused": "Sets the text that is displayed as the textual cue, or tip, for an edit control.", "Edit_SetEndOfLine": "Sets the end of line character used for the content of the edit control.", "Edit_SetExtendedStyle": "Sets extended styles for edit controls using the style mask.", "Edit_SetHilite": "This macro is not implemented.", "Edit_SetZoom": "Sets the current zoom ratio of an edit control.", "Edit_ShowBalloonTip": "Displays a balloon tip associated with an edit control.", "Edit_TakeFocus": "Forces a single-line edit control to receive keyboard focus.", "FIRST_IPADDRESS": "Extracts the field 0 value from a packed IP address retrieved with the IPM_GETADDRESS message.", "FlatSB_EnableScrollBar": "Enables or disables one or both flat scroll bar direction buttons.", "FlatSB_GetScrollInfo": "Gets the information for a flat scroll bar.", "FlatSB_GetScrollPos": "Gets the thumb position in a flat scroll bar.", "FlatSB_GetScrollProp": "Gets the properties for a flat scroll bar.", "FlatSB_GetScrollPropPtr": "Gets the properties for a flat scroll bar.", "FlatSB_GetScrollRange": "Gets the scroll range for a flat scroll bar.", "FlatSB_SetScrollInfo": "Sets the information for a flat scroll bar.", "FlatSB_SetScrollPos": "Sets the current position of the thumb in a flat scroll bar.", "FlatSB_SetScrollProp": "Sets the properties for a flat scroll bar.", "FlatSB_SetScrollRange": "Sets the scroll range of a flat scroll bar.", "FlatSB_ShowScrollBar": "Shows or hides a flat scroll bar.", "FORWARD_WM_NOTIFY": "Sends or posts the WM_NOTIFY message.", "FOURTH_IPADDRESS": "Extracts the field 3 value from a packed IP address retrieved with the IPM_GETADDRESS message.", "GetEffectiveClientRect": "Calculates the dimensions of a rectangle in the client area that contains all the specified controls.", "GetMUILanguage": "Gets the language currently in use by the common controls for a particular process.", "GetWindowSubclass": "Retrieves the reference data for the specified window subclass callback.", "HANDLE_WM_NOTIFY": "Calls a function that processes the WM_NOTIFY message.", "Header_ClearAllFilters": "Clears all of the filters for a given header control.", "Header_ClearFilter": "Clears the filter for a given header control.", "Header_CreateDragImage": "Creates a transparent version of an item image within an existing header control.", "Header_DeleteItem": "Deletes an item from a header control.", "Header_EditFilter": "Moves the input focus to the edit box when a filter button has the focus.", "Header_GetBitmapMargin": "Gets the width of the margin of a bitmap in an existing header control.", "Header_GetFocusedItem": "Gets the item in a header control that has the focus.", "Header_GetImageList": "Gets the handle to the image list that has been set for an existing header control.", "Header_GetItem": "Gets information about an item in a header control.", "Header_GetItemCount": "Gets a count of the items in a header control.", "Header_GetItemDropDownRect": "Gets the coordinates of the drop-down button for a specified item in a header control.", "Header_GetItemRect": "Gets the bounding rectangle for a given item in a header control.", "Header_GetOrderArray": "Gets the current left-to-right order of items in a header control.", "Header_GetOverflowRect": "Gets the coordinates of the drop-down overflow area for a specified header control.", "Header_GetStateImageList": "Gets the handle to the image list that has been set for an existing header control state.", "Header_GetUnicodeFormat": "Gets the Unicode character format flag for the control.", "Header_InsertItem": "Inserts a new item into a header control.", "Header_Layout": "Retrieves the correct size and position of a header control within the parent window.", "Header_OrderToIndex": "Retrieves an index value for an item based on its order in the header control.", "Header_SetBitmapMargin": "Sets the width of the margin for a bitmap in an existing header control.", "Header_SetFilterChangeTimeout": "Sets the timeout interval between the time a change takes place in the filter attributes and the posting of an HDN_FILTERCHANGE notification.", "Header_SetFocusedItem": "Sets the focus to a specified item in a header control.", "Header_SetHotDivider": "Changes the color of a divider between header items to indicate the destination of an external drag-and-drop operation.", "Header_SetImageList": "Assigns an image list to an existing header control.", "Header_SetItem": "Sets the attributes of the specified item in a header control.", "Header_SetOrderArray": "Sets the left-to-right order of header items.", "Header_SetStateImageList": "Assigns an image list to an existing header control state.", "Header_SetUnicodeFormat": "Sets the UNICODE character format flag for the control.", "HIMAGELIST_QueryInterface": "Retrieves a pointer to an IImageList or IImageList2 object that corresponds to the image list's HIMAGELIST handle.", "ImageList_Add": "Adds an image or images to an image list.", "ImageList_AddIcon": "Adds an icon or cursor to an image list.", "ImageList_AddMasked": "Adds an image or images to an image list, generating a mask from the specified bitmap.", "ImageList_BeginDrag": "Begins dragging an image.", "ImageList_Copy": "Copies images within a given image list.", "ImageList_Create": "Creates a new image list.", "ImageList_Destroy": "Destroys an image list.", "ImageList_DragEnter": "Displays the drag image at the specified position within the window.", "ImageList_DragLeave": "Unlocks the specified window and hides the drag image, allowing the window to be updated.", "ImageList_DragMove": "Moves the image that is being dragged during a drag-and-drop operation.", "ImageList_DragShowNolock": "Shows or hides the image being dragged.", "ImageList_Draw": "Draws an image list item in the specified device context.", "ImageList_DrawEx": "Draws an image list item in the specified device context.", "ImageList_DrawIndirect": "Draws an image list image based on an IMAGELISTDRAWPARAMS structure.", "ImageList_Duplicate": "Creates a duplicate of an existing image list.", "ImageList_EndDrag": "Ends a drag operation.", "ImageList_ExtractIcon": "Calls the ImageList_GetIcon function to create an icon or cursor based on an image and mask in an image list.", "ImageList_GetBkColor": "Retrieves the current background color for an image list.", "ImageList_GetDragImage": "Retrieves the temporary image list that is used for the drag image.", "ImageList_GetIcon": "Creates an icon from an image and mask in an image list.", "ImageList_GetIconSize": "Retrieves the dimensions of images in an image list.", "ImageList_GetImageCount": "Retrieves the number of images in an image list.", "ImageList_GetImageInfo": "Retrieves information about an image.", "ImageList_LoadBitmap": "Calls the ImageList_LoadImage function to create an image list from the specified bitmap resource.", "ImageList_LoadImageA": "Creates an image list from the specified bitmap.", "ImageList_LoadImageW": "Creates an image list from the specified bitmap.", "ImageList_Merge": "Creates a new image by combining two existing images.", "ImageList_Read": "Reads an image list from a stream.", "ImageList_ReadEx": "Reads an image list from a stream, and returns an IImageList interface to the image list.", "ImageList_Remove": "Removes an image from an image list.", "ImageList_RemoveAll": "Calls the ImageList_Remove function to remove all of the images from an image list.", "ImageList_Replace": "Replaces an image in an image list with a new image.", "ImageList_ReplaceIcon": "Replaces an image with an icon or cursor.", "ImageList_SetBkColor": "Sets the background color for an image list.", "ImageList_SetDragCursorImage": "Creates a new drag image by combining the specified image with the current drag image.", "ImageList_SetIconSize": "Sets the dimensions of images in an image list and removes all images from the list.", "ImageList_SetImageCount": "Resizes an existing image list.", "ImageList_SetOverlayImage": "Adds a specified image to the list of images to be used as overlay masks.", "ImageList_Write": "Writes an image list to a stream.", "ImageList_WriteEx": "Writes an image list to a stream.", "INDEXTOOVERLAYMASK": "Prepares the index of an overlay mask so that the ImageList_Draw function can use it.", "INDEXTOSTATEIMAGEMASK": "Prepares the index of a state image so that a tree-view control or list-view control can use the index to retrieve the state image for an item.", "InitCommonControls": "Registers and initializes certain common control window classes.", "InitCommonControlsEx": "Ensures that the common control DLL is loaded, and registers specific common control classes from the DLL.", "InitializeFlatSB": "Initializes flat scroll bars for a particular window.", "InitMUILanguage": "Enables an application to specify a language to be used with the common controls that is different from the system language.", "LBItemFromPt": "Retrieves the index of the item at the specified point in a list box.", "ListView_ApproximateViewRect": "Calculates the approximate width and height required to display a given number of items.", "ListView_Arrange": "Arranges items in icon view.", "ListView_CancelEditLabel": "Cancels an item text editing operation.", "ListView_CreateDragImage": "Creates a drag image list for the specified item.", "ListView_DeleteAllItems": "Removes all items from a list-view control.", "ListView_DeleteColumn": "Removes a column from a list-view control.", "ListView_DeleteItem": "Removes an item from a list-view control.", "ListView_EditLabel": "Begins in-place editing of the specified list-view item's text.", "ListView_EnableGroupView": "Enables or disables whether the items in a list-view control display as a group.", "ListView_EnsureVisible": "Ensures that a list-view item is either entirely or partially visible, scrolling the list-view control if necessary.", "ListView_FindItem": "Searches for a list-view item with the specified characteristics.", "ListView_GetBkColor": "Gets the background color of a list-view control.", "ListView_GetBkImage": "Gets the background image in a list-view control.", "ListView_GetCallbackMask": "Gets the callback mask for a list-view control.", "ListView_GetCheckState": "Determines if an item in a list-view control is selected.", "ListView_GetColumn": "Gets the attributes of a list-view control's column.", "ListView_GetColumnOrderArray": "Gets the current left-to-right order of columns in a list-view control.", "ListView_GetColumnWidth": "Gets the width of a column in report or list view.", "ListView_GetCountPerPage": "Calculates the number of items that can fit vertically in the visible area of a list-view control when in list or report view.", "ListView_GetEditControl": "Gets the handle to the edit control being used to edit a list-view item's text.", "ListView_GetEmptyText": "Gets the text meant for display when the list-view control appears empty.", "ListView_GetExtendedListViewStyle": "Gets the extended styles that are currently in use for a given list-view control.", "ListView_GetFocusedGroup": "Gets the group that has the focus.", "ListView_GetFooterInfo": "Gets information on the footer of a specified list-view control.", "ListView_GetFooterItem": "Gets information on a footer item for a specified list-view control.", "ListView_GetFooterItemRect": "Gets the coordinates of a footer for a specified item in a list-view control.", "ListView_GetFooterRect": "Gets the coordinates of the footer for a specified list-view control.", "ListView_GetGroupCount": "Gets the number of groups.", "ListView_GetGroupHeaderImageList": "Gets the group header image list that has been set for an existing list-view control.", "ListView_GetGroupInfo": "Gets group information.", "ListView_GetGroupInfoByIndex": "Gets information on a specified group.", "ListView_GetGroupMetrics": "Gets information about the display of groups.", "ListView_GetGroupRect": "Gets the rectangle for a specified group.", "ListView_GetGroupState": "Gets the state for a specified group.", "ListView_GetHeader": "Gets the handle to the header control used by a list-view control.", "ListView_GetHotCursor": "Gets the HCURSOR used when the pointer is over an item while hot tracking is enabled.", "ListView_GetHotItem": "Gets the index of the hot item.", "ListView_GetHoverTime": "Gets the amount of time that the mouse cursor must hover over an item before it is selected.", "ListView_GetImageList": "Gets the handle to an image list used for drawing list-view items.", "ListView_GetInsertMark": "Gets the position of the insertion point.", "ListView_GetInsertMarkColor": "Gets the color of the insertion point.", "ListView_GetInsertMarkRect": "Gets the rectangle that bounds the insertion point.", "ListView_GetISearchString": "Gets the incremental search string of a list-view control.", "ListView_GetItem": "Gets some or all of a list-view item's attributes.", "ListView_GetItemCount": "Gets the number of items in a list-view control.", "ListView_GetItemIndexRect": "Gets the bounding rectangle for all or part of a subitem in the current view of a specified list-view control.", "ListView_GetItemPosition": "Gets the position of a list-view item.", "ListView_GetItemRect": "Gets the bounding rectangle for all or part of an item in the current view.", "ListView_GetItemSpacing": "Determines the spacing between items in a list-view control.", "ListView_GetItemState": "Gets the state of a list-view item.", "ListView_GetItemText": "Gets the text of a list-view item or subitem.", "ListView_GetNextItem": "Searches for a list-view item that has the specified properties and bears the specified relationship to a specified item.", "ListView_GetNextItemIndex": "Gets the index of the item in a particular list-view control that has the specified properties and relationship to another specific item.", "ListView_GetNumberOfWorkAreas": "Gets the number of working areas in a list-view control.", "ListView_GetOrigin": "Gets the current view origin for a list-view control.", "ListView_GetOutlineColor": "Gets the color of the border of a list-view control if the LVS_EX_BORDERSELECT extended window style is set.", "ListView_GetSelectedColumn": "Gets an integer that specifies the selected column.", "ListView_GetSelectedCount": "Determines the number of selected items in a list-view control.", "ListView_GetSelectionMark": "Gets the selection mark from a list-view control.", "ListView_GetStringWidth": "Determines the width of a specified string using the specified list-view control's current font.", "ListView_GetSubItemRect": "Gets information about the rectangle that surrounds a subitem in a list-view control.", "ListView_GetTextBkColor": "Gets the text background color of a list-view control.", "ListView_GetTextColor": "Gets the text color of a list-view control.", "ListView_GetTileInfo": "Gets information about a tile in a list-view control.", "ListView_GetTileViewInfo": "Gets information about a list-view control in tile view.", "ListView_GetToolTips": "Gets the tooltip control that the list-view control uses to display tooltips.", "ListView_GetTopIndex": "Gets the index of the topmost visible item when in list or report view.", "ListView_GetUnicodeFormat": "Gets the Unicode character format flag for the control.", "ListView_GetView": "Gets the current view of a list-view control.", "ListView_GetViewRect": "Gets the bounding rectangle of all items in the list-view control.", "ListView_GetWorkAreas": "Gets the working areas from a list-view control.", "ListView_HasGroup": "Determines whether the list-view control has a specified group.", "ListView_HitTest": "Determines which list-view item, if any, is at a specified position.", "ListView_HitTestEx": "Determines which list-view item, if any, is at a specified position.", "ListView_InsertColumn": "Inserts a new column in a list-view control.", "ListView_InsertGroup": "Inserts a group into a list-view control.", "ListView_InsertGroupSorted": "Inserts a group into an ordered list of groups.", "ListView_InsertItem": "Inserts a new item in a list-view control.", "ListView_InsertMarkHitTest": "Retrieves the insertion point closest to a specified point.", "ListView_IsGroupViewEnabled": "Checks whether the list-view control has group view enabled.", "ListView_IsItemVisible": "Indicates whether an item in the list-view control is visible.", "ListView_MapIDToIndex": "Maps the ID of an item to an index.", "ListView_MapIndexToID": "Maps the index of an item to a unique ID.", "ListView_MoveGroup": "This macro is not implemented.", "ListView_MoveItemToGroup": "This macro is not implemented.", "ListView_RedrawItems": "Forces a list-view control to redraw a range of items.", "ListView_RemoveAllGroups": "Removes all groups from a list-view control.", "ListView_RemoveGroup": "Removes a group from a list-view control.", "ListView_Scroll": "Scrolls the content of a list-view control.", "ListView_SetBkColor": "Sets the background color of a list-view control.", "ListView_SetBkImage": "Sets the background image in a list-view control.", "ListView_SetCallbackMask": "Changes the callback mask for a list-view control.", "ListView_SetCheckState": "Selects or deselects an item in a list-view control.", "ListView_SetColumn": "Sets the attributes of a list-view column.", "ListView_SetColumnOrderArray": "Sets the left-to-right order of columns in a list-view control.", "ListView_SetColumnWidth": "Used to change the width of a column in report view or the width of all columns in list-view mode.", "ListView_SetExtendedListViewStyle": "Sets extended styles for list-view controls.", "ListView_SetExtendedListViewStyleEx": "Sets extended styles for list-view controls using the style mask.", "ListView_SetGroupHeaderImageList": "Assigns an image list to the group header of a list-view control.", "ListView_SetGroupInfo": "Sets group information.", "ListView_SetGroupMetrics": "Sets information about the display of groups.", "ListView_SetGroupState": "Sets the state for a specified group.", "ListView_SetHotCursor": "Sets the HCURSOR that the list-view control uses when the pointer is over an item while hot tracking is enabled.", "ListView_SetHotItem": "Sets the hot item in a list-view control.", "ListView_SetHoverTime": "Sets the amount of time that the mouse cursor must hover over an item before it is selected.", "ListView_SetIconSpacing": "Sets the spacing between icons in list-view controls set to the LVS_ICON style.", "ListView_SetImageList": "Assigns an image list to a list-view control.", "ListView_SetInfoTip": "Sets tooltip text.", "ListView_SetInsertMark": "Sets the insertion point to the defined position.", "ListView_SetInsertMarkColor": "Sets the color of the insertion point.", "ListView_SetItem": "Sets some or all of a list-view item's attributes.", "ListView_SetItemCount": "Causes the list-view control to allocate memory for the specified number of items.", "ListView_SetItemCountEx": "Sets the virtual number of items in a virtual list view.", "ListView_SetItemIndexState": "Sets the state of a specified list-view item.", "ListView_SetItemPosition": "Moves an item to a specified position in a list-view control.", "ListView_SetItemPosition32": "Moves an item to a specified position in a list-view control.", "ListView_SetItemState": "Changes the state of an item in a list-view control.", "ListView_SetItemText": "Changes the text of a list-view item or subitem.", "ListView_SetOutlineColor": "Sets the color of the border of a list-view control if the LVS_EX_BORDERSELECT extended window style is set.", "ListView_SetSelectedColumn": "Sets the index of the selected column.", "ListView_SetSelectionMark": "Sets the selection mark in a list-view control.", "ListView_SetTextBkColor": "Sets the background color of text in a list-view control.", "ListView_SetTextColor": "Sets the text color of a list-view control.", "ListView_SetTileInfo": "Sets information for an existing tile of a list-view control.", "ListView_SetTileViewInfo": "Sets information that a list-view control uses in tile view.", "ListView_SetToolTips": "Sets the tooltip control that the list-view control will use to display tooltips.", "ListView_SetUnicodeFormat": "Sets the Unicode character format flag for the control.", "ListView_SetView": "Sets the view of a list-view control.", "ListView_SetWorkAreas": "Sets the working areas within a list-view control.", "ListView_SortGroups": "Uses an application-defined comparison function to sort groups by ID within a list-view control.", "ListView_SortItems": "Uses an application-defined comparison function to sort the items of a list-view control.", "ListView_SortItemsEx": "Uses an application-defined comparison function to sort the items of a list-view control.", "ListView_SubItemHitTest": "Determines which list-view item or subitem is located at a given position.", "ListView_SubItemHitTestEx": "Determines which list-view item or subitem is located at a given position.", "ListView_Update": "Updates a list-view item.", "LoadIconMetric": "Loads a specified icon resource with a client-specified system metric.", "LoadIconWithScaleDown": "Loads an icon.", "MakeDragList": "Changes the specified single-selection list box to a drag list box.", "MAKEIPADDRESS": "Packs four byte-values into a single LPARAM suitable for use with the IPM_SETADDRESS message.", "MAKEIPRANGE": "Packs two byte-values into a single LPARAM suitable for use with the IPM_SETRANGE message.", "MenuHelp": "Processes WM_MENUSELECT and WM_COMMAND messages and displays Help text about the current menu in the specified status window.", "MonthCal_GetCalendarBorder": "Gets the border size, in pixels, of a month calendar control.", "MonthCal_GetCalendarCount": "Gets the number of calendars currently displayed in the calendar control.", "MonthCal_GetCalendarGridInfo": "Gets information about a calendar grid.", "MonthCal_GetCALID": "Gets the current calendar ID for the given calendar control.", "MonthCal_GetColor": "Retrieves the color for a given portion of a month calendar control.", "MonthCal_GetCurrentView": "Gets the view for a month calendar control.", "MonthCal_GetCurSel": "Retrieves the currently selected date.", "MonthCal_GetFirstDayOfWeek": "Retrieves the first day of the week for a month calendar control.", "MonthCal_GetMaxSelCount": "Retrieves the maximum date range that can be selected in a month calendar control.", "MonthCal_GetMaxTodayWidth": "Retrieves the maximum width of the today string in a month calendar control.", "MonthCal_GetMinReqRect": "Retrieves the minimum size required to display a full month in a month calendar control.", "MonthCal_GetMonthDelta": "Retrieves the scroll rate for a month calendar control.", "MonthCal_GetMonthRange": "Retrieves date information that represents the high and low limits of a month calendar control's display.", "MonthCal_GetRange": "Retrieves the minimum and maximum allowable dates set for a month calendar control.", "MonthCal_GetSelRange": "Retrieves date information that represents the upper and lower limits of the date range currently selected by the user.", "MonthCal_GetToday": "Retrieves the date information for the date specified as today for a month calendar control.", "MonthCal_GetUnicodeFormat": "Retrieves the Unicode character format flag for the control.", "MonthCal_HitTest": "Determines which portion of a month calendar control is at a given point on the screen.", "MonthCal_SetCalendarBorder": "Sets the border size, in pixels, of a month calendar control.", "MonthCal_SetCALID": "Sets the calendar ID for the given calendar control.", "MonthCal_SetColor": "Sets the color for a given portion of a month calendar control.", "MonthCal_SetCurrentView": "Sets the view for a month calendar control.", "MonthCal_SetCurSel": "Sets the currently selected date for a month calendar control.", "MonthCal_SetDayState": "Sets the day states for all months that are currently visible within a month calendar control.", "MonthCal_SetFirstDayOfWeek": "Sets the first day of the week for a month calendar control.", "MonthCal_SetMaxSelCount": "Sets the maximum number of days that can be selected in a month calendar control.", "MonthCal_SetMonthDelta": "Sets the scroll rate for a month calendar control.", "MonthCal_SetRange": "Sets the minimum and maximum allowable dates for a month calendar control.", "MonthCal_SetSelRange": "Sets the selection for a month calendar control to a given date range.", "MonthCal_SetToday": "Sets the today selection for a month calendar control.", "MonthCal_SetUnicodeFormat": "Sets the Unicode character format flag for the control.", "MonthCal_SizeRectToMin": "Calculates how many calendars will fit in the given rectangle, and then returns the minimum size that a rectangle needs to be to fit that number of calendars.", "Pager_ForwardMouse": "Enables or disables mouse forwarding for the pager control.", "Pager_GetBkColor": "Retrieves the current background color for the pager control.", "Pager_GetBorder": "Retrieves the current border size for the pager control.", "Pager_GetButtonSize": "Retrieves the current button size for the pager control.", "Pager_GetButtonState": "Retrieves the state of the specified button in a pager control.", "Pager_GetDropTarget": "Retrieves a pager control's IDropTarget interface pointer.", "Pager_GetPos": "Retrieves the current scroll position of the pager control.", "Pager_RecalcSize": "Forces the pager control to recalculate the size of the contained window.", "Pager_SetBkColor": "Sets the current background color for the pager control.", "Pager_SetBorder": "Sets the current border size for the pager control.", "Pager_SetButtonSize": "Sets the current button size for the pager control.", "Pager_SetChild": "Sets the contained window for the pager control.", "Pager_SetPos": "Sets the scroll position for the pager control.", "Pager_SetScrollInfo": "Sets the scrolling parameters of the pager control, including the timeout value, the lines per timeout, and the pixels per line.", "RemoveWindowSubclass": "Removes a subclass callback from a window.", "SECOND_IPADDRESS": "Extracts the field 1 value from a packed IP address retrieved with the IPM_GETADDRESS message.", "SetWindowSubclass": "Installs or updates a window subclass callback.", "ShowHideMenuCtl": "Sets or removes the specified menu item's check mark attribute and shows or hides the corresponding control.", "TabCtrl_AdjustRect": "Calculates a tab control's display area given a window rectangle, or calculates the window rectangle that would correspond to a specified display area.", "TabCtrl_DeleteAllItems": "Removes all items from a tab control.", "TabCtrl_DeleteItem": "Removes an item from a tab control.", "TabCtrl_DeselectAll": "Resets items in a tab control, clearing any that were set to the TCIS_BUTTONPRESSED state.", "TabCtrl_GetCurFocus": "Returns the index of the item that has the focus in a tab control.", "TabCtrl_GetCurSel": "Determines the currently selected tab in a tab control.", "TabCtrl_GetExtendedStyle": "Retrieves the extended styles that are currently in use for the tab control.", "TabCtrl_GetImageList": "Retrieves the image list associated with a tab control.", "TabCtrl_GetItem": "Retrieves information about a tab in a tab control.", "TabCtrl_GetItemCount": "Retrieves the number of tabs in the tab control.", "TabCtrl_GetItemRect": "Retrieves the bounding rectangle for a tab in a tab control.", "TabCtrl_GetRowCount": "Retrieves the current number of rows of tabs in a tab control.", "TabCtrl_GetToolTips": "Retrieves the handle to the tooltip control associated with a tab control.", "TabCtrl_GetUnicodeFormat": "Retrieves the UNICODE character format flag for the control.", "TabCtrl_HighlightItem": "Sets the highlight state of a tab item.", "TabCtrl_HitTest": "Determines which tab, if any, is at a specified screen position.", "TabCtrl_InsertItem": "Inserts a new tab in a tab control.", "TabCtrl_RemoveImage": "Removes an image from a tab control's image list.", "TabCtrl_SetCurFocus": "Sets the focus to a specified tab in a tab control.", "TabCtrl_SetCurSel": "Selects a tab in a tab control.", "TabCtrl_SetExtendedStyle": "Sets the extended styles that the tab control will use.", "TabCtrl_SetImageList": "Assigns an image list to a tab control.", "TabCtrl_SetItem": "Sets some or all of a tab's attributes.", "TabCtrl_SetItemExtra": "Sets the number of bytes per tab reserved for application-defined data in a tab control.", "TabCtrl_SetItemSize": "Sets the width and height of tabs in a fixed-width or owner-drawn tab control.", "TabCtrl_SetMinTabWidth": "Sets the minimum width of items in a tab control.", "TabCtrl_SetPadding": "Sets the amount of space around each tab's icon and label in a tab control.", "TabCtrl_SetToolTips": "Assigns a tooltip control to a tab control.", "TabCtrl_SetUnicodeFormat": "Sets the Unicode character format flag for the control.", "TaskDialog": "The TaskDialog function creates, displays, and operates a task dialog.", "TaskDialogIndirect": "The TaskDialogIndirect function creates, displays, and operates a task dialog.", "THIRD_IPADDRESS": "Extracts the field 2 value from a packed IP address retrieved with the IPM_GETADDRESS message.", "TreeView_CreateDragImage": "Creates a dragging bitmap for the specified item in a tree-view control.", "TreeView_DeleteAllItems": "Deletes all items from a tree-view control.", "TreeView_DeleteItem": "Removes an item and all its children from a tree-view control.", "TreeView_EditLabel": "Begins in-place editing of the specified item's text, replacing the text of the item with a single-line edit control containing the text.", "TreeView_EndEditLabelNow": "Ends the editing of a tree-view item's label.", "TreeView_EnsureVisible": "Ensures that a tree-view item is visible, expanding the parent item or scrolling the tree-view control, if necessary.", "TreeView_Expand": "The TreeView_Expand macro expands or collapses the list of child items associated with the specified parent item, if any.", "TreeView_GetBkColor": "Retrieves the current background color of the control.", "TreeView_GetCheckState": "Gets the check state of the specified item.", "TreeView_GetChild": "Retrieves the first child item of the specified tree-view item.", "TreeView_GetCount": "Retrieves a count of the items in a tree-view control.", "TreeView_GetDropHilight": "Retrieves the tree-view item that is the target of a drag-and-drop operation.", "TreeView_GetEditControl": "Retrieves the handle to the edit control being used to edit a tree-view item's text.", "TreeView_GetExtendedStyle": "Retrieves the extended style for a specified tree-view control.", "TreeView_GetFirstVisible": "Retrieves the first visible item in a tree-view control window.", "TreeView_GetImageList": "Retrieves the handle to the normal or state image list associated with a tree-view control.", "TreeView_GetIndent": "Retrieves the amount, in pixels, that child items are indented relative to their parent items.", "TreeView_GetInsertMarkColor": "Retrieves the color used to draw the insertion mark for the tree view.", "TreeView_GetISearchString": "Retrieves the incremental search string for a tree-view control.", "TreeView_GetItem": "Retrieves some or all of a tree-view item's attributes.", "TreeView_GetItemHeight": "Retrieves the current height of the tree-view items.", "TreeView_GetItemPartRect": "Retrieves the largest possible bounding rectangle that constitutes the hit zone for a specified part of an item.", "TreeView_GetItemRect": "Retrieves the bounding rectangle for a tree-view item and indicates whether the item is visible.", "TreeView_GetItemState": "Retrieves some or all of a tree-view item's state attributes.", "TreeView_GetLastVisible": "Retrieves the last expanded item in a tree-view control.", "TreeView_GetLineColor": "Gets the current line color.", "TreeView_GetNextItem": "Retrieves the tree-view item that bears the specified relationship to a specified item.", "TreeView_GetNextSelected": "Retrieves the tree-view item that bears the TVGN_NEXTSELECTED relationship to a specified tree item.", "TreeView_GetNextSibling": "Retrieves the next sibling item of a specified item in a tree-view control.", "TreeView_GetNextVisible": "Retrieves the next visible item that follows a specified item in a tree-view control.", "TreeView_GetParent": "Retrieves the parent item of the specified tree-view item.", "TreeView_GetPrevSibling": "Retrieves the previous sibling item of a specified item in a tree-view control.", "TreeView_GetPrevVisible": "Retrieves the first visible item that precedes a specified item in a tree-view control.", "TreeView_GetRoot": "Retrieves the topmost or very first item of the tree-view control.", "TreeView_GetScrollTime": "Retrieves the maximum scroll time for the tree-view control.", "TreeView_GetSelectedCount": "TreeView_GetSelectedCount macro", "TreeView_GetSelection": "Retrieves the currently selected item in a tree-view control.", "TreeView_GetTextColor": "Retrieves the current text color of the control.", "TreeView_GetToolTips": "Retrieves the handle to the child tooltip control used by a tree-view control.", "TreeView_GetUnicodeFormat": "Retrieves the Unicode character format flag for the control.", "TreeView_GetVisibleCount": "Obtains the number of items that can be fully visible in the client window of a tree-view control.", "TreeView_HitTest": "Determines the location of the specified point relative to the client area of a tree-view control.", "TreeView_InsertItem": "Inserts a new item in a tree-view control.", "TreeView_MapAccIDToHTREEITEM": "Maps an accessibility ID to an HTREEITEM.", "TreeView_MapHTREEITEMToAccID": "Maps an HTREEITEM to an accessibility ID.", "TreeView_Select": "Selects the specified tree-view item, scrolls the item into view, or redraws the item in the style used to indicate the target of a drag-and-drop operation.", "TreeView_SelectDropTarget": "Redraws a specified tree-view control item in the style used to indicate the target of a drag-and-drop operation.", "TreeView_SelectItem": "Selects the specified tree-view item.", "TreeView_SelectSetFirstVisible": "Scrolls the tree-view control vertically to ensure that the specified item is visible.", "TreeView_SetAutoScrollInfo": "Sets information used to determine auto-scroll characteristics.", "TreeView_SetBkColor": "Sets the background color of the control.", "TreeView_SetBorder": "Sets the size of the border for the items in a tree-view control.", "TreeView_SetCheckState": "Sets the item's state image to checked or unchecked. ", "TreeView_SetExtendedStyle": "Sets the extended style for a specified TreeView control.", "TreeView_SetHot": "Sets the hot item for a tree-view control.", "TreeView_SetImageList": "Sets the normal or state image list for a tree-view control and redraws the control using the new images.", "TreeView_SetIndent": "Sets the width of indentation for a tree-view control and redraws the control to reflect the new width.", "TreeView_SetInsertMark": "Sets the insertion mark in a tree-view control.", "TreeView_SetInsertMarkColor": "Sets the color used to draw the insertion mark for the tree view.", "TreeView_SetItem": "The TreeView_SetItem macro sets some or all of a tree-view item's attributes.", "TreeView_SetItemHeight": "Sets the height of the tree-view items.", "TreeView_SetItemState": "Sets a tree-view item's state attributes.", "TreeView_SetLineColor": "Sets the current line color.", "TreeView_SetScrollTime": "Sets the maximum scroll time for the tree-view control.", "TreeView_SetTextColor": "Sets the text color of the control.", "TreeView_SetToolTips": "Sets a tree-view control's child tooltip control.", "TreeView_SetUnicodeFormat": "Sets the Unicode character format flag for the control.", "TreeView_ShowInfoTip": "Shows the infotip for a specified item in a tree-view control.", "TreeView_SortChildren": "Sorts the child items of the specified parent item in a tree-view control.", "TreeView_SortChildrenCB": "Sorts tree-view items using an application-defined callback function that compares the items.", "UninitializeFlatSB": "Uninitializes flat scroll bars for a particular window."}