{"CreatePropertySheetPageA": "Creates a new page for a property sheet.", "CreatePropertySheetPageW": "Creates a new page for a property sheet.", "DestroyPropertySheetPage": "Destroys a property sheet page.", "PropertySheetA": "Creates a property sheet and adds the pages defined in the specified property sheet header structure.", "PropertySheetW": "Creates a property sheet and adds the pages defined in the specified property sheet header structure.", "PropSheet_AddPage": "Adds a new page to the end of an existing property sheet.", "PropSheet_Apply": "Simulates the selection of the Apply button, indicating that one or more pages have changed and the changes need to be validated and recorded.", "PropSheet_CancelToClose": "Used when changes made since the most recent PSN_APPLY notification can not be canceled.", "PropSheet_Changed": "Informs a property sheet that information in a page has changed.", "PropSheet_EnableWizButtons": "Enables or disables buttons in an Aero wizard.", "PropSheet_GetCurrentPageHwnd": "Retrieves a handle to the window of the current page of a property sheet.", "PropSheet_GetResult": "Used by modeless property sheets to retrieve the information returned to modal property sheets by PropertySheet.", "PropSheet_GetTabControl": "Retrieves the handle to the tab control of a property sheet.", "PropSheet_HwndToIndex": "Takes a window handle of the property sheet page and returns its zero-based index.", "PropSheet_IdToIndex": "Takes the resource identifier of a property sheet page and returns its zero-based index.", "PropSheet_IndexToHwnd": "Takes the index of a property sheet page and returns its window handle.", "PropSheet_IndexToId": "Takes the index of a property sheet page and returns its resource identifier.", "PropSheet_IndexToPage": "Takes the index of a property sheet page and returns its HPROPSHEETPAGE handle.", "PropSheet_InsertPage": "Inserts a new page into an existing property sheet.", "PropSheet_IsDialogMessage": "Passes a message to a property sheet dialog box and indicates whether the dialog box processed the message.", "PropSheet_PageToIndex": "Takes the HPROPSHEETPAGE handle of a property sheet page and returns its zero-based index.", "PropSheet_PressButton": "Simulates the selection of a property sheet button.", "PropSheet_QuerySiblings": "Causes a property sheet to send the PSM_QUERYSIBLINGS message to each of its pages.", "PropSheet_RebootSystem": "Indicates the system needs to be restarted for the changes to take effect.", "PropSheet_RecalcPageSizes": "Recalculates the page size of a standard or wizard property sheet after pages have been added or removed.", "PropSheet_RemovePage": "Removes a page from a property sheet.", "PropSheet_RestartWindows": "Sends a PSM_RESTARTWINDOWS message indicating that Windows needs to be restarted for changes to take effect.", "PropSheet_SetButtonText": "Sets the text of a button in an Aero wizard.", "PropSheet_SetCurSel": "Activates the specified page in a property sheet.", "PropSheet_SetCurSelByID": "Activates the specified page in a property sheet based on the resource identifier of the page.", "PropSheet_SetFinishText": "Sets the text of the Finish button in a wizard, shows and enables the button, and hides the Next and Back buttons.", "PropSheet_SetHeaderSubTitle": "Sets the subtitle text for the header of a wizard's interior page.", "PropSheet_SetHeaderTitle": "Sets the title text for the header of a wizard's interior page.", "PropSheet_SetNextText": "Sets the text of the Next button in a wizard.", "PropSheet_SetTitle": "Sets the title of a property sheet.", "PropSheet_SetWizButtons": "Enables or disables the Back, Next, and Finish buttons in a wizard by posting a PSM_SETWIZBUTTONS message.", "PropSheet_ShowWizButtons": "Show or hide buttons in a wizard.", "PropSheet_UnChanged": "Informs a property sheet that information in a page has reverted to the previously saved state."}