{"_CancelPendingNavigationAsync": "Enables a derived class to request that the base class cancel any pending navigation.", "_CancelPendingView": "Enables a derived class to request that the base class cancel any pending views.", "_CloseAndReleaseToolbars": "Deprecated.", "_DisableModeless": "Enables a derived class to ask the base class whether a modal UI is visible.", "_ExecChildren": "Enables the derived class to issue a command through the IOleCommandTarget::Exec method directly, instead of relying on the base class.", "_FindTBar": "Returns the index of a browser toolbar item based on Component Object Model identity rules.", "_get_itbLastFocus": "Deprecated.", "_GetBorderDWHelper": "Deprecated.", "_GetEffectiveClientArea": "Deprecated.", "_GetToolbarCount": "Deprecated.", "_GetToolbarItem": "Gets a specific item from a toolbar.", "_GetViewBorderRect": "Deprecated.", "_Initialize": "Deprecated.", "_LoadToolbars": "Deprecated.", "_MaySaveChanges": "Enables the base class to check whether the browser view needs to save changes before closing.", "_NavigateToPidl": "Deprecated.", "_NewEnum": "Retrieves an enumerator for the collection of Shell windows.", "_OnFocusChange": "Coordinates focus between the base and the derived class when the focus shifts between the derived class 's browser toolbars and its view.", "_PauseOrResumeView": "Enables a derived class to request the base class to either pause or resume the browser view.", "_PositionViewWindow": "Deprecated.", "_put_itbLastFocus": "Deprecated.", "_ResizeAllBorders": "Deprecated.", "_ResizeNextBorder": "Resizes the border of the browser view in response to the addition or removal of toolbars.", "_ResizeNextBorderHelper": "A helper method used by the implementation of IBrowserService2::_ResizeNextBorder.", "_ResizeView": "Deprecated.", "_SaveToolbars": "Deprecated.", "_SendChildren": "Allows the derived class to send a message through the SendMessage function directly instead of relying on the base class.", "_SetFocus": "Deprecated.", "_SwitchActivationNow": "Coordinates state updates while switching between current and pending browser views.", "_TryShell2Rename": "Coordinates the renaming of the current browser view when the browser is redirected.", "_UIActivateView": "Allows a derived class to request that the base class update the browser view.", "_UpdateViewRectSize": "Called to inform other functions involved in the browser view size negotiations that the allowable browser view dimensions have changed.", "AbortList": "Discontinues a Jump List building session initiated by ICustomDestinationList::BeginList without committing any changes.", "Activate": "An active handler can be synchronized ; an inactive handler can not.", "ActivateApplication": "Activates the specified Windows Store app for the generic launch contract in the current session.", "ActivateBackgroundTask": "Activates the specified background task.", "ActivateForFile": "Activates the specified Windows Store app for the file contract.", "ActivateForProtocol": "Activates the specified Windows Store app for the protocol contract.", "ActivateHandler": "Activates or deactivates a handler.", "ActivatePendingView": "Coordinates state updating while the browser is switching between a current and a pending view.", "ActivateTab": "Activates an item on the taskbar.", "ActivateView": "Deprecated.", "AddBand": "Adds a band to a band site object.", "AddCheckButton": "Adds a check button to the dialog.", "AddComboBox": "Adds a combo box to the dialog.", "AddControlItem": "Adds an item to a container control in the dialog.", "AddCreateFlags": "Set additional flags that will be included in the call to CreateProcess.", "AddDataBlock": "Adds a data block to a link.", "AddEditBox": "Adds an edit box control to the dialog.", "AddEntry": "Deprecated.", "AddFolder": "Adds a folder to the library.", "AddFromArray": "Adds the objects contained in an IObjectArray to the collection.", "AddIDList": "Inserts a pointer to an item identifier list into a results folder.", "AddItem": "Adds an item to a results folder.", "AddItemToSession": "Adds a specified item to the set of items currently being synchronized.", "AddMenu": "Adds a menu to the dialog.", "AddObject": "Adds a single object to the collection.", "AddPages": "Adds one or more pages to a property sheet that the Shell displays for a file object.", "AddPlace": "Adds a folder to the list of places available for the user to open or save items.", "AddPropertySheetPages": "Allows the view to add pages to the Options property sheet from the View menu.", "AddPushButton": "Adds a button to the dialog.", "AddRadioButtonList": "Adds an option button group to the dialog.", "AddSeparator": "Adds a separator to the dialog, allowing a visual separation of controls.", "AddStartupFlags": "Additional flags that will be included in the STARTUPINFO structure passed to CreateProcess.", "AddTab": "Adds an item to the taskbar.", "AddTask": "Adds a task to the scheduler's background queue.", "AddText": "Adds text content to the dialog.", "AddToolbar": "Adds the specified IDockingWindow object to the frame.", "AddUserTasks": "Specifies items to include in the Tasks category of a custom Jump List.", "AdvanceSlideshow": "Switches the wallpaper on a specified monitor to the next image in the slideshow.", "Advise": "Enables a credential to initiate events in the Logon UI or Credential UI through a callback interface.", "AdviseWithHWND": "Registers the app 's input pane handler object to receive notifications on behalf of a window when an event triggers the input pane.", "AllowAutoPlay": "Determines whether to play media inserted by a user and if so using what restrictions.", "AllowViewResize": "Deprecated.", "Append": "Appends an object to the collection of managed objects.", "AppendCategory": "Defines a custom category and the destinations that it contains, for inclusion in a custom Jump List.", "AppendFieldComboBoxItem": "Communicates to the Logon UI or Credential UI that a combo box needs an item appended and that the UI should be updated.", "AppendKnownCategory": "Specifies that the Frequent or Recent category should be included in a custom Jump List.", "AppendRoot": "Appends a Shell item to the list of roots in a tree.", "APPLET_PROC": "Serves as the entry point for a Control Panel application.", "ApplyProperties": "Applies a set of properties to an item using the Shell's copy engine.", "ApplyPropertiesToItem": "Apply a set of property changes to an item.", "ApplyPropertiesToItems": "Declares a set of items for which to apply a common set of property values.", "AppVisibilityOnMonitorChanged": "Notifies a client that the mode of a display has changed.", "ArePrintersShared": "Determines whether any printers connected to this computer are shared.", "AreSnapshotsAvailable": "Queries for the availability of a Windows ServerÂ 2003 volume image recorded by the system at an earlier time.", "ArrangeGrid": "Arranges moved icons so that they align to an invisible grid.", "AssocCreate": "Returns a pointer to an IQueryAssociations object.", "AssocCreateForClasses": "Retrieves an object that implements an IQueryAssociations interface.", "AssocGetDetailsOfPropKey": "Retrieves the value for a given property key using the file association information provided by the Namespace Extensions.", "AssocGetPerceivedType": "Retrieves a file's perceived type based on its extension.", "AssocIsDangerous": "Determines whether a file type is considered a potential security risk.", "AssocQueryKeyA": "Searches for and retrieves a key related to a file or protocol association from the registry.", "AssocQueryKeyW": "Searches for and retrieves a key related to a file or protocol association from the registry.", "AssocQueryStringA": "Searches for and retrieves a file or protocol association-related string from the registry.", "AssocQueryStringByKeyA": "Searches for and retrieves a file association-related string from the registry starting from a specified key.", "AssocQueryStringByKeyW": "Searches for and retrieves a file association-related string from the registry starting from a specified key.", "AssocQueryStringW": "Searches for and retrieves a file or protocol association-related string from the registry.", "AutoArrange": "AutoArrange may be altered or unavailable.", "BeforeCoCreateInstance": ".", "BeforeCreateProcess": ".", "Begin": "Called when an action has begun that requires its progress be displayed to the user.", "BeginFieldUpdates": "Starts a batch update to fields in the logon or credential UI.", "BeginList": "Initiates a building session for a custom Jump List.", "BindToConflict": "Binds to a particular conflict specified by IID.", "BindToHandler": "Instantiates a specified sync handler when called by Sync Center.", "BindToObject": "Optional parameters that control the construction of the handler are passed in the bind context.", "BindToStorage": "Requests a pointer to an object's storage interface.", "BrowseObject": "Informs Windows Explorer to browse to another folder.", "BrowseToIDList": "Browses to a pointer to an item identifier list", "BrowseToObject": "Browses to an object.", "Burn": "Instructs data to be copied from the staging area to a writable CD.", "ByteToChar": "Converts a value of type BYTE to a value of type CHAR.", "ByteToInt8": "Converts a value of type BYTE to a value of type INT8.", "CacheOLEServer": "Caches a reference to an external object to avoid reloading the server on reuse.", "CallBack": "Enables the callback function for a context menu.", "CallbackSM": "Receives messages from a menu band object.", "CanCategorizeOnSCID": "Determines whether a column can be used as a category.", "CancelIo": "Marks all pending input/output operations as canceled.", "CanContinue": "Determines whether the synchronization has been canceled.", "CanNavigateNow": "Deprecated.", "CanRenderComposited": "Indicates the deskband's ability to be displayed as translucent.", "CaptureThumbnail": "Retrieves a thumbnail representation of an IHTMLDocument2 document.", "CDefFolderMenu_Create2": "Creates a context menu for a selected group of file folder objects.", "CheckPolicy": "Provides a Boolean test that can be used to make decisions based on the attachment's execution policy.", "ChrCmpIA": "Performs a comparison between two characters.", "ChrCmpIW": "Performs a comparison between two characters.", "CIDLData_CreateFromIDArray": "CIDLData_CreateFromIDArray may be altered or unavailable.", "Clear": "Removes all objects from the collection.", "ClearClientData": "Instructs the dialog to clear all persisted state information.", "ClearClientState": "Removes any stored state that is based on the client 's GUID.", "ClearUserAssociations": "Removes all per - user associations for the current user.", "Clone": "Deprecated.", "CloneFrame": "Retrieves a clone of the current image or frame.", "Close": "Closes the dialog.", "CloseDW": "Notifies the docking window object that it is about to be removed from the frame.", "CloseFile": "Closes the file currently in use.", "CollapseAll": "Collapses all of the items in the given tree.", "ColorAdjustLuma": "Changes the luminance of a RGB value.", "ColorHLSToRGB": "Converts colors from hue-luminance-saturation to RGB format.", "ColorRGBToHLS": "Converts colors from RGB to hue-luminance-saturation format.", "ColumnClick": "Rearranges a column.", "CommandLineToArgvW": "Parses a Unicode command line string and returns an array of pointers to the command line arguments, along with a count of such arguments, in a way that is similar to the standard C run-time argv and argc values.", "CommandLinkClicked": "Enables the Logon UI and Credential UI to indicate that a link was clicked.", "Commit": "Commits library updates to an existing Library Description file.", "CommitItem": "Confirms a specified item as a member of the handler's sync set and confirms that it should be shown in the UI.", "CommitList": "Declares that the Jump List initiated by a call to ICustomDestinationList::BeginList is complete and ready for display.", "Compare": "Compares two IShellItem objects.", "CompareCategory": "Determines the relative order of two items in their item identifier lists, and hence in the UI.", "CompareIDs": "Determines the relative order of two file objects or folders, given their item identifier lists.", "ComputeApplicationSize": "Gets the size of the Windows Store app, based on the current set of spoofed settings.", "ComputerInfoChanged": "Not supported.", "ConfirmEncryptionLoss": "Displays a message to the user confirming that loss of encryption is acceptable for this operation.", "ConfirmOverwrite": "Displays a message to the user confirming that overwriting existing items is acceptable.", "Connect": "This method is called after the user clicks the Submit button within the Pre - Logon - Access Provider screen and before ICredentialProviderCredential::GetSerialization is called.", "ConnectToConnectionPoint": "Establishes or terminates a connection between a client's sink and a connection point container.", "CopyCallback": "Determines whether the Shell will be allowed to move, copy, delete, or rename a folder or printer object.", "CopyDataBlock": "Retrieves a copy of a link's data block.", "CopyItem": "Declares a single item that is to be copied to a specified destination.", "CopyItems": "Declares a set of items that are to be copied to a specified destination.", "CountEntries": "Deprecated.", "CountTasks": "Counts tasks with the same owner ID in the scheduler's queue.", "CreateAppContainerProfile": "Creates a per-user, per-app profile for Windows Store apps.", "CreateBand": "Creates a specified band.", "CreateBrowserPropSheetExt": "Allows the derived class to add Folder Options property sheets to the base class.", "CreateCategory": "Creates a category object.", "CreateEnumIDListFromContents": "Creates an enumerator of ID lists from the contents of the view.", "CreateEnvironmentBlock": "Retrieves the environment variables for the specified user.", "CreateImageFromFile": "Creates an instance of the IShellImageData interface based on a given file.", "CreateImageFromStream": "Creates an instance of the IShellImageData interface based on a given file stream.", "CreateInvoker": "Retrieves an object that enables the invocation of the associated handler on the current selection.", "CreateIShellImageData": "Creates an instance of the IShellImageData interface.", "CreateItem": "Creates the specified file.", "CreateItemID": "Creates an ItemID from the supplied data.", "CreateObject": "Creates a local object of a specified class and returns a pointer to a specified interface on the object.", "CreateProfile": "Creates a new user profile.", "CreateResource": "Creates a specified resource.", "CreateSession": "Notifies Sync Center that synchronization of the specified items has begun.", "CreateShare": "Shares the Users or Public folder.", "CreateViewObject": "Requests an object that can be used to obtain information from or interact with a folder object.", "CreateViewWindow": "Deprecated.", "CreateViewWindow2": "It can be either the right pane of Windows Explorer or the client window of a folder window.", "CreateViewWindow3": "The view can be either the right pane of Windows Explorer or the client window of a folder window.", "CredentialsChanged": "Signals the Logon UI or Credential UI that the enumerated list of credentials has changed.", "DAD_AutoScroll": "Scrolls the window while an image is being dragged.", "DAD_DragEnterEx": "Locks updates to the specified window during a drag operation and displays the drag image at the specified position within the window.", "DAD_DragEnterEx2": "Locks updates to the specified window during a drag-and-drop operation and displays the drag image at the specified position within the window.", "DAD_DragLeave": "Unlocks the window locked by the DAD_DragEnterEx function.", "DAD_DragMove": "Moves the image that is being dragged during a drag-and-drop operation.", "DAD_SetDragImage": "Sets the drag image.", "DAD_ShowDragImage": "Shows or hides the image being dragged.", "Decode": "Decodes the image file, setting state.", "DEFINE_PROPERTYKEY": "Used to pack a format identifier into a PROPERTYKEY structure that represents a property key.", "DefScreenSaverProc": "Provides default processing for any messages that a screen saver application does not process.", "DefSubclassProc": "Calls the next handler in a window 's subclass chain.", "Delete": "Deletes a sync item.", "DeleteAppContainerProfile": "Deletes the specified per-user, per-app profile.", "DeleteFieldComboBoxItem": "Communicates to the Logon UI or Credential UI that an item should be deleted from a combo box and that the UI should be updated.", "DeleteItem": "Declares a single item that is to be deleted.", "DeleteItems": "Declares a set of items that are to be deleted.", "DeleteList": "Deletes a custom Jump List for a specified application.", "DeleteLogError": "Called by the registered application's handler to delete a previously logged ErrorInformation, warning, or error message in the error tab on the synchronization manager status dialog box.", "DeleteProfileA": "Deletes the user profile and all user - related settings from the specified computer.", "DeleteProfileW": "Deletes the user profile and all user - related settings from the specified computer.", "DeleteShare": "Removes sharing from either the Users or Public folder.", "DeleteTab": "Deletes an item from the taskbar.", "DeriveAppContainerSidFromAppContainerName": "Gets the SID of the specified profile.", "DeriveRestrictedAppContainerSidFromAppContainerSidAndRestrictedName": "DeriveRestrictedAppContainerSidFromAppContainerSidAndRestrictedName is reserved for future use.", "DeskBandRegistrationChanged": "Refreshes the deskband registration cache.", "Destroy": "Destroys the browser.", "DestroyBand": "Destroys a specified band.", "DestroyEnvironmentBlock": "Frees environment variables created by the CreateEnvironmentBlock function.", "DestroyViewWindow": "Destroys the view window.", "Detach": "Retrieves the bitmap contained in an ISharedBitmap object, and returns a copy if the contained bitmap resides in shared memory.", "DisableDebugging": "Disables debug mode for the processes of the specified package.", "DiscardEdit": "Discards edits made to an image.", "Disconnect": "Disconnects an IConnectableCredentialProviderCredential object.", "DisplayName": "Gets the name of the file if IShellImageData was initialized on a file path.", "DisplayParseError": "Deprecated.", "DLLGETVERSIONPROC": "Implemented by many of the Windows Shell DLLs to allow applications to obtain DLL-specific version information.", "DllInstall": "Handles installation and setup for a DLL.", "DoContextMenuPopup": "DoContextMenuPopup is no longer available for use as of Windows ServerÂ 2003.", "DoEnvironmentSubstA": "Parses an input string that contains references to one or more environment variables and replaces them with their fully expanded values.", "DoEnvironmentSubstW": "Parses an input string that contains references to one or more environment variables and replaces them with their fully expanded values.", "DoPreview": "Directs the preview handler to load data from the source specified in an earlier Initialize method call, and to begin rendering to the previewer window.", "DoRename": "Starts a rename operation on the current selection.", "DragAcceptFiles": "Registers whether a window accepts dropped files.", "DragEnter": "Notifies the drag-image manager that the drop target's IDropTarget::DragEnter method has been called.", "DragFinish": "Releases memory that the system allocated for use in transferring file names to the application.", "DragLeave": "Notifies the drag-image manager that the drop target's IDropTarget::DragLeave method has been called.", "DragOver": "Notifies the drag-image manager that the drop target's IDropTarget::DragOver method has been called.", "DragQueryFileA": "Retrieves the names of dropped files that result from a successful drag-and-drop operation.", "DragQueryFileW": "Retrieves the names of dropped files that result from a successful drag-and-drop operation.", "DragQueryPoint": "Retrieves the position of the mouse pointer at the time a file was dropped during a drag-and-drop operation.", "Draw": "Draws a decoded image.", "DriveType": "DriveType may be altered or unavailable.", "Drop": "Notifies the drag-image manager that the drop target's IDropTarget::Drop method has been called.", "DuplicateIcon": "Creates a duplicate of a specified icon.", "DWordPtrAdd": "Adds two values of type DWORD_PTR.", "DWordPtrMult": "Multiplies one value of type DWORD_PTR by another.", "DWordPtrSub": "Subtracts one value of type DWORD_PTR from another.", "Enable": "Enables or disables the sync item.", "EnableDebugging": "Enables debug mode for the processes of the specified package.", "EnableFocusTracking": "Enables a client process to opt-in to the focus tracking mechanism for Windows Store apps that controls the invoking and dismissing semantics of the touch keyboard.", "EnableHandler": "Enables or disables a handler.", "EnableItem": "Enables or disables a sync item managed by a specified handler.", "EnableModeless": "Called by the registered application before and after any dialog boxes are displayed from within the PrepareForSync and Synchronize methods.", "EnableModelessSB": "Tells Windows Explorer to enable or disable its modeless dialog boxes.", "EnableOpenDropDown": "Enables a drop-down list on the Open or Save button in the dialog.", "End": "Indicates that the action associated with this progress implementation has ended.", "EndFieldUpdates": "Finishes and commits the batch updates started by BeginFieldUpdates.", "EndOperation": "Notifies the data object that the asynchronous data extraction has ended.", "EndVisualGroup": "Stops the addition of elements to a visual group in the dialog.", "EnsureItemVisible": "Ensures that the given item is visible.", "EnterFolder": "Notifies that a folder is the destination of a file operation.", "EnumApps": "Creates an enumerator for enumerating all applications published by an application publisher for a given category.", "EnumBands": "Enumerates the bands in a band site.", "EnumCategories": "Gets the enumerator for the list of GUIDs that represent categories.", "EnumConflicts": "Enumerates conflicts scoped to the provided sync handler and sync item.", "EnumerateBackgroundTasks": "Gets the background tasks that are provided by the specified package.", "EnumItems": "Gets an enumerator of the items in the array.", "EnumObjects": "The methods supported by that interface can then be used to enumerate the folder 's contents.", "EnumReady": "Notifies the implementer that the view's item enumeration has completed.", "EnumResources": "Gets a resource enumerator object.", "EnumSearches": "Requests a pointer to an interface that allows a client to enumerate the available search objects.", "EnumSubCommands": "Retrieves an enumerator for a command's subcommands.", "EnumSyncMgrItems": "Obtains the ISyncMgrEnumItems interface for the items that are handled by a registered application.", "EstablishConnection": "Called by the registered application's handler when a network connection is required.", "EvaluateNewWindow": "Accepts data about a new window that is attempting to display and determines whether that window should be allowed to open based on the user's preferences.", "Execute": "Call this method after you have called the other methods of this interface.", "Expand": "Requests that the autocompletion client generate candidate strings associated with a specified item in its namespace.", "ExpandEnvironmentStringsForUserA": "Expands the source string by using the environment block established for the specified user.", "ExpandEnvironmentStringsForUserW": "Expands the source string by using the environment block established for the specified user.", "Extract": "Requests an image from an object, such as an item in a Shell folder.", "ExtractAssociatedIconA": "Gets a handle to an icon stored as a resource in a file or an icon stored in a file's associated executable file.", "ExtractAssociatedIconExA": "ExtractAssociatedIconEx may be altered or unavailable.", "ExtractAssociatedIconExW": "ExtractAssociatedIconEx may be altered or unavailable.", "ExtractAssociatedIconW": "Gets a handle to an icon stored as a resource in a file or an icon stored in a file's associated executable file.", "ExtractIconA": "Gets a handle to an icon from the specified executable file, DLL, or icon file.", "ExtractIconExA": "The ExtractIconEx function creates an array of handles to large or small icons extracted from the specified executable file, DLL, or icon file.", "ExtractIconExW": "The ExtractIconEx function creates an array of handles to large or small icons extracted from the specified executable file, DLL, or icon file.", "ExtractIconW": "Gets a handle to an icon from the specified executable file, DLL, or icon file.", "FileFailure": "Called when there is a failure and user interaction is needed.", "FillFromObject": "Creates a results folder and fills it with items.", "Filter": "Evaluates whether a list of credential providers should be allowed to provide credential tiles.", "FilterView": "Sets the filter on the contents of the current view.", "FindCIE4ConnectionPoint": "Deprecated.", "FindConnectionPoint": "Deprecated.", "FindExecutableA": "Retrieves the name of and handle to the executable file associated with a specific document file.", "FindExecutableW": "Retrieves the name of and handle to the executable file associated with a specific document file.", "FindFolderFromIDList": "The object allows you to query certain folder properties, get the current path of the folder, redirect the folder to another location, and get the path of the folder as an ITEMIDLIST.", "FindFolderFromPath": "Gets an object that represents a known folder based on a file system path.", "FindToolbar": "Finds the specified IDockingWindow object in the toolbar frame and returns an interface pointer to it.", "FindTravelEntry": "Determines whether a specific travel entry is present in the travel log.", "FindWindowSW": "Finds a window in the Shell windows collection and returns the window's handle and IDispatch interface.", "FinishOperations": "Performs caller-implemented actions after the last operation performed by the call to IFileOperation is complete.", "FolderIdFromCsidl": "Gets the KNOWNFOLDERID that is the equivalent of a legacy CSIDL value.", "FolderIdToCsidl": "Gets the legacy CSIDL value that is the equivalent of a given KNOWNFOLDERID.", "ForwardViewMsg": "Calls the SendMessage function with a message received by the view, using the _ hwndView member of the BASEBROWSERDATA structure as the SendMessage hWnd parameter.", "FoundItem": "Called when an object is found in the namespace during a namespace walk.", "FreeConfirmConflictItem": "Frees the resources that have been allocated for a CONFIRM_CONFLICT_ITEM structure.", "FreeIDListArray": "Frees the memory used by a pointer to an item identifier list list array.", "FreeIDListArrayChild": "This releases both the PITEMID_CHILDs within the array and the array itself.", "FreeIDListArrayFull": "This releases both the PIDLIST_ABSOLUTEs within the array and the array itself.", "FreeKnownFolderDefinitionFields": "Frees the allocated fields in the result from IKnownFolder::GetFolderDefinition.", "get_Application": "Gets the application object.", "get_Count": "Gets the number of windows in the Shell windows collection.", "get_CurrentViewMode": "Gets the current view mode of the current folder.", "get_FocusedItem": "Gets the FolderItem object that represents the item that has input focus.", "get_Folder": "Gets the Folder object that represents the view.", "get_FolderFlags": "Gets the settings for the current folder.", "get_GroupBy": "Gets the column used for grouping the folder view.", "get_IconSize": "Gets the icon size setting for the current folder.", "get_Parent": "Not implemented.", "get_Script": "Gets the scripting object for the view.", "get_SortColumns": "Gets the names of the columns used to sort the current folder.", "get_ViewOptions": "Gets a set of flags that indicate the current options of the view.", "GetAcceptLanguagesA": "Retrieves a string used with websites when specifying language preferences.", "GetAcceptLanguagesW": "Retrieves a string used with websites when specifying language preferences.", "GetAccountOptions": "Retrieves a value that indicates whether the \"Other user\" tile for local or Microsoft accounts is shown in the logon or credential UI.", "GetAllUsersProfileDirectoryA": "Retrieves the path to the root of the directory that contains program data shared by all users.", "GetAllUsersProfileDirectoryW": "Retrieves the path to the root of the directory that contains program data shared by all users.", "GetAnyOperationsAborted": "The operations could be stopped either by user action or silently by the system.", "GetAppContainerFolderPath": "Gets the path of the local app data folder for the specified app container.", "GetAppContainerRegistryLocation": "Gets the location of the registry storage associated with an app container.", "GetAppID": "Retrieves a file type handler's explicit Application User Model ID, if one has been declared.", "GetAppInfo": "Gets general information about an application.", "GetApplicationDisplayName": "Retrieves the display name of the application that implemented the handler.", "GetApplicationIconReference": "Retrieves the icon of the application that implemented the handler.", "GetApplicationPublisher": "Retrieves the name of the publisher of the application that implemented the handler.", "GetApplicationSizeBounds": "This methods retrieves the size bounds supported by the application.", "GetApplicationViewOrientation": "Gets the orientation of the application design mode window.", "GetAppName": "Retrieves the name of the application that is using the file.", "GetAppUserModelId": "Retrieves an AppUserModelId from the source application.", "GetAppVisibilityOnMonitor": "Queries the current mode of the specified monitor.", "GetArguments": "Gets the command-line arguments associated with a Shell link object.", "GetArrangeParam": "Gets the arrangement parameter of the view, which is how the view has been sorted.", "GetAsyncMode": "Called by a drop target to determine whether the data object supports asynchronous data extraction.", "GetAt": "Provides a pointer to a specified object 's interface.", "GetAttributes": "Gets resource attributes.", "GetAttributesOf": "Gets the attributes of one or more file or folder objects contained in the object represented by IShellFolder.", "GetAutoArrange": "Gets the current state of the folder's Auto Arrange mode.", "GetAvailableSize": "Retrieves the dimensions available on a specific screen for displaying an accessibility window.", "GetBackgroundColor": "Retrieves the color that is visible on the desktop when no image is displayed or when the desktop background has been disabled.", "GetBandInfo": "Gets state information for a band object.", "GetBandInfoSFB": "Gets information concerning an IShellFolderBand object and places it in a BANDINFOSFB structure.", "GetBandObject": "Gets a specified band object from a band site.", "GetBandSiteInfo": "Gets information about a band in the band site.", "GetBaseBrowserData": "Gets a read - only structure containing the protected elements owned by the base class, for the purpose of determining state.", "GetBitmapValue": "Enables retrieval of bitmap data from a credential with a bitmap field.", "GetBool": "Gets the boolean value of a specified property key.", "GetBorderDW": "Gets the border space allocated for the specified IDockingWindow object.", "GetBrowserByIndex": "Deprecated.", "GetBrowserIndex": "Deprecated.", "GetCachedSlowAppInfo": "Unlike IShellApp::GetSlowAppInfo, this method can return information that has been cached.", "GetCancelEvent": "Retrieves an event that will be sent when an operation is canceled.", "GetCancelInformation": "Returns information that is posted when a user selects Cancel from the progress UI.", "GetCancelledPage": "Called when the user cancels navigation through the wizard extension.", "GetCanonicalName": "Gets the GUID of a Windows Explorer command.", "GetCapabilities": "Gets a set of flags describing the item's defined capabilities.", "GetCategories": "Retrieves a structure listing the categories provided by an application publisher.", "GetCategory": "Retrieves the categoryï¿½virtual, fixed, common, or per-userï¿½of the selected folder.", "GetCategoryForSCID": "Gets a GUID that represents the categorizer to use for the specified Shell column.", "GetCategoryInfo": "Gets information about a category, such as the default display and the text to display in the UI.", "GetCategoryName": "Gets the name of the specified category.", "GetCheckboxValue": "Retrieves the checkbox value.", "GetCheckButtonState": "Gets the current state of a check button in the dialog.", "GetCheckState": "Gets the state of a check box item in a tree-view control.", "GetClient": "Gets the client object.", "GetCLSID": "Gets the class identifier value of specified property key.", "GetCodePage": "Retrieves the numeric value of the ANSI code page.", "GetColor": "Gets the color, as specified.", "GetColumnCount": "Gets the column count for either the visible columns or the complete set of columns.", "GetColumnInfo": "Gets information about each column:_width, visibility, display name, and state.", "GetColumnPropertyList": "Gets an ordered list of columns that corresponds to the column enumerated.", "GetColumns": "Includes either all columns or only those currently visible.", "GetComboBoxValueAt": "Gets the string label for a combo box entry at the given index.", "GetComboBoxValueCount": "Gets a count of the items in the specified combo box and designates which item should have initial selection.", "GetCommand": "Gets a specified Explorer command instance.", "GetCommands": "Gets a specified Explorer command enumerator instance.", "GetCommandString": "Gets information about a shortcut menu command, including the help string and the language-independent, or canonical, name for the command.", "GetComment": "Gets a string that contains commentary regarding the item.", "GetCompositionState": "Gets the composition state.", "GetCondition": "Retrieves the contents of the search box as an ICondition object.", "GetConflictIdInfo": "Gets information that identifies a conflict within a conflict store.", "GetConflictIDList": "Maps a conflict to its IShellItem.", "GetContext": "Gets a context object that can be used by a handler to display properties or execute a context menu action.", "GetControlItemState": "Gets the current state of an item in a container control found in the dialog.", "GetControlState": "Gets the current visibility and enabled states of a given control.", "GetControlStyle": "Gets the display styles set for the namespace object's treeview controls.", "GetControlStyle2": "Gets the extended display styles set for the namespace object's treeview controls.", "GetControlWindow": "Gets the window handle to a browser control.", "GetCount": "Provides a count of the objects in the collection.", "GetCreateFlags": "Gets the additional flags that will be passed to CreateProcess.", "GetCredentialAt": "Gets a specific credential.", "GetCredentialCount": "Gets the number of available credentials under this credential provider.", "GetCurFolder": "Gets the ITEMIDLIST for the folder object.", "GetCurrentFilter": "Gets the current filter as a Unicode string.", "GetCurrentFolderFlags": "Gets the currently applied folder flags.", "GetCurrentInfo": "Gets the current folder settings.", "GetCurrentPage": "Gets the current page of a multipage image.", "GetCurrentProcessExplicitAppUserModelID": "Retrieves the application-defined, explicit Application User Model ID for the current process.", "GetCurrentSelection": "Gets the user's current selection in the dialog.", "GetCurrentView": "Gets the most recent Control Panel view:_Classic view or Category view.", "GetCurrentViewMode": "Gets an address containing a value representing the folder's current view mode.", "GetData": "Searches for and retrieves file or protocol association-related binary data from the registry.", "GetDataFormatFromPath": "Determines a file's format based on its extension.", "GetDataFromIDList": "Gets a read only pointer to the client provided structure in the first ItemID in the IDList.", "GetDataObject": "Gets an IDataObject representation of the current DataPackage object.", "GetDateStamp": "Requests the date the image was last modified.", "GetDefaultBandWidth": "Gets the band width that the bandsite initially uses to set the default width when the band is added.", "GetDefaultCategory": "Enables the folder to override the default grouping.", "GetDefaultColumn": "Gets the default sorting and display columns.", "GetDefaultColumnState": "Gets the default state for a specified column.", "GetDefaultDestinationName": "Gets the default name for a Shell item.", "GetDefaultMenuText": "Called by the Shell view to get the default shortcut menu text.", "GetDefaultSaveFolder": "Retrieves the default target folder that the library uses for save operations.", "GetDefaultSearchGUID": "Returns the globally unique identifier of the default search object for the folder.", "GetDefaultSpacing": "Gets a pointer to a POINT structure containing the default width measurements of an item, including the surrounding white space.", "GetDefaultUserProfileDirectoryA": "Retrieves the path to the root of the default user's profile.", "GetDefaultUserProfileDirectoryW": "Retrieves the path to the root of the default user's profile.", "GetDelay": "Gets the delay value for the current frame of an animation.", "GetDelayedPropertyStore": "Gets an IPropertyStore interface object, as specified.", "GetDescription": "Gets the event description.", "GetDestinationStream": "Gets an empty stream that receives the new version of the file being copied.", "GetDetailsEx": "Gets detailed information, identified by a property set identifier, on an item in a Shell folder.", "GetDetailsOf": "Gets detailed information, identified by a column index, on an item in a Shell folder.", "GetDirectory": "Gets the current working directory.", "GetDisplayName": "Gets the display name of the IShellItem object.", "GetDisplayNameOf": "Retrieves the display name for the specified file object or subfolder.", "GetDpiForShellUIComponent": "Retrieves the dots per inch occupied by a SHELL_UI_COMPONENT based on the current scale factor and PROCESS_DPI_AWARENESS.", "GetDragPoint": "Gets the point at which the current drag-and-drop operation was initiated.", "GetDropDownStatus": "Gets the current display status of the autocomplete drop-down list.", "GetDropPoint": "Gets the point at which the current drag-and-drop operation was terminated.", "GetDynamicInfo": "Called by the system to determine whether a particular handler will be shown before the AutoPlay dialog is displayed.", "GetEditBoxText": "Gets the current text in an edit box control.", "GetEncoderParams": "Gets the current set of encoder parameters.", "GetEntry": "Gets a handle to an image in the cache.", "GetEnum": "This method is not implemented.", "GetEnumFlags": "When used with SHBrowseForFolder, specifies the class or classes of items that should be shown in the dialog box tree view and which class or classes should not.", "GetEnumFlagsForItem": "Allows a client to specify which classes of objects in a Shell item should be enumerated for inclusion in the view.", "GetEvent": "Gets a specified event object.", "GetEventCount": "Gets the event count.", "GetEventEnumerator": "Gets an enumerator for a handler's events.", "GetEventID": "Gets the event ID.", "GetExtension": "Gets the file name extension for the shortcut object.", "GetFieldDescriptorAt": "Gets metadata that describes a specified field.", "GetFieldDescriptorCount": "Retrieves the count of fields in the needed to display this provider's credentials.", "GetFieldOptions": "Called by the credential provider framework.", "GetFieldState": "The Logon UI and Credential UI use this to gain information about a field of a credential to display this information in the user tile.", "GetFileID": "Gets the unique file identifier for the current file.", "GetFileName": "Retrieves the text currently entered in the dialog's File name edit box.", "GetFileNameFromBrowse": "Creates an Open dialog box so that the user can specify the drive, directory, and name of a file to open.", "GetFileOverlayInfo": "Gets the index of the icon overlay or the icon image for the specified file with the specified attributes.", "GetFileTime": "Gets the date and time value of a specified property key.", "GetFileTypeIndex": "Gets the currently selected file type.", "GetFindData": "Gets the file system information stored in the WIN32_FIND_DATA structure.", "GetFirstPage": "Gets a handle to the first page of the wizard extension.", "GetFlags": "Deprecated.", "GetFocusedItem": "Gets the index of the item that currently has focus in the folder's view.", "GetFolder": "Gets an object that represents a known folder identified by its KNOWNFOLDERID.", "GetFolderByName": "Gets an object that represents a known folder identified by its canonical name.", "GetFolderCapabilities": "Gets a folder 's capability to be filtered through the System.", "GetFolderDefinition": "Retrieves a structure that contains the defining elements of a known folder, which includes the folder's category, name, path, description, tooltip, icon, and other properties.", "GetFolderFlags": "Gets folder view options flags.", "GetFolderIds": "Gets an array of all registered known folder IDs.", "GetFolders": "Gets the set of child folders that are contained in the library.", "GetFolderSetData": "Gets a structure containing folder information.", "GetFolderTargetInfo": "Provides the location and attributes of a folder shortcut's target folder.", "GetFolderType": "Gets the library's folder type.", "GetFolderViewOptions": "Retrieves the current set of options for the view.", "GetFont": "Gets the current attributes set on the font.", "GetFormat": "Retrieves the alpha type of the bitmap image.", "GetForWindow": "Gets the DataTransferManager instance for the specified window.", "GetFrameOptions": "Retrieves the available browser frame view options.", "GetGroupBy": "Retrieves the property and sort order used for grouping items in the folder display.", "GetGroupByProperty": "Gets a grouping property.", "GetGroupSubsetCount": "Gets group count for visible rows.", "GetHandlerEnumerator": "Gets an enumerator that provides access to the IDs of sync handlers exposed to and managed by the user.", "GetHandlerID": "Gets the ID of the handler for which the event was logged.", "GetHandlerInfo": "Obtains handler information.", "GetHandlerRegistrationInfo": "Called by the registered application's handler to get current registration information.", "GetHistoryObject": "Deprecated.", "GetHotkey": "Gets the keyboard shortcut for a Shell link object.", "GetIcon": "Gets the default icon for the library.", "GetIconLocation": "Gets the location of the icon for a Shell link object.", "GetIconOf": "Gets an icon for an object inside a specific folder.", "GetIconSize": "Gets the folder icon size.", "GetId": "Gets the ID of the selected folder.", "GetIDArrayResult": "Gets a list of objects found during a namespace walk initiated by INamespaceWalk::Walk.", "GetIDList": "Gets the list of item identifiers for the target of a Shell link object.", "GetImage": "Gets an HBITMAP that represents an IShellItem.", "GetInfoFlags": "Gets the information flags for an item.", "GetInfoTip": "Gets the info tip text for an item.", "GetInt32": "Gets the Int32 value of specified property key.", "GetItem": "Gets result information for a specified item, when successful.", "GetItemAt": "Gets the item at the given index in the IShellItemArray.", "GetItemChoice": "Gets the index of an item that the user wants to keep.", "GetItemChoiceCount": "Gets the number of items that the user wants to keep.", "GetItemCustomState": "Gets the state of the checkbox associated with a given Shell item.", "GetItemData": "Requests column data for a specified file.", "GetItemHeight": "Gets the item height.", "GetItemID": "Gets the unique ID of a sync item.", "GetItemIDList": "Gets the pointer to an item identifier list for the item that is related.", "GetItemInfo": "Gets the properties of a sync item.", "GetItemObject": "Obtains an interface on a specified item that a registered application handles.", "GetItemPosition": "Gets the position of an item in the folder's view.", "GetItemRect": "Gets the RECT structure that describes the size and position of a given item.", "GetItemsArray": "Retrieves a conflict items array.", "GetItemSpacing": "Gets the spacing for small and large view modes only.", "GetItemState": "Gets state information about a Shell item.", "GetIterationInfo": "Gets information about which conflict in a set of conflicts is being resolved.", "GetJunctionCLSID": "Gets the class identifier of the object that implements IShellFolder for the item, if the item is a junction point.", "GetKey": "Searches for and retrieves a file or protocol association-related key from the registry.", "GetLastPage": "Gets a handle to the final page of the wizard extension pages.", "GetLastSyncTime": "Gets the date and time when the item was last synchronized.", "GetLevel": "Gets the log level of the event.", "GetLinkReference": "Gets the reference for the hot link for the event.", "GetLinkText": "Gets the text for the hot link for the event.", "GetList": "Retrieves an object that represents the collection of destinations listed in the Recent or Frequent category in a Jump List.", "GetLocation": "Gets a path to the image that is to be extracted.", "GetMaxLength": "Returns the maximum number of characters allowed for a particular name in the namespace under which it is called.", "GetMenu": "Gets the menu information set by calling IShellMenu::SetMenu.", "GetMenuContextHelpId": "Retrieves the Help context identifier associated with the specified menu.", "GetMenuInfo": "Gets information from the IShellMenu::Initialize method.", "GetMenuPosFromID": "GetMenuPosFromID may be altered or unavailable.", "GetMenuRestrictions": ".", "GetMilliseconds": "Gets elapsed and remaining time for progress dialog.", "GetMode": "Retrieves the enumeration mode of the parsed item.", "GetMonitor": "Retrieves the target monitor for the application being launched.", "GetMonitorDevicePathAt": "Retrieves the unique ID of one of the system's monitors.", "GetMonitorDevicePathCount": "Retrieves the number of monitors that are associated with the system.", "GetMonitorRECT": "Retrieves the display rectangle of the specified monitor.", "GetName": "Gets the UI display name of the sync item.", "GetNameAt": "Gets the name of a property at a specified index in the property store.", "GetNameCount": "Gets the number of property names in the property store.", "GetNamedValue": "Gets the value of a named property from the named property store.", "GetNavigateState": "Deprecated.", "GetNextItem": "Retrieves the next item in the tree according to which method is requested.", "GetNextPage": "Gets the handle of the PROPSHEETPAGE that represents the wizard page immediately following the wizard extension page.", "GetNumberOfApps": "Clients of Add / Remove Programs Control Panel Application can return E_NOTIMPL.", "GetNumberOfCategories": "Clients of the Add / Remove Programs Control Panel Application may return E_NOTIMPL.", "GetObject": "Creates a specific type of object related to the item.", "GetObjectCount": "Gets the number of items in the folder view.", "GetOleObject": "Deprecated.", "GetOperationStatus": "Gets operation status for progress dialog.", "GetOptions": "Gets the library's options.", "GetOverlayIconIndex": "Gets the index of the icon overlay in the system image list.", "GetOverlayIndex": "Gets the overlay index in the system image list.", "GetOverlayInfo": "Provides the location of the icon overlay's bitmap.", "GetPackageExecutionState": "Returns the current execution state of the specified package.", "GetPageCount": "Gets the number of pages in a multipage image.", "GetPalette": "Deprecated.", "GetPaneState": "Gets the visibility state of the given Windows Explorer pane.", "GetParent": "Gets the parent of an IShellItem object.", "GetParentAndItem": "Gets the parent of an item and the parent's child ID.", "GetParentSite": "Deprecated.", "GetPath": "Gets the path and file name of the target of a Shell link object.", "GetPidl": "Deprecated.", "GetPinnedWindow": "Gets the handle to the current pinned window, if one exists.", "GetPixelFormat": "Gets the pixel format of the image.", "GetPolicies": "Gets a set of flags describing the policies set by the item.", "GetPosition": "Retrieves the current display value for the desktop background image.", "GetPossibleActions": "Gets a bitmask of management actions allowed for an application.", "GetPresenterChoice": "Gets what kind of choice was made and whether to apply the choice to all subsequent conflicts in the set.", "GetPresenterNextStep": "Gets what the presenter wants to do as the next step in the sync manager conflict resolution.", "GetPreviousPage": "Gets the handle of the PROPSHEETPAGE that represents the wizard page that is before the wizard extension page.", "GetPriority": "Specifies the priority of an icon overlay.", "GetProcessReference": "Retrieves the process-specific object supplied by SetProcessReference, incrementing the reference count to keep the process alive.", "GetProfilesDirectoryA": "Retrieves the path to the root directory where user profiles are stored.", "GetProfilesDirectoryW": "Retrieves the path to the root directory where user profiles are stored.", "GetProfileType": "Retrieves the type of profile loaded for the current user.", "GetProgID": "Retrieves the ProgID associated with an object.", "GetProperties": "Gets an IPropertySetStorage through which the properties of the image can be accessed.", "GetProperty": "Gets a conflict property, given a property key.", "GetPropertyDescriptionList": "Gets a property description list for the items in the shell item array.", "GetPropertyFromIDList": "Gets a property from the IPropertyStore within the IDList as a variant, using the key.", "GetPropertyHandlerFromFileId": "Gets an instance of IStorageProviderPropertyHandler associated with the provided file identifier.", "GetPropertyHandlerFromPath": "Gets an instance of IStorageProviderPropertyHandler associated with the provided path.", "GetPropertyHandlerFromUri": "Gets an instance of IStorageProviderPropertyHandler associated with the provided URI.", "GetPropertyKey": "Gets the property key.", "GetPropertyStorage": "Gets a read only pointer to the serialized property storage that is used for storing metadata.", "GetPropertyStorageBuffer": "Gets the serialized property storage buffer from the property store instance.", "GetPropertyStorageFromIDList": "Create an instance of the IPropertyStore based on the serialized property storage associated with the first ItemID.", "GetPropertyStorageSize": "Gets the size of serialized property storage data from the property store instance.", "GetPropertyStore": "Gets a property store.", "GetPropertyStoreForKeys": "Gets property store object for specified property keys.", "GetPropertyStoreWithCreateObject": "Uses the specified ICreateObject instead of CoCreateInstance to create an instance of the property handler associated with the Shell item on which this method is called.", "GetProviderID": "Retrieves the ID of the account provider for this user.", "GetPublishedAppInfo": "Gets publishing-related information about an application published by an application publisher.", "GetRawDataFormat": "Retrieves a GUID that identifies the format of the image.", "GetRecorderDriveLetter": "Gets the drive letter of a CD drive that has been marked as write-enabled.", "GetRedirectionCapabilities": "Gets a value that states whether the known folder can have its path set to a new value or what specific restrictions or prohibitions are placed on that redirection.", "GetReferent": "Gets the referent of the shortcut object.", "GetRemovedDestinations": "Retrieves the current list of destinations that have been removed by the user from the existing Jump List that this custom Jump List is meant to replace.", "GetReservedOverlayInfo": "Gets the index of the icon overlay or the icon image for the specified file with the specified attributes from one of the reserved overlays.", "GetResolution": "Gets the resolution, in dots per inch, of the image.", "GetResolutionHandler": "Gets the resolution handler for the conflict.", "GetResourceDescription": "Gets a resource description.", "GetResult": "Gets the choice that the user made in the dialog.", "GetResults": "Returns search results, from an OpenSearch data source, formatted in RSS or Atom format.", "GetRootItems": "Gets an array of the root items.", "GetScaleFactorForDevice": "Gets the preferred scale factor for a display device.", "GetScaleFactorForMonitor": "Gets the scale factor of a specific monitor.", "GetSearchStyle": "Overrides the registry settings that determine how an autosearch is performed.", "GetSearchText": "Retrieves the text that is in the browser's Address bar.", "GetSearchUrl": "Retrieves the URL that is being searched for.", "GetSectorSize": "Retrieves the number of bytes per sector on the disk currently being used.", "GetSelectedControlItem": "Gets a particular item from specified container controls in the dialog.", "GetSelectedCount": "Gets the number of items in the view that are selected.", "GetSelectedItem": "Locates the currently selected item at or after a given index.", "GetSelectedItems": "Gets an array of selected Shell items.", "GetSelectedObjects": "Gets an array of the objects in the view that are selected and the number of those objects.", "GetSelection": "Gets the Shell item array that contains the selected items.", "GetSelectionMarkedItem": "Gets the index of an item in the folder's view which has been marked by using the SVSI_SELECTIONMARK in IFolderView::SelectItem.", "GetSelectionState": "Gets the selection state including check state.", "GetSerialization": "Called in response to an attempt to submit this credential to the underlying authentication engine.", "GetSetCodePage": "Sets a new character code page and retrieves a pointer to the previous code page.", "GetSharedBitmap": "Retrieves the bitmap contained in an ISharedBitmap object.", "GetSharePermissions": "Gets the access permissions currently associated with the User or Public folder for the Everyone access control entry.", "GetShellFolder": "Gets the folder that the menu band is set to browse.", "GetShellItem": "Gets the search folder as a IShellItem.", "GetShowCmd": "Gets the show command for a Shell link object.", "GetSid": "Retrieves the user's security identifier.", "GetSize": "Gets the dimensions of the image file.", "GetSlideshowOptions": "Gets the current desktop wallpaper slideshow settings for shuffle and timing.", "GetSlowAppInfo": "Returns information to the application that originates from a slow source.", "GetSortColumnCount": "Gets the count of sort columns currently applied to the view.", "GetSortColumns": "Gets sort column information.", "GetSourceViewSizePreference": "Retrieves the view size preference of the application after the application has launched.", "GetSourceViewToPosition": "Retrieves the position of the source application window.", "GetSpacing": "Gets a POINT structure containing the width dimensions, including the surrounding white space, of an item.", "GetState": "Gets a filled SMDATA structure.", "GetStatus": "Gets the current status of the slideshow.", "GetString": "Searches for and retrieves a file or protocol association-related string from the registry.", "GetStringValue": "Retrieves string properties from the ICredentialProviderUser object based on the input value.", "GetSubmitButtonValue": "Retrieves the identifier of a field that the submit button should be placed next to in the Logon UI.", "GetSupportedActionTypes": "Determines the supported data type for a CD writing extension.", "GetSwitchToHWND": "Retrieves the handle of the top-level window of the application that is using the file.", "GetSyncItem": "Gets a specified sync item.", "GetSyncItemCount": "Gets a count of the sync items in the container.", "GetSyncItemEnumerator": "Gets an interface that enumerates the handler's sync items.", "GetTargetViewSizePreference": "Retrieves the preferred view size of the application being launched.", "GetText": "Retrieves the contents of the search box as plain text.", "GetThumbnail": "Gets a thumbnail image and alpha type.", "GetThumbnailByID": "Gets a thumbnail from the thumbnail cache, given its ID.", "GetThumbnailHandler": "Gets the requested thumbnail handler for the thumbnail of a given item.", "GetThumbnailStream": "This method is for internal use only and can only be called by the photos application.", "GetTime": "Gets the creation time.", "GetTimes": "Gets file times.", "GetTitle": "Deprecated.", "GetToolTip": "Gets the tooltip string associated with a specified Windows Explorer command item.", "GetToolTipText": "Deprecated.", "GetTransferManifest": "Gets a transfer manifest for a file transfer operation performed by a publishing wizard, such as the Online Print Wizard or the Add Network Place Wizard.", "GetTravelEntry": "Gets a travel entry in the travel log relative to the position of the current entry.", "GetTravelLog": "Deprecated.", "GetType": "Gets the handler type for Sync Center.", "GetTypeLabel": "Gets a label for the item type.", "GetUIMode": "Enables an IExplorerCommand - based Shell verb handler to query the UI mode of the host component from which the application was invoked..", "GetUIName": "Retrieves the display name of an application.", "GetUInt32": "Gets the UInt32 value of a specified property key.", "GetUInt64": "Gets the UInt64 value of a specified property key.", "GetUIObjectOf": "Gets an object that can be used to carry out actions on the specified file objects or folders.", "GetUsage": "Gets a value that indicates how the file in use is being used.", "GetUserProfileDirectoryA": "Retrieves the path to the root directory of the specified user's profile.", "GetUserProfileDirectoryW": "Retrieves the path to the root directory of the specified user's profile.", "GetUserSid": "Retrieves the security identifier of the user that is associated with this credential.", "GetValidCharacters": "Loads a string that contains each of the characters that are valid or invalid in the namespace under which it is called.", "GetValue": "Retrieves a specified property value set for the user.", "GetView": "Requests the current or default Shell view, together with all other valid view identifiers supported by this implementation of IShellView2.", "GetViewFlags": "Called when the view must determine if special customization needs to be made for the common dialog browser.", "GetViewMode": "Gets a folder's logical view mode.", "GetViewModeAndIconSize": "Gets the current view mode and icon size applied to the view.", "GetViewProperty": "Gets a property value for a given property key from the view's cache.", "GetViewRect": "Deprecated.", "GetViewStateStream": "Gets an IStream interface that can be used for storage of view-specific state information.", "GetViewWindow": "Deprecated.", "GetVisibleItem": "Gets the next visible item in relation to a given index in the view.", "GetWallpaper": "Gets the current desktop wallpaper.", "GetWindowContext": "Gets a list of the keyboard shortcuts for the preview host.", "GetWindowContextHelpId": "Retrieves the Help context identifier, if any, associated with the specified window.", "GetWindowDesktopId": "Gets the identifier for the virtual desktop hosting the provided top-level window.", "GetWindowSubclass": "Retrieves the reference data for the specified window subclass callback.", "GetWorkingDirectory": "Gets the name of the working directory for a Shell link object.", "GroupChildWithParent": "ISuspensionDependencyManager::GroupChildWithParent method", "HandleEvent": "Handles AutoPlay device events for which there is no content of the type the application is registered to handle.", "HandleEventWithContent": "Not implemented.", "HandleEventWithHWND": "Handles AutoPlay device events that contain content types that the application is not registered to handle.", "HandleMenuMsg": "Enables client objects of the IContextMenu interface to handle messages associated with owner-drawn menu items.", "HandleMenuMsg2": "Allows client objects of the IContextMenu3 interface to handle messages associated with owner-drawn menu items.", "HandleRename": "Used to change an item's identifier.", "HasFocusIO": "Determines if one of the object's windows has the keyboard focus.", "HashData": "Hashes an array of data.", "HasRecordableDrive": "Scans the system for a CD drive with write-capability, returning TRUE if one is found.", "HasUserCancelled": "Checks whether the user has canceled the operation.", "HideDeskBand": "Hides a specified deskband.", "Hiding": "Called when the input pane is about to leave the display.", "HitTest": "Retrieves the item that a given point is in, if any.", "HrInit": "This method must be called before any other ITaskbarList methods can be called.", "IDListContainerIsConsistent": "Verifies that the container structure of an IDList is valid.", "IEGetDisplayName": "Deprecated.", "IEParseDisplayName": "Deprecated.", "IEParseDisplayNameEx": "Deprecated.", "IID_PPV_ARGS": "Used to retrieve an interface pointer, supplying the IID value of the requested interface automatically based on the type of the interface pointer used.", "ILAppendID": "Appends or prepends an SHITEMID structure to an ITEMIDLIST structure.", "ILClone": "Clones an ITEMIDLIST structure.", "ILCloneChild": "Clones a child ITEMIDLIST structure.", "ILCloneFirst": "Clones the first SHITEMID structure in an ITEMIDLIST structure.", "ILCloneFull": "Clones a full, or absolute, ITEMIDLIST structure.", "ILCombine": "Combines two ITEMIDLIST structures.", "ILCreateFromPath": "Returns the ITEMIDLIST structure associated with a specified file path.", "ILCreateFromPathA": "Returns the ITEMIDLIST structure associated with a specified file path.", "ILCreateFromPathW": "Returns the ITEMIDLIST structure associated with a specified file path.", "ILFindChild": "Determines whether a specified ITEMIDLIST structure is the child of another ITEMIDLIST structure.", "ILFindLastID": "Returns a pointer to the last SHITEMID structure in an ITEMIDLIST structure.", "ILFree": "Frees an ITEMIDLIST structure allocated by the Shell.", "ILGetNext": "Retrieves the next SHITEMID structure in an ITEMIDLIST structure.", "ILGetSize": "Returns the size, in bytes, of an ITEMIDLIST structure.", "ILIsAligned": "Verifies whether a constant ITEMIDLIST is aligned on a pointer boundary, which is a DWORD on 32-bit architectures and a QWORD on 64-bit architectures.", "ILIsChild": "Verifies whether a pointer to an item identifier list is a child PIDL, which is a PIDL with exactly one SHITEMID.", "ILIsEmpty": "Verifies whether an ITEMIDLIST structure is empty.", "ILIsEqual": "Tests whether two ITEMIDLIST structures are equal in a binary comparison.", "ILIsParent": "Tests whether an ITEMIDLIST structure is the parent of another ITEMIDLIST structure.", "ILLoadFromStream": "Deprecated.", "ILLoadFromStreamEx": "This function may be altered or unavailable.", "ILNext": "Retrieves the next SHITEMID structure in an ITEMIDLIST structure.", "ILRemoveLastID": "Removes the last SHITEMID structure from an ITEMIDLIST structure.", "ILSaveToStream": "Saves an ITEMIDLIST structure to a stream.", "ILSkip": "Skips a given number of bytes in a constant, unaligned, relative ITEMIDLIST structure.", "IncludeItem": "Sets a given Shell item status to inclusion in the view.", "IncludeItems": "Allows the view to filter the items shown in the menu.", "IncludeObject": "Allows the common dialog box to filter objects that the view displays.", "InetIsOffline": "Determines whether the system is connected to the Internet.", "Init": "Initializes the IQueryAssociations interface and sets the root key to the appropriate ProgID.", "Initialize": "Called by the synchronization manager in a registered application handler to determine whether the handler processes the synchronization event.", "InitializeBitmap": "Initializes a new ISharedBitmap object with a given bitmap.", "InitializeDownloadManager": "Deprecated.", "InitializeEx": "If the folder is a shortcut, this method also specifies the location of the target folder.", "InitializeFromBitmap": "Initializes the drag-image manager for a windowless control.", "InitializeFromWindow": "Initializes the drag-image manager for a control with a window.", "InitializeProgressDialog": "Initializes the window title and cancel button text of the progress dialog box displayed during the namespace walk.", "InitializeSFB": "Initializes an IShellFolderBand object.", "InitializeTransitionSite": "Deprecated.", "InitializeTravelLog": "Deprecated.", "InitNetworkAddressControl": "Initializes the network address control window class.", "InitWizard": "Initializes the sync schedule wizard.", "InOperation": "Called by the drop source to determine whether the target is extracting data asynchronously.", "InsertItem": "Adds an ITEMIDLIST structure to a list of such structures.", "InsertMenuEntries": "Deprecated.", "InsertMenusSB": "Allows the container to insert its menu groups into the composite menu that is displayed when an extended namespace is being viewed or used.", "InsertRoot": "Inserts a Shell item on a root item in a tree.", "Install": "This method is invoked when the user selects Add or Add Later in Add / Remove Programs in Control Panel.", "Install2": "Installs an application published by an application publisher, while preventing multiple windows from being active on the same thread.", "Int8Add": "Adds two values of type INT8.", "Int8Mult": "Multiplies two values of type INT8.", "Int8Sub": "Subtracts one value of type INT8 from another.", "Int8ToUChar": "Converts a value of type INT8 to a value of type UCHAR.", "Int8ToUInt": "Converts a value of type INT8 to a value of type UINT.", "Int8ToUInt8": "Converts a value of type INT8 to a value of type UINT8.", "Int8ToUIntPtr": "Converts a value of type INT8 to a value of type UINT_PTR.", "Int8ToULong": "Converts a value of type INT8 to a value of type ULONG.", "Int8ToULongLong": "Converts a value of type INT8 to a value of type ULONGLONG.", "Int8ToULongPtr": "Converts a value of type INT8 to a value of type ULONG_PTR.", "Int8ToUShort": "Converts a value of type INT8 to a value of type USHORT.", "IntAdd": "Adds two values of type INT.", "IntlStrEqNA": "Performs a case-sensitive comparison of a specified number of characters from the beginning of two localized strings.", "IntlStrEqNIA": "Performs a case-insensitive comparison of a specified number of characters from the beginning of two localized strings.", "IntlStrEqNIW": "Performs a case-insensitive comparison of a specified number of characters from the beginning of two localized strings.", "IntlStrEqNW": "Performs a case-sensitive comparison of a specified number of characters from the beginning of two localized strings.", "IntlStrEqWorkerA": "Compares a specified number of characters from the beginning of two localized strings.", "IntlStrEqWorkerW": "Compares a specified number of characters from the beginning of two localized strings.", "IntMult": "Multiplies two values of type INT.", "IntPtrAdd": "Adds two values of type INT_PTR.", "IntPtrMult": "Multiplies two values of type INT_PTR.", "IntPtrSub": "Subtracts one value of type INT_PTR from another.", "IntPtrToChar": "Converts a value of type INT_PTR to a value of type CHAR.", "IntPtrToInt": "Converts a value of type INT_PTR to a value of type INT.", "IntPtrToInt8": "Converts a value of type INT_PTR to a value of type INT8.", "IntPtrToLong": "Converts a value of type INT_PTR to a value of type LONG.", "IntPtrToLongPtr": "Converts a value of type INT_PTR to a value of type LONG_PTR.", "IntPtrToShort": "Converts a value of type INT_PTR to a value of type SHORT.", "IntPtrToUChar": "Converts a value of type INT_PTR to a value of type UCHAR.", "IntPtrToUInt": "Converts a value of type INT_PTR to a value of type UINT.", "IntPtrToUInt8": "Converts a value of type INT_PTR to a value of type UINT8.", "IntPtrToUIntPtr": "Converts a value of type INT_PTR to a value of type UINT_PTR.", "IntPtrToULong": "Converts a value of type INT_PTR to a value of type ULONG.", "IntPtrToULongLong": "Converts a value of type INT_PTR to a value of type ULONGLONG.", "IntPtrToULongPtr": "Converts a value of type INT_PTR to a value of type ULONG_PTR.", "IntPtrToUShort": "Converts a value of type INT_PTR to a value of type USHORT.", "IntSub": "Subtracts one value of type INT from another.", "IntToChar": "Converts a value of type INT to a value of type CHAR.", "IntToInt8": "Converts a value of type INT to a value of type INT8.", "IntToShort": "Converts a value of type INT to a value of type SHORT.", "IntToUChar": "Converts a value of type INT to a value of type UCHAR.", "IntToUInt": "Converts a value of type INT to a value of type UINT.", "IntToUInt8": "Converts a value of type INT to a value of type UINT8.", "IntToULong": "Converts a value of type INT to a value of type ULONG.", "IntToULongLong": "Converts a value of type INT to a value of type UINT_PTR.", "IntToUShort": "Converts a value of type INT to a value of type USHORT.", "InvalidateItem": "Redraws an item in a menu band.", "Invoke": "Deprecated.", "InvokeCommand": "Carries out the command associated with a shortcut menu item.", "InvokeVerbOnSelection": "Invokes the given verb on the current selection.", "IsActive": "Gets a value that indicates whether the handler can be synchronized.", "IsAnimated": "Determines whether the image is animated.", "IsApplicationViewStateSupported": "Determines whether a particular application view state is supported for specific spoofed display size and scale factor settings.", "IsBkDropTarget": "IsBkDropTarget may be altered or unavailable.", "IsCharSpaceA": "Determines whether a character represents a space.", "IsCharSpaceW": "Determines whether a character represents a space.", "IsConnected": "Generates a value that indicates whether the itemï¿½typically some type of external deviceï¿½is connected.", "IsControlWindowShown": "Deprecated.", "IsDecoded": "Determines whether the image has been decoded by calling IShellImageData::Decode.", "IsDelegateFolder": "Gets a Boolean value specifying whether the factory is a delegate folder.", "IsDeskBandShown": "Indicates whether a deskband is shown.", "IsDropOnSource": "Checks whether the destination of the current drag-and-drop or cut-and-paste operation is the same as the source.", "IsEditable": "Determines whether the image can be edited.", "IsEnabled": "Generates a value that indicates whether the item is enabled.", "IsEntryInStore": "Checks to see if the image is in the store.", "IsEqualPropertyKey": "Compares the members of two PROPERTYKEY structures and returns whether they are equal.", "IsInstalled": "Gets a value indicating whether a specified application is currently installed.", "IsInternetESCEnabled": "Determines whether Windows Internet Explorer is in the Enhanced Security Configuration.", "IsLauncherVisible": "Gets a value that indicates whether the Start screen is displayed.", "IsMember": "Determines whether the local computer is a member of a HomeGroup.", "IsMemberOf": "Specifies whether an icon overlay should be added to a Shell object's icon.", "IsMenuMessage": "A message pump calls this method to see if any messages should be redirected to the Component Object Model object.", "IsMoveInSameFolder": "Checks to see if this view sourced the current drag-and-drop or cut-and-paste operation.", "IsMultipage": "Determines whether the image is a multipage Tagged Image File Format image.", "IsNetDrive": "Tests whether a drive is a network drive.", "IsOS": "Checks for specified operating systems and operating system features.", "IsPrintable": "Determines whether the image can be printed.", "IsRecommended": "Indicates whether the application is registered as a recommended handler for the queried file type.", "IsRunning": "Requests information on the state of a task, such as thumbnail extraction.", "IsTransparent": "Determines whether the image is transparent.", "IStream_Copy": "Copies a stream to another stream.", "IStream_Read": "Reads bytes from a specified stream and returns a value that indicates whether all bytes were successfully read.", "IStream_ReadPidl": "Reads a pointer to an item identifier list from an IStream object into a PIDLIST_RELATIVE object.", "IStream_ReadStr": "Reads from a stream and writes into a string.", "IStream_Reset": "Moves the seek position in a specified stream to the beginning of the stream.", "IStream_Size": "Retrieves the size, in bytes, of a specified stream.", "IStream_Write": "Writes data of unknown format from a buffer to a specified stream.", "IStream_WritePidl": "Writes a pointer to an item identifier list from a PCUIDLIST_RELATIVE object into an IStream object.", "IStream_WriteStr": "Reads from a string and writes into a stream.", "IsUserAnAdmin": "IsUserAnAdmin may be altered or unavailable.", "IsVector": "Determines whether the image is a vector image.", "IsWindowOnCurrentVirtualDesktop": "Indicates whether the provided window is on the currently active virtual desktop.", "Item": "Gets the identifier of a specific item in the folder view, by index.", "ItemCount": "Gets the number of items in the folder.", "ItemPostPaint": "Called after an item in the namespace tree control is drawn.", "ItemPrePaint": "Called before an item in the namespace tree control is drawn.", "Items": "Gets the address of an enumeration object based on the collection of items in the folder view.", "IUnknown_AtomicRelease": "Releases a Component Object Model pointer and sets it to NULL.", "IUnknown_GetSite": "Calls the specified object's IObjectWithSite::GetSite method.", "IUnknown_GetWindow": "Attempts to retrieve a window handle from a Component Object Model object by querying for various interfaces that have a GetWindow method.", "IUnknown_QueryService": "Retrieves an interface for a service from a specified object.", "IUnknown_Set": "Changes the value of a Component Object Model interface pointer and releases the previous interface.", "IUnknown_SetSite": "Sets the specified object's site by calling its IObjectWithSite::SetSite method.", "KeepItems": "Keeps the Shell items that are passed in.", "KeepOther": "Replaces the versions in conflict with a different Shell item that is usually a merged version of the originals.", "KeepRecent": "Keeps the more recent copy.", "Kill": "Requests that a task be stopped.", "LaunchAdvancedAssociationUI": "Launches an advanced association dialog box through which the user can customize the associations for the application specified in pszAppRegName.", "LauncherVisibilityChange": "Notifies a client that visibility of the Start screen has changed.", "LeaveFolder": "Sends notification that a folder is no longer the destination of a file operation.", "LinkItem": "Not implemented.", "LoadLibraryFromItem": "Loads the library from a specified library definition file.", "LoadLibraryFromKnownFolder": "Loads the library that is referenced by a KNOWNFOLDERID.", "LoadNonloadedOverlayIdentifiers": "Loads any registered overlay identifiers, or handlers, that are not currently loaded.", "LoadUserProfileA": "The profile can be a local user profile or a roaming user profile.", "LoadUserProfileW": "The profile can be a local user profile or a roaming user profile.", "Location": "Gets the current location of the input pane.", "LogError": "Called by a registered application to log information, warning, or an error message into the error tab on the synchronization manager status dialog box.", "LongAdd": "Adds two values of type LONG.", "LongLongAdd": "Adds two values of type LONGLONG.", "LongLongMult": "Multiplies two values of type LONGLONG.", "LongLongSub": "Subtracts one value of type LONGLONG from another.", "LongLongToChar": "Converts a value of type LONGLONG to a value of type CHAR.", "LongLongToInt": "Converts a value of type LONGLONG to a value of type INT.", "LongLongToInt8": "Converts a value of type LONGLONG to a value of type INT8.", "LongLongToIntPtr": "Converts a value of type LONGLONG to a value of type INT_PTR.", "LongLongToLong": "Converts a value of type LONGLONG to a value of type LONG.", "LongLongToLongPtr": "Converts a value of type LONGLONG to a value of type LONG_PTR.", "LongLongToShort": "Converts a value of type LONGLONG to a value of type SHORT.", "LongLongToUChar": "Converts a value of type LONGLONG to a value of type UCHAR.", "LongLongToUInt": "Converts a value of type LONGLONG to a value of type UINT.", "LongLongToUInt8": "Converts a value of type LONGLONG to a value of type UINT8.", "LongLongToULong": "Converts a value of type LONGLONG to a value of type ULONG.", "LongLongToULongLong": "Converts a value of type LONGLONG to a value of type ULONGLONG.", "LongLongToUShort": "Converts a value of type LONGLONG to a value of type USHORT.", "LongMult": "Multiplies two values of type LONG.", "LongPtrAdd": "Adds two values of type LONG_PTR.", "LongPtrMult": "Multiplies two values of type LONG_PTR.", "LongPtrSub": "Subtracts one value of type LONG_PTR from another.", "LongPtrToChar": "Converts a value of type LONG_PTR to a value of type CHAR.", "LongPtrToInt": "Converts a value of type LONG_PTR to a value of type INT.", "LongPtrToInt8": "Converts a value of type LONG_PTR to a value of type INT8.", "LongPtrToIntPtr": "Converts a value of type LONG_PTR to a value of type INT_PTR.", "LongPtrToLong": "Converts a value of type LONG_PTR to a value of type LONG.", "LongPtrToShort": "Converts a value of type LONG_PTR to a value of type SHORT.", "LongPtrToUChar": "Converts a value of type LONG_PTR to a value of type UCHAR.", "LongPtrToUInt": "Converts a value of type LONG_PTR to a value of type UINT.", "LongPtrToUInt8": "Converts a value of type LONG_PTR to a value of type UINT8.", "LongPtrToUIntPtr": "Converts a value of type LONG_PTR to a value of type UINT_PTR.", "LongPtrToULong": "Converts a value of type LONG_PTR to a value of type ULONG.", "LongPtrToULongLong": "Converts a value of type LONG_PTR to a value of type ULONGLONG.", "LongPtrToULongPtr": "Converts a value of type LONG_PTR to a value of type ULONG_PTR.", "LongPtrToUShort": "Converts a value of type LONG_PTR to a value of type USHORT.", "LongSub": "Subtracts one value of type LONG from another.", "LongToChar": "Converts a value of type LONG to a value of type CHAR.", "LongToInt": "Converts a value of type LONG to a value of type INT.", "LongToInt8": "Converts a value of type LONG to a value of type INT8.", "LongToIntPtr": "Converts a value of type LONG to a value of type INT_PTR.", "LongToShort": "Converts a value of type LONG to a value of type SHORT.", "LongToUChar": "Converts a value of type LONG to a value of type UCHAR.", "LongToUInt": "Converts a value of type LONG to a value of type UINT.", "LongToUInt8": "Converts a value of type LONG to a value of type UINT8.", "LongToUIntPtr": "Converts a value of type LONG to a value of type UINT_PTR.", "LongToULong": "Converts a value of type LONG to a value of type ULONG.", "LongToULongLong": "Converts a value of type LONG to a value of type ULONGLONG.", "LongToULongPtr": "Converts a value of type LONG to a value of type ULONG_PTR.", "LongToUShort": "Converts a value of type LONG to a value of type USHORT.", "LPFNDFMCALLBACK": "LPFNDFMCALLBACK may be altered or unavailable.", "LPFNVIEWCALLBACK": "This function essentially duplicates the functionality of IShellFolderViewCB.", "MakeDefault": "Sets an application as the default application for this file type.", "MAKEDLLVERULL": "Used to pack DLL version information into a ULONGLONG value.", "MakeProminent": "Places a control in the dialog so that it stands out compared to other added controls.", "MapColumnToSCID": "Converts a column to the appropriate property set ID.", "MarkForDelete": "Marks for delete.", "MarkFullscreenWindow": "Marks a window as full-screen.", "Merge": "IFileSyncMergeHandler::Merge method", "MessageSFVCB": "Allows communication between the system folder view object and a system folder view callback object.", "MIMEAssociationDialogA": "Runs the unregistered MIME content type dialog box.", "MIMEAssociationDialogW": "Runs the unregistered MIME content type dialog box.", "MoveIcons": "This method is not implemented.", "MoveItem": "Moves the item within the volume/namespace, returning the IShellItem in its new location.", "MoveItems": "Declares a set of items that are to be moved to a specified destination.", "MoveWindowToDesktop": "Moves a window to the specified virtual desktop.", "NavigateToPidl": "Deprecated.", "NetAddr_DisplayErrorTip": "Displays an error message in the balloon tip associated with the network address control.", "NetAddr_GetAddress": "Indicates whether a network address conforms to a specified type and format.", "NetAddr_GetAllowType": "Retrieves the network address types that a specified network address control accepts.", "NetAddr_SetAllowType": "Sets the network address types that a specified network address control accepts.", "NewItem": "Declares a new item that is to be created in a specified location.", "Next": "Enumerates the next celt elements in the enumerator's list, returning them in rgelt along with the actual number of enumerated elements in pceltFetched.", "NextFrame": "Switches to the next frame of an animated image.", "NextPage": "Switches to the next page of a multipage image.", "Notify": "Called by a Shell view to notify the common dialog box hosting it that an event has occurred.", "NotifyRedirect": "Updates the browser to the specified pointer to an item identifier list, navigating if necessary.", "Offline": "Checks for and updates the browser 's offline status, synchronizing the state between the base class and any derived classes.", "OnActivated": "Occurs when a Shell window's activation state changes.", "OnAfterContextMenu": "Called after a context menu is displayed.", "OnAfterExpand": "Called after an IShellItem is expanded.", "OnBalloonUserClick": "Called when the user clicks the balloon.", "OnBeforeContextMenu": "Called before a context menu is displayed; allows client to add additional menu entries.", "OnBeforeExpand": "Called before an IShellItem is expanded.", "OnBeforeItemDelete": "Called before an IShellItem and all of its children are deleted.", "OnBeforeStateImageChange": "Called before the state icon of the given IShellItem is changed.", "OnBeginLabelEdit": "Called before the IShellItem goes into edit mode.", "OnButtonClicked": "Called when the user clicks a command button.", "OnChange": "Informs a namespace extension that an event has taken place that affects its items.", "OnCheckButtonToggled": "Called when the user changes the state of a check button.", "OnColumnClicked": "Called after a specified column is clicked in the IShellView interface.", "OnCommand": "The derived class handles the message.", "OnContextMenu": "Called when the user right - clicks the icon in the notification area.", "OnControlActivating": "Called when an Open button drop-down list customized through EnableOpenDropDown or a Tools menu is about to display its contents.", "OnCreate": "The derived class handles the message.", "OnCreated": "Occurs when a new Shell window is created for a frame.", "OnCreating": "Allows you to modify the parameters of the process being created.", "OnCreatingWindow": "Called when the window is created.", "OnDefaultCommand": "Called when a user double-clicks in the view or presses the ENTER key.", "OnDestroy": "The derived class handles the message.", "OnDoDefaultAccessibilityAction": "Invokes the default accessibility action on a Shell item.", "OnDragEnter": "Called on drag enter to set drag effect, as specified.", "OnDragLeave": "Called on drag leave for a specified item.", "OnDragOver": "Called on drag over to set drag effect, as specified.", "OnDragPosition": "Called when the item is being dragged within the same level in the tree.", "OnDrop": "Called on drop to set drop effect, as specified.", "OnDropPosition": "Called when the item is being dropped within the same level in the tree.", "OnEndLabelEdit": "Called after the IShellItem leaves edit mode.", "OnFileOk": "Called just before the dialog is about to return with a result.", "OnFocusChangeIS": "Informs the browser that the focus has changed.", "OnFolderChange": "Called when the user navigates to a new folder.", "OnFolderChanging": "Called before IFileDialogEvents::OnFolderChange.", "OnFrameWindowActivateBS": "The derived class determines what to do in response to the action.", "OnGetAccessibilityRole": "Gets the accessibility role for a Shell item.", "OnGetDefaultAccessibilityAction": "Gets the default accessibility action for a Shell item.", "OnGetToolTip": "Enables you to provide a tooltip.", "OnHttpEquiv": "Called when the document object responds to an HTTP - EQUIV metatag by issuing either the OLECMDID_HTTPEQUIV or OLECMDID_HTTPEQUIV_DONE command through IOleCommandTarget::Exec.", "OnInvoke": "Not implemented.", "OnItemAdded": "Called after an IShellItem has been added.", "OnItemClick": "Called when the user clicks a button on the mouse.", "OnItemDeleted": "Called after an IShellItem has been deleted.", "OnItemSelected": "Called when an item is selected in a combo box, when a user clicks an option button, or an item is chosen from the Tools menu.", "OnItemStateChanged": "Not implemented.", "OnItemStateChanging": "Called before the state of an item changes.", "OnKeyboardInput": "Called when the user presses a key on the keyboard.", "OnLeftClick": "Called when the user clicks the icon in the notification area.", "OnNavigate": "Occurs when a Shell window is navigated to a new location.", "OnNavigationComplete": "Notifies clients that the Explorer browser has successfully navigated to a Shell folder.", "OnNavigationFailed": "Notifies clients that the Explorer browser has failed to navigate to a Shell folder.", "OnNavigationPending": "Notifies clients of a pending Explorer browser navigation to a Shell folder.", "OnNotify": "The derived class handles the message.", "OnOverwrite": "Called from the save dialog when the user chooses to overwrite a file.", "OnPictureChange": "Called to send notifications when the picture that represents a user account is changed.", "OnPosRectChangeDB": "Notifies the object that the rectangle has changed.", "OnPreViewCreated": "Called after a specified preview is created in the IShellView interface.", "OnPropertyItemCommit": "Not implemented.", "OnSelect": "Handles selection notifications.", "OnSelectionChange": "Called when the user changes the selection in the dialog's view.", "OnSelectionChanged": "Called when the selection changes.", "OnSetFocus": "The derived class handles the message.", "OnSetTitle": "Sets or retrieves the title of the site object.", "OnShareViolation": "Enables an application to respond to sharing violations that arise from Open or Save operations.", "OnSize": "The derived class handles the message.", "OnStateChange": "Called after a state, identified by the uChange parameter, has changed in the IShellView interface.", "OnStateChanged": "Called when package state changes during Windows Store app debugging.", "OnTranslateAccelerator": "Not implemented.", "OnTypeChange": "Called when the dialog is opened to notify the application of the initial chosen filetype.", "OnViewCreated": "Notifies clients that the view of the Explorer browser has been created and can be modified.", "OnViewWindowActive": "Called by the Shell view when the view window or one of its child windows gets the focus or becomes active.", "Open": "Opens the specified Control Panel item, optionally to a specific page.", "OpenItem": "Opens the item for copying.", "OpenRegStream": "OpenRegStream may be altered or unavailable.", "OpenResource": "Opens a specified resource.", "OverlappedResult": "Retrieves the results of an overlapped operation.", "OverlayIndexFromImageIndex": "Finds the index of an overlay image for the specified icon image.", "PageInThumbnail": ".", "PAPPSTATE_CHANGE_ROUTINE": "Specifies an app-defined callback function that notifies the app when the app is entering or leaving a suspended state.", "ParseDisplayName": "Translates the display name of a file object or a folder into an item identifier list.", "ParseURLA": "Performs rudimentary parsing of a URL.", "ParseURLW": "Performs rudimentary parsing of a URL.", "PathAddBackslashA": "Adds a backslash to the end of a string to create the correct syntax for a path.", "PathAddBackslashW": "Adds a backslash to the end of a string to create the correct syntax for a path.", "PathAddExtensionA": "Adds a file name extension to a path string.", "PathAddExtensionW": "Adds a file name extension to a path string.", "PathAllocCanonicalize": "This function differs from PathCchCanonicalize and PathCchCanonicalizeEx in that it returns the result on the heap.", "PathAllocCombine": "Concatenates two path fragments into a single path.", "PathAppendA": "Appends one path to the end of another.", "PathAppendW": "Appends one path to the end of another.", "PathBuildRootA": "Creates a root path from a given drive number.", "PathBuildRootW": "Creates a root path from a given drive number.", "PathCanonicalizeA": "and \".. \" to produce a direct, well - formed path.", "PathCanonicalizeW": "and \".. \" to produce a direct, well - formed path.", "PathCchAddBackslash": "Adds a backslash to the end of a string to create the correct syntax for a path.", "PathCchAddBackslashEx": "Adds a backslash to the end of a string to create the correct syntax for a path.", "PathCchAddExtension": "This function differs from PathAddExtension in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchAppend": "This function differs from PathCchAppendEx in that you are restricted to a final path of length MAX_PATH.This function differs from PathAppend in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchAppendEx": "This function differs from PathAppend in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchCanonicalize": "This function differs from PathCanonicalize in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchCanonicalizeEx": "This function differs from PathCchCanonicalize in that it allows for a longer final path to be constructed.", "PathCchCombine": "Combines two path fragments into a single path.", "PathCchCombineEx": "Combines two path fragments into a single path.", "PathCchFindExtension": "Searches a path to find its file name extension, such as \".exe \" or \".ini \".", "PathCchIsRoot": "Determines whether a path string refers to the root of a volume.", "PathCchRemoveBackslash": "This function differs from PathRemoveBackslash in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchRemoveBackslashEx": "This function differs from PathRemoveBackslash in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchRemoveExtension": "This function differs from PathRemoveExtension in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchRemoveFileSpec": "Removes the last element in a path string, whether that element is a file name or a directory name.", "PathCchRenameExtension": "Replaces a file name's extension at the end of a path string with a new extension.", "PathCchSkipRoot": "This function differs from PathSkipRoot in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCchStripPrefix": "Removes the \"\\?&quot; prefix, if present, from a file path.", "PathCchStripToRoot": "This function differs from PathStripToRoot in that it accepts paths with \" \\ \", \" \\?&quot ; and \" \\?\\UNC&quot ; prefixes.", "PathCleanupSpec": "PathCleanupSpec may be altered or unavailable.", "PathCombineA": "Concatenates two strings that represent properly formed paths into one path; also concatenates any relative path elements.", "PathCombineW": "Concatenates two strings that represent properly formed paths into one path; also concatenates any relative path elements.", "PathCommonPrefixA": "A prefix is one of these types:_\"C:\\ \", \". \"", "PathCommonPrefixW": "A prefix is one of these types:_\"C:\\ \", \". \"", "PathCompactPathA": "Truncates a file path to fit within a given pixel width by replacing path components with ellipses.", "PathCompactPathExA": "Truncates a path to fit within a certain number of characters by replacing path components with ellipses.", "PathCompactPathExW": "Truncates a path to fit within a certain number of characters by replacing path components with ellipses.", "PathCompactPathW": "Truncates a file path to fit within a given pixel width by replacing path components with ellipses.", "PathCreateFromUrlA": "Converts a file URL to a Microsoft MS-DOS path.", "PathCreateFromUrlAlloc": "Creates a path from a file URL.", "PathCreateFromUrlW": "Converts a file URL to a Microsoft MS-DOS path.", "PathFileExistsA": "Determines whether a path to a file system object such as a file or folder is valid.", "PathFileExistsW": "Determines whether a path to a file system object such as a file or folder is valid.", "PathFindExtensionA": "Searches a path for an extension.", "PathFindExtensionW": "Searches a path for an extension.", "PathFindFileNameA": "Searches a path for a file name.", "PathFindFileNameW": "Searches a path for a file name.", "PathFindNextComponentA": "Parses a path and returns the portion of that path that follows the first backslash.", "PathFindNextComponentW": "Parses a path and returns the portion of that path that follows the first backslash.", "PathFindOnPathA": "Searches for a file.", "PathFindOnPathW": "Searches for a file.", "PathFindSuffixArrayA": "Determines whether a given file name has one of a list of suffixes.", "PathFindSuffixArrayW": "Determines whether a given file name has one of a list of suffixes.", "PathGetArgsA": "Finds the command line arguments within a given path.", "PathGetArgsW": "Finds the command line arguments within a given path.", "PathGetCharTypeA": "Determines the type of character in relation to a path.", "PathGetCharTypeW": "Determines the type of character in relation to a path.", "PathGetDriveNumberA": "Searches a path for a drive letter within the range of 'A' to 'Z' and returns the corresponding drive number.", "PathGetDriveNumberW": "Searches a path for a drive letter within the range of 'A' to 'Z' and returns the corresponding drive number.", "PathGetShortPath": "PathGetShortPath may be altered or unavailable.", "PathIsContentTypeA": "Determines if a file 's registered content type matches the specified content type.", "PathIsContentTypeW": "Determines if a file 's registered content type matches the specified content type.", "PathIsDirectoryA": "Verifies that a path is a valid directory.", "PathIsDirectoryEmptyA": "Determines whether a specified path is an empty directory.", "PathIsDirectoryEmptyW": "Determines whether a specified path is an empty directory.", "PathIsDirectoryW": "Verifies that a path is a valid directory.", "PathIsExe": "PathIsExe may be altered or unavailable.", "PathIsFileSpecA": "Searches a path for any path - delimiting characters.", "PathIsFileSpecW": "Searches a path for any path - delimiting characters.", "PathIsHTMLFileA": "Determines if a file is an HTML file.", "PathIsHTMLFileW": "Determines if a file is an HTML file.", "PathIsLFNFileSpecA": "Determines whether a file name is in long format.", "PathIsLFNFileSpecW": "Determines whether a file name is in long format.", "PathIsNetworkPathA": "Determines whether a path string represents a network resource.", "PathIsNetworkPathW": "Determines whether a path string represents a network resource.", "PathIsPrefixA": "Examines a path to determine if it starts with a prefix value passed by pszPrefix.", "PathIsPrefixW": "Examines a path to determine if it starts with a prefix value passed by pszPrefix.", "PathIsRelativeA": "Searches a path and determines if it is relative.", "PathIsRelativeW": "Searches a path and determines if it is relative.", "PathIsRootA": "Determines whether a path string refers to the root of a volume.", "PathIsRootW": "Determines whether a path string refers to the root of a volume.", "PathIsSameRootA": "Compares two paths to determine if they have a common root component.", "PathIsSameRootW": "Compares two paths to determine if they have a common root component.", "PathIsSlowA": "PathIsSlow may be altered or unavailable.", "PathIsSlowW": "PathIsSlow may be altered or unavailable.", "PathIsSystemFolderA": "Determines if an existing folder contains the attributes that make it a system folder.", "PathIsSystemFolderW": "Determines if an existing folder contains the attributes that make it a system folder.", "PathIsUNCA": "Determines if a path string is a valid Universal Naming Convention path, as opposed to a path based on a drive letter.", "PathIsUNCEx": "Determines if a path string is a valid Universal Naming Convention path, as opposed to a path based on a drive letter.", "PathIsUNCServerA": "Determines if a string is a valid Universal Naming Convention for a server path only.", "PathIsUNCServerShareA": "Determines if a string is a valid Universal Naming Convention share path, \\server\\share.", "PathIsUNCServerShareW": "Determines if a string is a valid Universal Naming Convention share path, \\server\\share.", "PathIsUNCServerW": "Determines if a string is a valid Universal Naming Convention for a server path only.", "PathIsUNCW": "Determines if a path string is a valid Universal Naming Convention path, as opposed to a path based on a drive letter.", "PathIsURLA": "Tests a given string to determine if it conforms to a valid URL format.", "PathIsURLW": "Tests a given string to determine if it conforms to a valid URL format.", "PathMakePrettyA": "Converts an all-uppercase path to all lowercase characters to give the path a consistent appearance.", "PathMakePrettyW": "Converts an all-uppercase path to all lowercase characters to give the path a consistent appearance.", "PathMakeSystemFolderA": "Gives an existing folder the proper attributes to become a system folder.", "PathMakeSystemFolderW": "Gives an existing folder the proper attributes to become a system folder.", "PathMakeUniqueName": "Creates a unique path name from a template.", "PathMatchSpecA": "Searches a string using a Microsoft MS-DOS wildcard match type.", "PathMatchSpecExA": "Matches a file name from a path against one or more file name patterns.", "PathMatchSpecExW": "Matches a file name from a path against one or more file name patterns.", "PathMatchSpecW": "Searches a string using a Microsoft MS-DOS wildcard match type.", "PathParseIconLocationA": "Parses a file location string that contains a file location and icon index, and returns separate values.", "PathParseIconLocationW": "Parses a file location string that contains a file location and icon index, and returns separate values.", "PathProcessCommand": "Processes a string that contains a command line and generates a suitably quoted string, with arguments attached if required.", "PathQuoteSpacesA": "Searches a path for spaces.", "PathQuoteSpacesW": "Searches a path for spaces.", "PathRelativePathToA": "Creates a relative path from one file or folder to another.", "PathRelativePathToW": "Creates a relative path from one file or folder to another.", "PathRemoveArgsA": "Removes any arguments from a given path.", "PathRemoveArgsW": "Removes any arguments from a given path.", "PathRemoveBackslashA": "Removes the trailing backslash from a given path.", "PathRemoveBackslashW": "Removes the trailing backslash from a given path.", "PathRemoveBlanksA": "Removes all leading and trailing spaces from a string.", "PathRemoveBlanksW": "Removes all leading and trailing spaces from a string.", "PathRemoveExtensionA": "Removes the file name extension from a path, if one is present.", "PathRemoveExtensionW": "Removes the file name extension from a path, if one is present.", "PathRemoveFileSpecA": "Removes the trailing file name and backslash from a path, if they are present.", "PathRemoveFileSpecW": "Removes the trailing file name and backslash from a path, if they are present.", "PathRenameExtensionA": "Replaces the extension of a file name with a new extension.", "PathRenameExtensionW": "Replaces the extension of a file name with a new extension.", "PathResolve": "PathResolve may be altered or unavailable.", "PathSearchAndQualifyA": "Determines if a given path is correctly formatted and fully qualified.", "PathSearchAndQualifyW": "Determines if a given path is correctly formatted and fully qualified.", "PathSetDlgItemPathA": "Sets the text of a child control in a window or dialog box, using PathCompactPath to ensure the path fits in the control.", "PathSetDlgItemPathW": "Sets the text of a child control in a window or dialog box, using PathCompactPath to ensure the path fits in the control.", "PathSkipRootA": "Retrieves a pointer to the first character in a path following the drive letter or Universal Naming Convention server/share path elements.", "PathSkipRootW": "Retrieves a pointer to the first character in a path following the drive letter or Universal Naming Convention server/share path elements.", "PathStripPathA": "Removes the path portion of a fully qualified path and file.", "PathStripPathW": "Removes the path portion of a fully qualified path and file.", "PathStripToRootA": "Removes all file and directory elements in a path except for the root information.", "PathStripToRootW": "Removes all file and directory elements in a path except for the root information.", "PathUndecorateA": "Removes the decoration from a path string.", "PathUndecorateW": "Removes the decoration from a path string.", "PathUnExpandEnvStringsA": "Replaces certain folder names in a fully qualified path with their associated environment string.", "PathUnExpandEnvStringsW": "Replaces certain folder names in a fully qualified path with their associated environment string.", "PathUnmakeSystemFolderA": "Removes the attributes from a folder that make it a system folder.", "PathUnmakeSystemFolderW": "Removes the attributes from a folder that make it a system folder.", "PathUnquoteSpacesA": "Removes quotes from the beginning and end of a path.", "PathUnquoteSpacesW": "Removes quotes from the beginning and end of a path.", "PathYetAnotherMakeUniqueName": "Creates a unique filename based on an existing filename.", "PauseTimer": "Pauses progress dialog timer.", "PerformOperations": "Executes all selected operations.", "PerUserInit": "Creates My Documents and other special folders, initializes them as needed, and creates the Send To shortcut menu item for My Documents.", "PickIconDlg": "PickIconDlg may be altered or unavailable.", "PlaySound": "Plays a sound in conjunction with the notification.", "Popup": "Displays a modal pop-up menu at a specific location.", "PopupItemMenu": "Creates a shortcut menu for the specified item and returns the selected command string.", "PostCopyItem": "Performs caller-implemented actions after the copy process for each item is complete.", "PostDeleteItem": "Performs caller-implemented actions after the delete process for each item is complete.", "PostMoveItem": "Performs caller-implemented actions after the move process for each item is complete.", "PostNewItem": "Performs caller-implemented actions after the new item is created.", "PostPaint": "Called after the namespace tree control is drawn.", "PostRenameItem": "Performs caller-implemented actions after the rename process for each item is complete.", "PreCopyItem": "Performs caller-implemented actions before the copy process for each item begins.", "PreDeleteItem": "Performs caller-implemented actions before the delete process for each item begins.", "PreMoveItem": "Performs caller-implemented actions before the move process for each item begins.", "PreNewItem": "Performs caller-implemented actions before the process to create a new item begins.", "PrePaint": "Called before the namespace tree control is drawn.", "PrepareForSync": "Allows a registered application to display any user interface, and perform any necessary initialization before the ISyncMgrSynchronize::Synchronize method is called.", "PrepareForSyncCompleted": "Called by a registered handler of an application after the PrepareForSync method is complete.", "PreRenameItem": "Performs caller-implemented actions before the rename process for each item begins.", "PresentConflict": "Presents the conflict to the user.", "PrevPage": "Switches to the previous page of a multipage image.", "PrintTo": "Prints a file.", "ProcessAttachDetach": "Deprecated.", "ProfferService": "Makes a service available to other objects on the same host.", "Progress": "Called by a registered application to update the progress information and determine whether an operation should continue.", "Prompt": "Presents a prompt UI to the user.", "PropertyFailure": "Called when there is a failure that involves file properties and user interaction is needed.", "ProposeItem": "Proposes the addition of a new item to the set of items previously enumerated.", "PtrdiffTAdd": "Adds two values of type ptrdiff_t.", "PtrdiffTMult": "Multiplies two values of type ptrdiff_t.", "PtrdiffTSub": "Subtracts one value of type ptrdiff_t from another.", "put_CurrentViewMode": "Sets the current view mode of the current folder.", "put_FolderFlags": "Sets the current folders settings.", "put_GroupBy": "Sets the column used in grouping the folder view.", "put_IconSize": "Sets the icon size setting for the current folder.", "put_SortColumns": "Sets the names of the columns to be sorted.", "PutBaseBrowserData": "Note, however, that state should only be updated by the base browser.", "QISearch": "A table-driven implementation of the IUnknown::QueryInterface method.", "QueryAbilities": "Determines what options the conflict presenter will display.", "QueryAbort": "Aborts an IShellImageData process such as Decode, Draw, or Scale.", "QueryActiveShellView": "Retrieves the currently active Shell view object.", "QueryAppIsDefault": "Determines whether an application owns the registered default association for a given application level and type.", "QueryAppIsDefaultAll": "Determines whether an application owns all of the registered default associations for a given application level.", "QueryBand": "Gets information about a band in a band site.", "QueryCancel": "Provides information about whether the action is being canceled.", "QueryContextMenu": "Adds commands to a shortcut menu.", "QueryContinue": "Returns S_OK if the operation associated with the current instance of this interface should continue.", "QueryCurrentDefault": "Determines the default application for a given association type.", "QueryFocus": "Directs the preview handler to return the HWND from calling the GetFocus Function.", "QueryForAdditionalItems": "This is the set of items that will be synchronized after the current synchronization is finished.", "QueryObject": "Queries for a specified object.", "QuerySupport": "QuerySupport may be altered or unavailable.", "ReadAsync": "Reads information from a stream asynchronously.", "ReadCabinetState": "ReadCabinetState may be altered or unavailable.", "ReadPropertyNPB": "Causes a property to be read from the named property bag.", "RealDriveType": "RealDriveType may be altered or unavailable.", "Rearrange": "Rearrange may be altered or unavailable.", "RecompressImage": "Recompresses an image.", "RecycleItem": "Recycle the item into the provided recycle location and return the item in its new location.", "Redirect": "Redirects folder requests for common and per-user folders.", "Refresh": "Refreshes the view's contents in response to user input.", "RefreshObject": "RefreshObject may be altered or unavailable.", "RefreshOverlayImages": "Refreshes the overlay cache, the image list, or both.", "Register": "Registers an open window as a Shell window; the window is specified by handle.", "RegisterAbort": "Sets a callback abort object, optionally returning a pointer to the previous object.", "RegisterAppStateChangeNotification": "Enables an app to register a callback function through which it can be notified that its library is going into or coming out of a suspended state.", "RegisterAsChild": "ISuspensionDependencyManager::RegisterAsChild method", "RegisterDialogClasses": "Registers any nonstandard window classes required by a screen saver's configuration dialog box.", "RegisterFolder": "Adds a new known folder to the registry.", "RegisterForPackageStateChanges": "Register for package state-change notifications.", "RegisterPending": "Registers a pending window as a Shell window; the window is specified by an absolute PIDL.", "RegisterScaleChangeEvent": "This function replaces RegisterScaleChangeNotifications.", "RegisterScaleChangeNotifications": "Registers a window to receive callbacks when scaling information changes.", "RegisterSyncMgrHandler": "Registers a handler with the synchronization manager when the handler has items to synchronize.", "RegisterTab": "Informs the taskbar that a new tab or document thumbnail has been provided for display in an application's taskbar group flyout.", "RegisterWindow": "Registers the browser in the list of browser windows.", "ReleaseShellView": "Coordinates the view lifetime between the base class and its derived class.", "Remove": "Removes an object from the collection of managed objects.", "RemoveAll": "Removes all items from the results folder.", "RemoveAllControlItems": "Not implemented.", "RemoveAllDestinations": "Clears all destination entries from the Recent and Frequent categories in an application's Jump List.", "RemoveAllRoots": "Removes all roots and their children from a tree.", "RemoveBackReferences": "Removes all back references held by an object.", "RemoveBand": "Removes a band from the band site.", "RemoveConflicts": "Deletes a set of conflicts, specified by conflict ID, from the store.", "RemoveControlItem": "Removes an item from a container control in the dialog.", "RemoveDataBlock": "Removes a data block from a link.", "RemoveDestination": "Removes a single destination from the Recent and Frequent categories in a Jump List.", "RemoveEvent": "Removes events, as specified.", "RemoveFolder": "Removes a folder from the library.", "RemoveFromList": "WindowsÂ Vista:_Removes an item from the Start menu pinned list, which is the list in the upper left position of the Start menu.", "RemoveFromSyncSet": "Deletes the conflict and removes the IShellItem from synchronization.", "RemoveIDList": "Removes a pointer to an item identifier list from a results folder.", "RemoveItem": "Removes the item without moving the item to the Recycle Bin.", "RemoveMenusSB": "Permits the container to remove any of its menu elements from the in-place composite menu and to free all associated resources.", "RemoveObject": "RemoveObject may be altered or unavailable.", "RemoveObjectAt": "Removes a single, specified object from the collection.", "RemovePropertyNPB": "Removes a property from a named property bag.", "RemoveRoot": "Removes a root and its children from a tree.", "RemoveTasks": "Removes tasks from the scheduler's background queue.", "RemoveToolbar": "Removes the specified IDockingWindow from the toolbar frame.", "RemoveWindowSubclass": "Removes a subclass callback from a window.", "RenameItem": "Changes the name of an item, returning the IShellItem with the new name.", "RenameItems": "All items are given the same name.", "ReplaceFrame": "Replaces the current frame with a new image.", "ReplacePage": "Replaces a page in a property sheet for a Control Panel object.", "ReportEvent": "Provides an event to add to the Sync Results folder for an item being synchronized.", "ReportManualSync": "Reports that a synchronization operation is being performed that was requested manually from outside the Sync Center UI.", "ReportProgress": "Reports the progress of the synchronization of a single sync item to Sync Center.", "ReportResult": "Translates a received error status code into the appropriate user-readable message.", "RequestBorderSpaceDW": "The border space is not allocated until the SetBorderSpaceDW method is called.", "RequireTouchInEditControl": "Requires an explicit user tap in an edit field before the touch keyboard invokes.", "Reset": "Instructs the enumerator to position itself at the beginning of the list of elements.", "ResetCancel": "Resets progress dialog after a cancellation has been completed.", "ResetEnumerator": "Forces the autocomplete object to refresh its list of suggestions when the list is visible.", "ResetTimer": "Resets progress dialog timer to 0.", "ResizeBorderDW": "Notifies the docking window object that the frame 's border space has changed.", "Resolve": "Resolves the conflict using its own sync handler, controls UI.", "ResolveFolder": "Resolves the target location of a library folder, even if the folder has been moved or renamed.", "ResolveShellLink": "Requests that a folder object resolve a Shell link.", "RestartDialog": "Displays a dialog box that prompts the user to restart Windows.", "RestartDialogEx": "Displays a dialog box that asks the user to restart Windows.", "Result": "Gets the result of a StartHandlerSync or StartItemSync call.", "Resume": "Requests that a task resume.", "ResumeTimer": "Resumes progress dialog timer.", "RetrieveProperties": "Gets the properties managed by the sync engine.", "Revert": "Deprecated.", "Revoke": "Revokes a Shell window's registration and removes the window from the Shell windows collection.", "RevokeScaleChangeNotifications": "Revokes the registration of a window, preventing it from receiving callbacks when scaling information changes.", "RevokeService": "Makes a service unavailable that had previously been available to other objects through IProfferService::ProfferService.", "Rotate": "Rotates an image in increments of 90 degrees.", "Run": "Performs the actual display of UI for a handler or sync item when requested to do so by Sync Center.", "RunGadget": "Adds an installed gadget to the desktop.", "Save": "Saves the library to a new Library Description file.", "SaveInKnownFolder": "Saves the library to a new file in a specified known folder.", "SaveProperties": "Saves properties associated with a file or folder.", "SaveViewState": "Deprecated.", "SaveWithUI": "Presents the user with explanatory error UI if the save action fails.", "Scale": "Adjusts the size of an image.", "ScreenSaverConfigureDialog": "A screen saver that allows user configuration must define this function.", "ScreenSaverProc": "Receives messages sent to the specified screen saver window.", "Select": "IShellFolderView::Select may be altered or unavailable.", "SelectAndEditItem": "INewMenuClient::SelectAndEditItem method", "SelectAndPositionItem": "Selects and positions an item in a Shell View.", "SelectAndPositionItems": "Allows the selection and positioning of items visible in the folder's view.", "SelectedItems": "Gets a FolderItems object that represents all of the selected items in the view.", "SelectItem": "Changes the selection state of one or more items within the Shell view window.", "SelectItemRelative": "Selects an item relative to the current item.", "SelectPage": "Selects a specified page in a multipage image.", "SendControlMsg": "Sends control messages to either the toolbar or the status bar in a Windows Explorer window.", "SetAcceleratorMenu": "Implemented by a derived class to define menu accelerators that can be used in a call to TranslateAcceleratorSB.", "SetAccelerators": "Sets accelerators.", "SetAccessibleName": "Sets text that is retrieved by IAccessible::get_accName which accessibility tools use to obtain the Name Property of an object.", "SetActivateState": "The derived class makes this call to the base class.", "SetActiveAlt": "Marks a taskbar item as active but does not visually activate it.", "SetAdjacentDisplayEdges": "Sets whether the application window will be adjacent to the edge of the emulated display.", "SetAnimation": "Specifies an Audio-Video Interleaved clip that runs in the dialog box.", "SetAppAsDefault": "For more information, see Default Programs.", "SetAppAsDefaultAll": "Sets an application as the default for all of the registered associations of any type for that application.", "SetAppID": "Specifies a unique application - defined Application User Model ID that identifies the object as a handler for a specific file type.", "SetApplicationViewMinWidth": "Sets the desired minimum width of the application design mode window.", "SetApplicationViewOrientation": "Sets the window orientation used for the design mode window.", "SetApplicationViewState": "Sets a spoofed application view state to be used for a Windows Store app running in design mode.", "SetArguments": "Sets the command-line arguments for a Shell link object.", "SetAsDefFolderSettings": "Sets the folder 's current view mode as the default view mode for all folders.", "SetAsyncMode": "Called by a drop source to specify whether the data object supports asynchronous data extraction.", "SetAutomationObject": "Replaces the internal automation object of the IShellView.", "SetBackgroundColor": "Sets the background color of the preview handler.", "SetBalloonInfo": "Sets the information to be displayed in a balloon notification.", "SetBalloonRetry": "Specifies the conditions for trying to display user information when the first attempt fails.", "SetBandAvailability": "Sets the availability of a specified band.", "SetBandInfoSFB": "Uses the information in a BANDINFOSFB structure to set the band information for a IShellFolderBand object.", "SetBandSiteInfo": "Sets information about the band site.", "SetBandState": "Set the state of a band in the band site.", "SetBorderSpaceDW": "Allocates and reserves border space for an IDockingWindow object.", "SetCallback": "IShellFolderView::SetCallback may be altered or unavailable.", "SetCancelButtonLabel": "Replaces the default text \"Cancel\" on the common file dialog's Cancel button.", "SetCancelInformation": "Sets information that is posted when a user selects Cancel from the progress UI.", "SetCancelMsg": "Sets a message to be displayed if the user cancels the operation.", "SetCascade": "Sets a cascade folder.", "SetCheckboxValue": "Enables a Logon UI and Credential UI to indicate that a checkbox value has changed.", "SetCheckButtonState": "Sets the state of a check button in the dialog.", "SetCheckState": "Sets the state of a check box item in a tree-view control.", "SetClient": "Sets the client specified by punkClient.", "SetClientGuid": "Enables a calling application to associate a GUID with a dialog's persisted state.", "SetClientTitle": "Specifies and stores the title of the prompt window.", "SetClipboard": "SetClipboard may be altered or unavailable.", "SetCodePage": "Sets the numeric value of the ANSI code page to a specified code page identifier.", "SetCollectedProperties": "Specifies which properties will be collected in the save dialog.", "SetColor": "Sets the color, as specified.", "SetColumnInfo": "Sets the state for a specified column.", "SetColumns": "Sets the collection of columns for the view to display.", "SetComboBoxSelectedValue": "Enables a Logon UI and Credential UI to indicate that a combo box value has been selected.", "SetCompositionState": "Sets the composition state.", "SetCondition": "Sets the ICondition of the search.", "SetContext": "Enables a thumbnail provider to return a thumbnail specific to the user's context.", "SetContractDelegateWindow": "Associates an app window other than the primary foreground window with an app 's contracts.", "SetControlItemState": "Sets the current state of an item in a container control found in the dialog.", "SetControlItemText": "Sets the text of a control item.", "SetControlLabel": "Sets the text associated with a control, such as button text or an edit box label.", "SetControlState": "Sets the current visibility and enabled states of a given control.", "SetControlStyle": "Sets the display styles for the namespace object's treeview controls.", "SetControlStyle2": "Sets the extended display styles for the namespace object's treeview controls.", "SetCreateFlags": "Set the flags that will be included in the call to CreateProcess.", "SetCurrentFolderFlags": "Sets and applies specified folder flags.", "SetCurrentProcessExplicitAppUserModelID": "Specifies a unique application - defined Application User Model ID that identifies the current process to the taskbar.", "SetCurrentViewMode": "Sets the selected folder's view mode.", "SetDataObject": "Wraps an IDataObject instance as a Windows Runtime DataPackage.", "SetDefaultExtension": "Sets the default extension to be added to file names.", "SetDefaultFolder": "Sets the folder used as a default if there is not a recently used folder value available.", "SetDefaultIcon": "Sets the default icon.", "SetDefaultSaveFolder": "Sets the default target folder that the library will use for save operations.", "SetDescription": "The description can be any application - defined string.", "SetDeselected": "Called when a credential loses selection.", "SetDirectory": "Sets a new working directory.", "SetDisplayName": "Sets the search folder display name, as specified.", "SetEditBoxText": "Sets the text in an edit box control found in the dialog.", "SetEmptyText": "Sets the default empty text.", "SetEncoderParams": "Sets encoder parameters.", "SetEnumReadyCallback": "Sets a callback on the view that is notified when the initial view enumeration is complete.", "SetEnvironmentVariable": "Sets a variable in the environment of the created process.", "SetErrorURL": "Specifies the URL of a page that displays when a user experiences an error while navigating through the wizard extension pages.", "SetExtendedTileViewProperties": "Sets the list of extended tile properties for an item.", "SetFieldBitmap": "Communicates to the Logon UI or Credential UI that a tile image field has changed and that the UI should be updated.", "SetFieldCheckbox": "Communicates to the Logon UI or Credential UI that a checkbox field has changed and that the UI should be updated.", "SetFieldComboBoxSelectedItem": "Communicates to the Logon UI or Credential UI that the selected item in a combo box has changed and that the UI should be updated.", "SetFieldInteractiveState": "Communicates to the Logon UI or Credential UI that the interactivity state of a field has changed and that the UI should be updated.", "SetFieldOptions": "Specifies whether a specified field in the logon or credential UI should display a \"password reveal\" glyph or is expected to receive an e-mail address.", "SetFieldState": "Communicates to the Logon UI or Credential UI that a field state has changed and that the UI should be updated.", "SetFieldString": "Communicates to the Logon UI or Credential UI that the string associated with a field has changed and that the UI should be updated.", "SetFieldSubmitButton": "Enables credentials to set the field that the submit button appears adjacent to.", "SetFileID": "Sets the unique file identifier for the current file.", "SetFileName": "Sets the file name that appears in the File name edit box when that dialog box is opened.", "SetFileNameLabel": "Sets the text of the label next to the file name edit box.", "SetFileTypeIndex": "Sets the file type that appears as selected in the dialog.", "SetFileTypes": "Sets the file types that the dialog can open or save.", "SetFilter": "Exposed by a host to allow clients to pass the host their IUnknown interface pointers.", "SetFindData": "This information is used by ParseDisplayName.", "SetFlags": "Deprecated.", "SetFocus": "Directs the preview handler to set focus to itself.", "SetFolder": "Sets a folder that is always selected when the dialog is opened, regardless of previous user action.", "SetFolderLogicalViewMode": "The default settings are based on the FolderTypeID which is set by the ISearchFolderItemFactory::SetFolderTypeID method.", "SetFolderSettings": "Sets the folder settings for the current view.", "SetFolderType": "Sets the library's folder type.", "SetFolderTypeID": "Sets a search folder type ID, as specified.", "SetFolderViewOptions": "Sets specified options for the view.", "SetFont": "Sets the font attributes to be used for text within the preview handler.", "SetGroupBy": "Groups the view by the given property key and direction.", "SetGroupColumn": "Sets a group column, as specified.", "SetGroupSubsetCount": "Turns on group subsetting and sets the number of visible rows of items in each group.", "SetHandlerClsid": ".", "SetHandlerProgressText": "Sets the content of an information field for the handler while that handler is performing a synchronization.", "SetHistoryObject": "Deprecated.", "SetHotkey": "Sets a keyboard shortcut for a Shell link object.", "SetHotKey": "Sets the hot key for the application.", "SetIcon": "Sets the default icon for the library.", "SetIconInfo": "Sets the notification area icon associated with specific user information.", "SetIconLocation": "Sets the location of the icon for a Shell link object.", "SetIconSize": "The default settings are based on the FolderTypeID which is set by the ISearchFolderItemFactory::SetFolderTypeID method.", "SetIDList": "Sets the pointer to an item identifier list for a Shell link object.", "SetInitialURL": "Sets the URL of the initial server-provided HTML page in a hosted wizard.", "SetIsOnLockScreen": "This method determines whether or not the application, in design mode, can display information on the Windows 8 lock screen.", "SetItem": "IParseAndCreateItem::SetItem method", "SetItemAlloc": "Provides the CItemIDFactory an IMalloc interface used to allocate and free item IDs.", "SetItemChoices": "Sets the array of indexes that represents which items the user wants to keep.", "SetItemCustomState": "Sets the state of the checkbox associated with the Shell item.", "SetItemHeight": "Sets the specified item height.", "SetItemPos": "Sets the position of the given item.", "SetItemState": "Sets state information for a Shell item.", "SetItemStatus": "Called by the synchronization manager in a registered application's handler to change the status of an item in the following two cases:_between the time the handler has returned from the ISyncMgrSynchronize::PrepareForSync method and called the PrepareForSyncCompleted callback method, or after the handler has returned from the ISyncMgrSynchronize::Synchronize method but has not yet called the SynchronizeCompleted callback method.", "SetJunctionCLSID": "Sets the class identifier of the object that implements IShellFolder, if the current item is a junction point.", "SetKey": "Sets the registry key from which to load the \"DefaultIcon\" value.", "SetKeyState": "Sets a value based on the current state of the keys CTRL and SHIFT.", "SetLine": "Displays a message in the progress dialog.", "SetLocalPath": "Sets and stores the path to the file.", "SetMenu": "Appends a static menu to the menu band.", "SetMenuContextHelpId": "Associates a Help context identifier with a menu.", "SetMenuRestrictions": ".", "SetMenuSB": "Installs the composite menu in the view window.", "SetMenuToolbar": "Adds a menu to the menuband.", "SetMode": "Sets progress dialog operations mode.", "SetNamedValue": "Sets the value of a named property.", "SetNameOf": "Sets the display name of a file object or subfolder, changing the item identifier in the process.", "SetNativeDisplayOrientation": "Sets the orientation of the emulated display for the design mode window.", "SetNativeDisplaySize": "Sets a spoofed native display size to be used for a Windows Store app running in design mode.", "SetNavigateState": "Deprecated.", "SetNavigationRoot": "Users can not navigate above this location.", "SetNoIcons": "Sets whether icons are displayed in a folder band.", "SetNormalIcon": "Sets the normal icon.", "SetNoShowUI": "Indicates whether any UI associated with the selected Shell item should be displayed.", "SetNoText": "Sets whether text is displayed in a folder band.", "SetObjectCount": "SetObjectCount is no longer available.", "SetObscured": "Coordinates obscured items on a toolbar with items in a menu.", "SetOkButtonLabel": "Sets the text of the Open or Save button.", "SetOpenIcon": "Sets the icon that allows containers to specify an \"open\" look.", "SetOperation": "Sets which progress dialog operation is occurring, and whether we are in pre-flight or undo mode.", "SetOperationFlags": "Sets parameters for the current operation.", "SetOptions": "Sets the library options.", "SetOverlayIcon": "Applies an overlay to a taskbar button to indicate application status or a notification to the user.", "SetOwner": "Deprecated.", "SetOwnerWindow": "Sets the parent or owner window for progress and dialog windows.", "SetParameters": "Provides parameter values for the verb.", "SetParentAndItem": "Sets the parent of an item and the parent's child ID.", "SetPath": "Sets the path and file name for the target of a Shell link object.", "SetPinnedWindow": "Sets the pinned window.", "SetPoints": "SetPoints may be altered or unavailable.", "SetPosition": "Sets the coordinates of a point used for display.", "SetPresenterChoice": "Sets what kind of choice was made about a sync manager conflict resolution and whether to apply the choice to all subsequent conflicts in the set.", "SetPresenterNextStep": "Sets what the presenter wants to do as the next step in the sync manager conflict resolution.", "SetProcessReference": "Provides a Component Object Model object that allows hosted Shell extensions and other components to prevent their host process from closing prematurely.", "SetProgID": "Sets the ProgID of an object.", "SetProgress": "Updates the progress dialog box with the current state of the operation.", "SetProgress64": "Updates the progress dialog box with the current state of the operation.", "SetProgressCallback": "Sets the ISyncMgrSynchronizeCallback interface.", "SetProgressDialog": "Specifies a dialog box used to display the progress of the operation.", "SetProgressMessage": "Not implemented.", "SetProgressState": "Sets the type and state of the progress indicator displayed on a taskbar button.", "SetProgressValue": "Displays or updates a progress bar hosted in a taskbar button to show the specific percentage completed of the full operation.", "SetProperties": "Sets properties that should be applied to an item.", "SetPropertyBag": "Sets the name of the property bag.", "SetPropertyKey": "Sets the property key.", "SetPropertyStorage": "Initializes the property store instance from the specified serialized property storage data.", "SetProviderFilter": "Limits the set of users in the array to either local accounts or Microsoft accounts.", "SetRect": "Directs the preview handler to change the area within the parent hwnd that it draws into.", "SetRedraw": "Sets redraw on and off.", "SetReferent": "Sets the referent of the shortcut object.", "SetReferrer": "Deprecated.", "SetRelativePath": "Sets the relative path to the Shell link object.", "SetSaveAsItem": "Sets an item to be used as the initial entry in a Save As dialog.", "SetScaleFactor": "Sets a spoofed device scale factor to be used for a Windows Store app running in design mode.", "SetScope": "Sets search scope, as specified.", "SetSelected": "Called when a credential is selected.", "SetSelectedControlItem": "Sets the selected state of a particular item in an option button group or a combo box found in the dialog.", "SetSelection": "Provides the Shell item array that specifies the items included in the selection.", "SetSerialization": "Sets the serialization characteristics of the credential provider.", "SetShellFolder": "Specifies the folder for the menu band to browse.", "SetShortcutIcon": "Sets the icon for a shortcut to the object.", "SetShowCmd": "The show command sets the initial show state of the window.", "SetShowWindow": "Sets the specified window's visual state.", "SetSlideshow": "Specifies the images to use for the desktop wallpaper slideshow.", "SetSlideshowOptions": "Sets the desktop wallpaper slideshow settings for shuffle and timing.", "SetSortColumns": "Creates a list of sort column directions, as specified.", "SetSource": "Sets an alternate path or URL for the source of a file transfer.", "SetStacks": "Creates a list of stack keys, as specified.", "SetStatusMessage": "Enables the credential provider to set status messages as it attempts to complete IConnectableCredentialProviderCredential::Connect.", "SetStatusTextSB": "Sets and displays status text about the in-place object in the container's frame-window status bar.", "SetStringValue": "Enables a Logon UI or Credential UI to update the text for a CPFT_EDIT_TEXT fields as the user types in them.", "SetSubMenu": "Sets the given menu bar interface to be the submenu of the calling application object's interface.", "SetTabActive": "Informs the taskbar that a tab or document window has been made the active window.", "SetTabOrder": "Inserts a new thumbnail into a tabbed-document interface application's group flyout or moves an existing thumbnail to a new position in the application's group.", "SetTabProperties": "Allows a tab to specify whether the main application frame window or the tab window should be used as a thumbnail or in the peek feature under certain circumstances.", "SetTargetSessionId": "Sets the session identifier.", "SetText": "Sets the default text to be used when there are no items in the view.", "SetTextColor": "Sets the color of the text within the preview handler.", "SetTheme": "Sets the desktop theme for the current window only.", "SetThumbnailClip": "Selects a portion of a window's client area to display as that window's thumbnail in the taskbar.", "SetThumbnailStream": "This method is for internal use only and can only be called by the photos application.", "SetThumbnailTooltip": "Specifies or updates the text of the tooltip that is displayed when the mouse pointer rests on an individual preview thumbnail in a taskbar button flyout.", "SetTileViewProperties": "Set the list of tile properties for an item.", "SetTimes": "Sets file times.", "SetTitle": "Deprecated.", "SetToolbarItems": "Adds toolbar items to Windows Explorer's toolbar.", "SetTopBrowser": "Deprecated.", "SetUsageScenario": "Called whenever the credential provider is initialized.", "SetUserArray": "Called by the system during the initialization of a logon or credential UI to retrieve the set of users to show in that UI.", "SetViewModeAndIconSize": "Sets and applies the view mode and image size.", "SetViewProperty": "Caches a property for an item in the view's property cache.", "SetVisibleColumns": "Creates a new column list whose columns are all visible, given an array of PROPERTYKEY structures.", "SetWallpaper": "Sets the desktop wallpaper.", "SetWatermark": "Provides a bitmap to use as a watermark.", "SetWindow": "Sets the parent window of the previewer window, as well as the area within the parent to be used for the previewer window.", "SetWindowContextHelpId": "Associates a Help context identifier with the specified window.", "SetWindowSubclass": "Installs or updates a window subclass callback.", "SetWorkingDirectory": "Sets the name of the working directory for a Shell link object.", "SHAddFolderPathToLibrary": "Adds a folder to a library.", "SHAddFromPropSheetExtArray": "Adds pages to a property sheet extension array created by SHCreatePropSheetExtArray.", "SHAddToRecentDocs": "This function can also be used to clear all usage data.", "SHAlloc": "Allocates memory from the Shell's heap.", "SHAllocShared": "SHAllocShared may be altered or unavailable.", "SHAnsiToAnsi": "Copies an ANSI string.", "SHAnsiToUnicode": "Converts a string from the ANSI code page to the Unicode code page.", "SHAppBarMessage": "Sends an appbar message to the system.", "ShareExists": "Queries whether the Users or Public folder is shared.", "SharePrinters": "Shares all local printers connected to a computer, enabling them to be discovered by other computers on the network.", "SHAssocEnumHandlers": "Returns an enumeration object for a specified set of file name extension handlers.", "SHAssocEnumHandlersForProtocolByApplication": "Gets an enumeration interface that provides access to handlers associated with a given protocol.", "SHAutoComplete": "Instructs system edit controls to use AutoComplete to help complete URLs or file system paths.", "SHBindToFolderIDListParent": "Given a Shell namespace item specified in the form of a folder, and an item identifier list relative to that folder, this function binds to the parent of the namespace item and optionally returns a pointer to the final component of the item identifier list.", "SHBindToFolderIDListParentEx": "Extends the SHBindToFolderIDListParent function by allowing the caller to specify a bind context.", "SHBindToObject": "Retrieves and binds to a specified object by using the Shell namespace IShellFolder::BindToObject method.", "SHBindToParent": "Takes a pointer to a fully qualified item identifier list, and returns a specified interface pointer on the parent object.", "SHBrowseForFolderA": "Displays a dialog box that enables the user to select a Shell folder.", "SHBrowseForFolderW": "Displays a dialog box that enables the user to select a Shell folder.", "SHChangeNotification_Lock": "Locks the shared memory associated with a Shell change notification event.", "SHChangeNotification_Unlock": "Unlocks shared memory for a change notification.", "SHChangeNotify": "Notifies the system of an event that an application has performed.", "SHChangeNotifyDeregister": "Unregisters the client's window process from receiving SHChangeNotify messages.", "SHChangeNotifyRegister": "Registers a window to receive notifications from the file system or Shell, if the file system supports notifications.", "SHChangeNotifyRegisterThread": "Enables asynchronous register and deregister of a thread.", "SHCloneSpecialIDList": "SHCloneSpecialIDList may be altered or unavailable.", "SHCLSIDFromString": "Takes the string form of a class identifier and creates the corresponding CLSID.", "SHCoCreateInstance": "SHCoCreateInstance may be altered or unavailable.", "SHCopyKeyA": "Recursively copies the subkeys and values of the source subkey to the destination key.", "SHCopyKeyW": "Recursively copies the subkeys and values of the source subkey to the destination key.", "SHCreateAssociationRegistration": "Creates an IApplicationAssociationRegistration object based on the stock implementation of the interface provided by Windows.", "SHCreateDataObject": "Creates a data object in a parent folder.", "SHCreateDefaultContextMenu": "Creates an object that represents the Shell's default context menu implementation.", "SHCreateDefaultExtractIcon": "Creates a standard icon extractor, whose defaults can be further configured via the IDefaultExtractIconInit interface.", "SHCreateDefaultPropertiesOp": "Creates a file operation that sets the default properties on the Shell item that have not already been set.", "SHCreateDirectory": "Creates a new file system folder.", "SHCreateDirectoryExA": "Creates a new file system folder, with optional security attributes.", "SHCreateDirectoryExW": "Creates a new file system folder, with optional security attributes.", "SHCreateFileExtractIconA": "SHCreateFileExtractIcon may be altered or unavailable.", "SHCreateFileExtractIconW": "SHCreateFileExtractIcon may be altered or unavailable.", "SHCreateItemFromIDList": "Creates and initializes a Shell item object from a pointer to an item identifier list.", "SHCreateItemFromParsingName": "Creates and initializes a Shell item object from a parsing name.", "SHCreateItemFromRelativeName": "Creates and initializes a Shell item object from a relative parsing name.", "SHCreateItemInKnownFolder": "Creates a Shell item object for a single file that exists inside a known folder.", "SHCreateItemWithParent": "Create a Shell item, given a parent folder and a child item ID.", "SHCreateLibrary": "Creates an IShellLibrary object.", "SHCreateMemStream": "Creates a memory stream using a similar process to CreateStreamOnHGlobal.", "SHCreateProcessAsUserW": "Creates a new user-mode process and its primary thread to run a specified executable file.", "SHCreatePropSheetExtArray": "SHCreatePropSheetExtArray may be altered or unavailable.", "SHCreateQueryCancelAutoPlayMoniker": "Creates a QueryCancelAutoPlay class moniker, which can then be used to register the IQueryCancelAutoPlay handler in the running object table.", "SHCreateShellFolderView": "Creates a new instance of the default Shell folder view object.", "SHCreateShellFolderViewEx": "Creates a new instance of the default Shell folder view object.", "SHCreateShellItem": "Creates an IShellItem object.", "SHCreateShellItemArray": "Creates a Shell item array object.", "SHCreateShellItemArrayFromDataObject": "Creates a Shell item array object from a data object.", "SHCreateShellItemArrayFromIDLists": "Creates a Shell item array object from a list of ITEMIDLIST structures.", "SHCreateShellItemArrayFromShellItem": "Creates an array of one element from a single Shell item.", "SHCreateShellPalette": "Creates a halftone palette for the specified device context.", "SHCreateStdEnumFmtEtc": "SHCreateStdEnumFmtEtc may be altered or unavailable.", "SHCreateStreamOnFileA": "SHCreateStreamOnFile may be altered or unavailable.", "SHCreateStreamOnFileEx": "Opens or creates a file and retrieves a stream to read or write to that file.", "SHCreateStreamOnFileW": "SHCreateStreamOnFile may be altered or unavailable.", "SHCreateThread": "Creates a thread.", "SHCreateThreadRef": "Creates a per-thread reference to a Component Object Model object.", "SHCreateThreadWithHandle": "Creates a new thread and retrieves its handle.", "SHDefExtractIconA": "Provides a default handler to extract an icon from a file.", "SHDefExtractIconW": "Provides a default handler to extract an icon from a file.", "SHDeleteEmptyKeyA": "Deletes an empty key.", "SHDeleteEmptyKeyW": "Deletes an empty key.", "SHDeleteKeyA": "This function removes the key and all the key 's values from the registry.", "SHDeleteKeyW": "This function removes the key and all the key 's values from the registry.", "SHDeleteValueA": "Deletes a named value from the specified registry key.", "SHDeleteValueW": "Deletes a named value from the specified registry key.", "SHDestroyPropSheetExtArray": "Frees property sheet handlers that are pointed to an array created by SHCreatePropSheetExtArray.", "SHDoDragDrop": "Supports drag source creation on demand, as well as drag images.", "Shell_GetCachedImageIndex": "Shell_GetCachedImageIndex may be altered or unavailable.", "Shell_GetCachedImageIndexA": "Shell_GetCachedImageIndex may be altered or unavailable.", "Shell_GetCachedImageIndexW": "Shell_GetCachedImageIndex may be altered or unavailable.", "Shell_GetImageLists": "Retrieves system image lists for large and small icons.", "Shell_MergeMenus": "Shell_MergeMenus may be altered or unavailable.", "Shell_NotifyIconA": "Sends a message to the taskbar's status area.", "Shell_NotifyIconGetRect": "Gets the screen coordinates of the bounding rectangle of a notification icon.", "Shell_NotifyIconW": "Sends a message to the taskbar's status area.", "ShellAboutA": "Displays a ShellAbout dialog box.", "ShellAboutW": "Displays a ShellAbout dialog box.", "ShellExecuteA": "Performs an operation on a specified file.", "ShellExecuteExA": "Performs an operation on a specified file.", "ShellExecuteExW": "Performs an operation on a specified file.", "ShellExecuteW": "Performs an operation on a specified file.", "ShellMessageBoxA": "ShellMessageBox may be altered or unavailable.", "ShellMessageBoxW": "ShellMessageBox may be altered or unavailable.", "SHEmptyRecycleBinA": "Empties the Recycle Bin on the specified drive.", "SHEmptyRecycleBinW": "Empties the Recycle Bin on the specified drive.", "SHEnumerateUnreadMailAccountsA": "Enumerates the user accounts that have unread email.", "SHEnumerateUnreadMailAccountsW": "Enumerates the user accounts that have unread email.", "SHEnumKeyExA": "Enumerates the subkeys of the specified open registry key.", "SHEnumKeyExW": "Enumerates the subkeys of the specified open registry key.", "SHEnumValueA": "Enumerates the values of the specified open registry key.", "SHEnumValueW": "Enumerates the values of the specified open registry key.", "SHEvaluateSystemCommandTemplate": "Enforces strict validation of parameters used in a call to CreateProcess or ShellExecute.", "SHFileOperationA": "Copies, moves, renames, or deletes a file system object.", "SHFileOperationW": "Copies, moves, renames, or deletes a file system object.", "SHFind_InitMenuPopup": "SHFind_InitMenuPopup may be altered or unavailable.", "SHFindFiles": "SHFindFiles may be altered or unavailable.", "SHFlushSFCache": "SHFlushSFCache may be altered or unavailable.", "SHFormatDateTimeA": "SHFormatDateTime may be altered or unavailable.", "SHFormatDateTimeW": "SHFormatDateTime may be altered or unavailable.", "SHFormatDrive": "SHFormatDrive may be altered or unavailable.", "SHFree": "Frees the memory allocated by SHAlloc.", "SHFreeNameMappings": "Frees a file name mapping object that was retrieved by the SHFileOperation function.", "SHFreeShared": "SHFreeShared may be altered or unavailable.", "SHGetAssocKeys": "Retrieves an array of class subkeys associated with an IQueryAssociations object.", "SHGetAttributesFromDataObject": "SHGetAttributesFromDataObject may be altered or unavailable.", "SHGetDataFromIDListA": "Retrieves extended property data from a relative identifier list.", "SHGetDataFromIDListW": "Retrieves extended property data from a relative identifier list.", "SHGetDesktopFolder": "Retrieves the IShellFolder interface for the desktop folder, which is the root of the Shell's namespace.", "SHGetDiskFreeSpaceExA": "Retrieves disk space information for a disk volume.", "SHGetDiskFreeSpaceExW": "Retrieves disk space information for a disk volume.", "SHGetDriveMedia": "Returns the type of media that is in the given drive.", "SHGetFileInfoA": "Retrieves information about an object in the file system, such as a file, folder, directory, or drive root.", "SHGetFileInfoW": "Retrieves information about an object in the file system, such as a file, folder, directory, or drive root.", "SHGetFolderLocation": "Deprecated.", "SHGetFolderPathA": "Deprecated.", "SHGetFolderPathAndSubDirA": "Gets the path of a folder and appends a user-provided subfolder path.", "SHGetFolderPathAndSubDirW": "Gets the path of a folder and appends a user-provided subfolder path.", "SHGetFolderPathW": "Deprecated.", "SHGetIconOverlayIndexA": "Returns the index of the overlay icon in the system image list.", "SHGetIconOverlayIndexW": "Returns the index of the overlay icon in the system image list.", "SHGetIDListFromObject": "Retrieves the pointer to an item identifier list of an object.", "SHGetImageList": "Retrieves an image list.", "SHGetInstanceExplorer": "Retrieves an interface that allows hosted Shell extensions and other components to prevent their host process from closing prematurely.", "SHGetInverseCMAP": "Retrieves the inverse color table mapping for the halftone palette.", "SHGetItemFromDataObject": "Creates an IShellItem or related object based on an item specified by an IDataObject.", "SHGetItemFromObject": "Retrieves an IShellItem for an object.", "SHGetKnownFolderIDList": "Retrieves the path of a known folder as an ITEMIDLIST structure.", "SHGetKnownFolderItem": "Retrieves an IShellItem object that represents a known folder.", "SHGetKnownFolderPath": "Retrieves the full path of a known folder identified by the folder's KNOWNFOLDERID.", "SHGetLocalizedName": "Retrieves the localized name of a file in a Shell folder.", "SHGetMalloc": "Retrieves a pointer to the Shell's IMalloc interface.", "SHGetNameFromIDList": "Retrieves the display name of an item identified by its IDList.", "SHGetNewLinkInfoA": "Creates a name for a new shortcut based on the shortcut 's proposed target.", "SHGetNewLinkInfoW": "Creates a name for a new shortcut based on the shortcut 's proposed target.", "SHGetPathFromIDListA": "Converts an item identifier list to a file system path.", "SHGetPathFromIDListEx": "This function extends SHGetPathFromIDList by allowing you to set the initial size of the string buffer and declare the options below.", "SHGetPathFromIDListW": "Converts an item identifier list to a file system path.", "SHGetRealIDL": "SHGetRealIDL may be altered or unavailable.", "SHGetSetFolderCustomSettings": "SHGetSetFolderCustomSettings may be altered or unavailable.", "SHGetSetSettings": "SHGetSetSettings may be altered or unavailable.", "SHGetSettings": "Retrieves the current Shell option settings.", "SHGetSpecialFolderLocation": "SHGetSpecialFolderLocation is not supported and may be altered or unavailable in the future.", "SHGetSpecialFolderPathA": "SHGetSpecialFolderPath is not supported.", "SHGetSpecialFolderPathW": "SHGetSpecialFolderPath is not supported.", "SHGetStockIconInfo": "Retrieves information about system-defined Shell icons.", "SHGetTemporaryPropertyForItem": "Retrieves the temporary property for the given item.", "SHGetThreadRef": "Retrieves the per-thread object reference set by SHSetThreadRef.", "SHGetUnreadMailCountA": "Retrieves a specified user's unread message count for any or all email accounts.", "SHGetUnreadMailCountW": "Retrieves a specified user's unread message count for any or all email accounts.", "SHGetValueA": "Retrieves a registry value.", "SHGetValueW": "Retrieves a registry value.", "SHGetViewStatePropertyBag": "SHGetViewStatePropertyBag may be altered or unavailable.", "SHGlobalCounterDecrement": "Decrements a global counter.", "SHGlobalCounterGetValue": "Gets the current value of a global counter.", "SHGlobalCounterIncrement": "Increments a global counter.", "SHHandleUpdateImage": "SHHandleUpdateImage may be altered or unavailable.", "SHILCreateFromPath": "SHILCreateFromPath may be altered or unavailable.", "SHInvokePrinterCommandA": "Executes a command on a printer object.", "SHInvokePrinterCommandW": "Executes a command on a printer object.", "SHIsFileAvailableOffline": "Determines whether a file or folder is available for offline use.", "SHIsLowMemoryMachine": "Not supported.", "SHLimitInputEdit": "Sets limits on valid characters for an edit control.", "SHLoadIndirectString": "Extracts a specified text resource when given that resource in the form of an indirect string.", "SHLoadInProc": "Creates an instance of the specified object class from within the context of the Shell 's process.", "SHLoadLibraryFromItem": "Creates and loads an IShellLibrary object from a specified library definition file.", "SHLoadLibraryFromKnownFolder": "Creates and loads an IShellLibrary object for a specified known folder ID.", "SHLoadLibraryFromParsingName": "Creates and loads an IShellLibrary object for a specified path.", "SHLoadNonloadedIconOverlayIdentifiers": "Signals the Shell that during the next operation requiring overlay information, it should load icon overlay identifiers that either failed creation or were not present for creation at startup.", "SHLoadOLE": "Deprecated.", "SHLocalStrDupA": "Makes a copy of a string in newly allocated memory.", "SHLocalStrDupW": "Makes a copy of a string in newly allocated memory.", "SHLockShared": "SHLockShared may be altered or unavailable.", "SHMapPIDLToSystemImageListIndex": "SHMapPIDLToSystemImageListIndex may be altered or unavailable.", "SHMessageBoxCheckA": "SHMessageBoxCheck may be altered or unavailable.", "SHMessageBoxCheckW": "SHMessageBoxCheck may be altered or unavailable.", "SHMultiFileProperties": "Displays a merged property sheet for a set of files.", "SHObjectProperties": "SHObjectProperties may be altered or unavailable.", "SHOpenFolderAndSelectItems": "Opens a Windows Explorer window with specified items in a particular folder selected.", "SHOpenPropSheetA": "SHOpenPropSheet may be altered or unavailable.", "SHOpenPropSheetW": "SHOpenPropSheet may be altered or unavailable.", "SHOpenRegStream2A": "This function supersedes SHOpenRegStream.", "SHOpenRegStream2W": "This function supersedes SHOpenRegStream.", "SHOpenRegStreamA": "Deprecated.", "SHOpenRegStreamW": "Deprecated.", "SHOpenWithDialog": "Displays the Open With dialog box.", "ShortAdd": "Adds two values of type SHORT.", "ShortMult": "Multiplies two values of type SHORT.", "ShortSub": "Subtracts one value of type SHORT from another.", "ShortToChar": "Converts a value of type SHORT to a value of CHAR.", "ShortToDWordPtr": "Converts a value of type SHORT to a value of type DWORD_PTR.", "ShortToInt8": "Converts a value of type SHORT to a value of type INT8.", "ShortToUChar": "Converts a value of type SHORT to a value of UCHAR.", "ShortToUInt": "Converts a value of type SHORT to a value of type UINT.", "ShortToUInt8": "Converts a value of type SHORT to a value of type UINT8.", "ShortToUIntPtr": "Converts a value of type SHORT to a value of type UINT_PTR.", "ShortToULong": "Converts a value of type SHORT to a value of type ULONG.", "ShortToULongLong": "Converts a value of type SHORT to a value of type ULONGLONG.", "ShortToULongPtr": "Converts a value of type SHORT to a value of type ULONG_PTR.", "ShortToUShort": "Converts a value of type SHORT to a value of type USHORT.", "ShouldShow": "Specifies whether an individual item should be allowed through the filter and which should be blocked.", "Show": "Displays the notification.", "ShowContactCardForWindow": "Displays the UI for a contact on the specified window.", "ShowControlWindow": "Deprecated.", "ShowDeskBand": "Shows a specified deskband.", "ShowDW": "Instructs the docking window object to show or hide itself.", "ShowError": "Called by the synchronization manager in a registered application handler when a user double-clicks an associated message in the error tab.", "ShowErrorCompleted": "Called by the registered application's handler before or after its PrepareForSync operation has been completed.", "Showing": "Called before the input pane is shown, to allow the app window to make any necessary adjustments to its UI in response to the reduced screen space available to it.", "ShowInitialize": "Allows a file viewer to determine whether it can display a file.", "ShowProperties": "Called by the synchronization manager when a user selects an item in the choice dialog box, and then clicks the Properties button.", "ShowPropertiesCompleted": "Called by the registered application's handler before or after its ShowProperties operation is completed.", "ShowResolveConflictUIAsync": "IFileSyncMergeHandler::ShowResolveConflictUIAsync method", "ShowShareUIForWindow": "Displays the UI for sharing content for the specified window.", "ShowSharingWizard": "Displays a wizard that allows a user to create a Home Group, and then retrieves the sharing options that the user selected through the wizard.", "SHParseDisplayName": "Translates a Shell namespace object 's display name into an item identifier list and returns the attributes of the object.", "SHPathPrepareForWriteA": "Checks to see if the path exists.", "SHPathPrepareForWriteW": "Checks to see if the path exists.", "SHQueryInfoKeyA": "Retrieves information about a specified registry key.", "SHQueryInfoKeyW": "Retrieves information about a specified registry key.", "SHQueryRecycleBinA": "Retrieves the size of the Recycle Bin and the number of items in it, for a specified drive.", "SHQueryRecycleBinW": "Retrieves the size of the Recycle Bin and the number of items in it, for a specified drive.", "SHQueryUserNotificationState": "Checks the state of the computer for the current user to determine whether sending a notification is appropriate.", "SHQueryValueExA": "Opens a registry key and queries it for a specific value.", "SHQueryValueExW": "Opens a registry key and queries it for a specific value.", "SHRegCloseUSKey": "Closes a handle to a user-specific registry subkey in a user-specific subtree.", "SHRegCreateUSKeyA": "Creates or opens a registry subkey in a user-specific subtree.", "SHRegCreateUSKeyW": "Creates or opens a registry subkey in a user-specific subtree.", "SHRegDeleteEmptyUSKeyA": "Deletes an empty registry subkey in a user-specific subtree.", "SHRegDeleteEmptyUSKeyW": "Deletes an empty registry subkey in a user-specific subtree.", "SHRegDeleteUSValueA": "Deletes a registry subkey value in a user-specific subtree.", "SHRegDeleteUSValueW": "Deletes a registry subkey value in a user-specific subtree.", "SHRegDuplicateHKey": "Duplicates a registry key's HKEY handle.", "SHRegEnumUSKeyA": "Enumerates the subkeys of a registry subkey in a user-specific subtree.", "SHRegEnumUSKeyW": "Enumerates the subkeys of a registry subkey in a user-specific subtree.", "SHRegEnumUSValueA": "Enumerates the values of the specified registry subkey in a user-specific subtree.", "SHRegEnumUSValueW": "Enumerates the values of the specified registry subkey in a user-specific subtree.", "SHRegGetBoolUSValueA": "Retrieves a Boolean value from a registry subkey in a user-specific subtree.", "SHRegGetBoolUSValueW": "Retrieves a Boolean value from a registry subkey in a user-specific subtree.", "SHRegGetBoolValueFromHKCUHKLM": "Evaluates a registry key value and returns a boolean value that reflects whether the value exists and the expected state matches the actual state.", "SHRegGetIntW": "Reads a numeric string value from the registry and converts it to an integer.", "SHRegGetPathA": "Retrieves a file path from the registry, expanding environment variables as needed.", "SHRegGetPathW": "Retrieves a file path from the registry, expanding environment variables as needed.", "SHRegGetUSValueA": "Retrieves a value from a registry subkey in a user-specific subtree.", "SHRegGetUSValueW": "Retrieves a value from a registry subkey in a user-specific subtree.", "SHRegGetValueA": "Retrieves a registry value.", "SHRegGetValueFromHKCUHKLM": "Obtains specified information from the registry.", "SHRegGetValueW": "Retrieves a registry value.", "SHRegOpenUSKeyA": "Opens a registry subkey in a user-specific subtree.", "SHRegOpenUSKeyW": "Opens a registry subkey in a user-specific subtree.", "SHRegQueryInfoUSKeyA": "Retrieves information about a specified registry subkey in a user-specific subtree.", "SHRegQueryInfoUSKeyW": "Retrieves information about a specified registry subkey in a user-specific subtree.", "SHRegQueryUSValueA": "Retrieves the type and data for a specified name associated with an open registry subkey in a user-specific subtree.", "SHRegQueryUSValueW": "Retrieves the type and data for a specified name associated with an open registry subkey in a user-specific subtree.", "SHRegSetPathA": "Takes a file path, replaces folder names with environment strings, and places the resulting string in the registry.", "SHRegSetPathW": "Takes a file path, replaces folder names with environment strings, and places the resulting string in the registry.", "SHRegSetUSValueA": "Sets a registry subkey value in a user-specific subtree.", "SHRegSetUSValueW": "Sets a registry subkey value in a user-specific subtree.", "SHRegSetValue": "Not supported.", "SHRegWriteUSValueA": "Writes a value to a registry subkey in a user-specific subtree.", "SHRegWriteUSValueW": "Writes a value to a registry subkey in a user-specific subtree.", "SHReleaseThreadRef": "Releases a thread reference before the thread procedure returns.", "SHRemoveFolderPathFromLibrary": "Removes a folder from a library.", "SHRemoveLocalizedName": "Removes the localized name of a file in a Shell folder.", "SHReplaceFromPropSheetExtArray": "Requests each property sheet in a property sheet extension array to replace pages.", "SHResolveFolderPathInLibrary": "Attempts to resolve the target location of a library folder that has been moved or renamed.", "SHResolveLibrary": "Resolves all locations in a library, even those locations that have been moved or renamed.", "SHRestricted": "SHRestricted may be altered or unavailable.", "SHRunControlPanel": "Opens a Control Panel item.", "SHSaveLibraryInFolderPath": "Saves an IShellLibrary object to disk.", "SHSendMessageBroadcastA": "Sends a message to all top-level windows in the system.", "SHSendMessageBroadcastW": "Sends a message to all top-level windows in the system.", "SHSetDefaultProperties": "Applies the default set of properties on a Shell item.", "SHSetFolderPathA": "Deprecated.", "SHSetFolderPathW": "Deprecated.", "SHSetInstanceExplorer": "Provides an interface that allows hosted Shell extensions and other components to prevent their host process from closing prematurely.", "SHSetKnownFolderPath": "Redirects a known folder to a new location.", "SHSetLocalizedName": "Sets the localized name of a file in a Shell folder.", "SHSetTemporaryPropertyForItem": "Sets a temporary property for the specified item.", "SHSetThreadRef": "Stores a per - thread reference to a Component Object Model object.", "SHSetUnreadMailCountA": "Stores the current user's unread message count for a specified email account in the registry.", "SHSetUnreadMailCountW": "Stores the current user's unread message count for a specified email account in the registry.", "SHSetValueA": "Sets the value of a registry key.", "SHSetValueW": "Sets the value of a registry key.", "SHShellFolderView_Message": "SHShellFolderView_Message may be altered or unavailable.", "SHShowManageLibraryUI": "Shows the library management dialog box, which enables users to manage the library folders and default save location.", "SHSimpleIDListFromPath": "Deprecated.", "SHSkipJunction": "Checks a bind context to see if it is safe to bind to a particular component object.", "SHStartNetConnectionDialogA": "SHStartNetConnectionDialog may be altered or unavailable.", "SHStartNetConnectionDialogW": "SHStartNetConnectionDialog may be altered or unavailable.", "SHStrDupA": "Makes a copy of a string in newly allocated memory.", "SHStrDupW": "Makes a copy of a string in newly allocated memory.", "SHStripMneumonicA": "Removes the mnemonic marker from a string.", "SHStripMneumonicW": "Removes the mnemonic marker from a string.", "SHTestTokenMembership": "Uses CheckTokenMembership to test whether the given token is a member of the local group with the specified RID.", "SHUnicodeToAnsi": "Converts a string from the Unicode code page to the ANSI code page.", "SHUnicodeToUnicode": "Copies a Unicode string.", "SHUnlockShared": "SHUnlockShared may be altered or unavailable.", "SHUpdateImageA": "Notifies the Shell that an image in the system image list has changed.", "SHUpdateImageW": "Notifies the Shell that an image in the system image list has changed.", "SHValidateUNC": "SHValidateUNC may be altered or unavailable.", "SignalFileOpen": "SignalFileOpen may be altered or unavailable.", "SizeTAdd": "Adds two values of type size_t.", "SizeTMult": "Multiplies one value of type size_t by another.", "SizeTSub": "Subtracts one value of type size_t from another.", "Skip": "Instructs the enumerator to skip the next celt elements in the enumeration so that the next call to ISyncMgrEnumItems::Next does not return those elements.", "SoftwareUpdateMessageBox": "Displays a standard message box that can be used to notify a user that an application has been updated.", "SSIZETAdd": "Adds two SSIZE_T values together.", "SSIZETMult": "Multiplies one SSIZE_T value by another.", "SSIZETSub": "Subtracts one SSIZE_T value from another.", "StartHandlerSync": "Initiates the synchronization of all items managed by a particular handler.", "StartItemSync": "Initiates the synchronization of specified items managed by a particular handler.", "StartOperation": "Called by a drop target to indicate that asynchronous data extraction is starting.", "StartOperations": "Performs caller-implemented actions before any specific file operations are performed.", "StartProgressDialog": "Starts the specified progress dialog.", "StartServicing": "Suspends and terminates the non-background portion of the apps associated with the specified package and cancels the background tasks associated with the package.", "StartSessionRedirection": "Causes background tasks for the specified package to activate in the specified user session.", "StartSyncAll": "Synchronizes all items managed by all handlers.", "StartVisualGroup": "Subsequent calls to any \" add \" method add those elements to this group.", "Status": "Sets the release status and background thread timeout for the current task.", "StgMakeUniqueName": "Creates a unique name for a stream or storage object from a template.", "Stop": "Stops a progress dialog.", "StopHandlerSync": "Stops the synchronization of a specified handler.", "StopItemSync": "Stops the synchronization of specified items managed by a particular handler.", "StopProgressDialog": "Stops current progress dialog.", "StopServicing": "Completes the previous servicing operation that was started by a call to the StartServicing method.", "StopSessionRedirection": "Stops redirection of background tasks for the specified package.", "StopSharingPrinters": "Stops sharing all local, shared printers connected to a computer.", "StopSyncAll": "Stops the synchronization of all items managed by all handlers.", "StopWatchFlush": "StopWatchFlush may be altered or unavailable.", "StopWatchMode": "StopWatchMode may be altered or unavailable.", "StrCatBuffA": "Copies and appends characters from one string to the end of another.", "StrCatBuffW": "Copies and appends characters from one string to the end of another.", "StrCatChainW": "Concatenates two Unicode strings.", "StrCatW": "Appends one string to another.", "StrChrA": "Searches a string for the first occurrence of a character that matches the specified character.", "StrChrIA": "Searches a string for the first occurrence of a character that matches the specified character.", "StrChrIW": "Searches a string for the first occurrence of a character that matches the specified character.", "StrChrNIW": "Searches a string for the first occurrence of a specified character.", "StrChrNW": "Searches a string for the first occurrence of a specified character.", "StrChrW": "Searches a string for the first occurrence of a character that matches the specified character.", "StrCmpCA": "Compares strings using C run - time collation rules.", "StrCmpCW": "Compares strings using C run - time collation rules.", "StrCmpICA": "Compares two strings using C run - time collation rules.", "StrCmpICW": "Compares two strings using C run - time collation rules.", "StrCmpIW": "Compares two strings to determine if they are the same.", "StrCmpLogicalW": "Compares two Unicode strings.", "StrCmpNA": "Compares a specified number of characters from the beginning of two strings to determine if they are the same.", "StrCmpNCA": "The comparison is case - sensitive.", "StrCmpNCW": "The comparison is case - sensitive.", "StrCmpNIA": "Compares a specified number of characters from the beginning of two strings to determine if they are the same.", "StrCmpNICA": "The comparison is not case - sensitive.", "StrCmpNICW": "The comparison is not case - sensitive.", "StrCmpNIW": "Compares a specified number of characters from the beginning of two strings to determine if they are the same.", "StrCmpNW": "Compares a specified number of characters from the beginning of two strings to determine if they are the same.", "StrCmpW": "Compares two strings to determine if they are the same.", "StrCpyNW": "Copies a specified number of characters from the beginning of one string to another.", "StrCpyW": "Copies one string to another.", "StrCSpnA": "The search method is case - sensitive, and the terminating NULL character is included within the search pattern match.", "StrCSpnIA": "The search method is not case - sensitive, and the terminating NULL character is included within the search pattern match.", "StrCSpnIW": "The search method is not case - sensitive, and the terminating NULL character is included within the search pattern match.", "StrCSpnW": "The search method is case - sensitive, and the terminating NULL character is included within the search pattern match.", "StrDupA": "Duplicates a string.", "StrDupW": "Duplicates a string.", "StrFormatByteSize64A": "Converts a numeric value into a string that represents the number expressed as a size value in bytes, kilobytes, megabytes, or gigabytes, depending on the size.", "StrFormatByteSizeA": "Converts a numeric value into a string that represents the number expressed as a size value in bytes, kilobytes, megabytes, or gigabytes, depending on the size.", "StrFormatByteSizeEx": "Converts a numeric value into a string that represents the number in bytes, kilobytes, megabytes, or gigabytes, depending on the size.", "StrFormatByteSizeW": "Converts a numeric value into a string that represents the number expressed as a size value in bytes, kilobytes, megabytes, or gigabytes, depending on the size.", "StrFormatKBSizeA": "Converts a numeric value into a string that represents the number expressed as a size value in kilobytes.", "StrFormatKBSizeW": "Converts a numeric value into a string that represents the number expressed as a size value in kilobytes.", "StrFromTimeIntervalA": "Converts a time interval, specified in milliseconds, to a string.", "StrFromTimeIntervalW": "Converts a time interval, specified in milliseconds, to a string.", "StrIsIntlEqualA": "Compares a specified number of characters from the beginning of two strings to determine if they are equal.", "StrIsIntlEqualW": "Compares a specified number of characters from the beginning of two strings to determine if they are equal.", "StrNCatA": "Appends a specified number of characters from the beginning of one string to the end of another.", "StrNCatW": "Appends a specified number of characters from the beginning of one string to the end of another.", "StrPBrkA": "This search does not include the terminating null character.", "StrPBrkW": "This search does not include the terminating null character.", "StrRChrA": "Searches a string for the last occurrence of a specified character.", "StrRChrIA": "Searches a string for the last occurrence of a specified character.", "StrRChrIW": "Searches a string for the last occurrence of a specified character.", "StrRChrW": "Searches a string for the last occurrence of a specified character.", "StrRetToBSTR": "Accepts a STRRET structure returned by IShellFolder::GetDisplayNameOf that contains or points to a string, and returns that string as a BSTR.", "StrRetToBufA": "Converts an STRRET structure returned by IShellFolder::GetDisplayNameOf to a string, and places the result in a buffer.", "StrRetToBufW": "Converts an STRRET structure returned by IShellFolder::GetDisplayNameOf to a string, and places the result in a buffer.", "StrRetToStrA": "Takes an STRRET structure returned by IShellFolder::GetDisplayNameOf and returns a pointer to an allocated string containing the display name.", "StrRetToStrW": "Takes an STRRET structure returned by IShellFolder::GetDisplayNameOf and returns a pointer to an allocated string containing the display name.", "StrRStrIA": "Searches for the last occurrence of a specified substring within a string.", "StrRStrIW": "Searches for the last occurrence of a specified substring within a string.", "StrSpnA": "Obtains the length of a substring within a string that consists entirely of characters contained in a specified buffer.", "StrSpnW": "Obtains the length of a substring within a string that consists entirely of characters contained in a specified buffer.", "StrStrA": "Finds the first occurrence of a substring within a string.", "StrStrIA": "Finds the first occurrence of a substring within a string.", "StrStrIW": "Finds the first occurrence of a substring within a string.", "StrStrNIW": "Finds the first occurrence of a substring within a string.", "StrStrNW": "Finds the first occurrence of a substring within a string.", "StrStrW": "Finds the first occurrence of a substring within a string.", "StrToInt64ExA": "Converts a string representing a decimal or hexadecimal value to a 64-bit integer.", "StrToInt64ExW": "Converts a string representing a decimal or hexadecimal value to a 64-bit integer.", "StrToIntA": "Converts a string that represents a decimal value to an integer.", "StrToIntExA": "Converts a string representing a decimal or hexadecimal number to an integer.", "StrToIntExW": "Converts a string representing a decimal or hexadecimal number to an integer.", "StrToIntW": "Converts a string that represents a decimal value to an integer.", "StrTrimA": "Removes specified leading and trailing characters from a string.", "StrTrimW": "Removes specified leading and trailing characters from a string.", "SUBCLASSPROC": "Defines the prototype for the callback function used by RemoveWindowSubclass and SetWindowSubclass.", "SubStreamFailure": "Called when there is a failure that involves secondary streams and user interaction is needed.", "SupportsResource": "Retrieves whether an item supports a specified resource.", "SupportsSelection": "Determines whether an invoker supports its selection.", "Suspend": "Requests that a task be suspended.", "Synchronize": "Called by the synchronization manager once for each selected group after the user has chosen the registered applications to be synchronized.", "SynchronizeCompleted": "Called by an application when its Synchronize method is complete.", "TerminateAllProcesses": "Terminates all processes for the specified package.", "ThumbBarAddButtons": "Adds a thumbnail toolbar with a specified set of buttons to the thumbnail image of a window in a taskbar button flyout.", "ThumbBarSetImageList": "Specifies an image list that contains button images for a toolbar embedded in a thumbnail image of a window in a taskbar button flyout.", "ThumbBarUpdateButtons": "A thumbnail toolbar is a toolbar embedded in a thumbnail image of a window in a taskbar button flyout.", "Timer": "Resets the progress dialog box timer to zero.", "TranscodeImage": "Converts an image to JPEG or bitmap image format.", "Translate": "Called by the browser when the browser cannot determine the protocol of a URL address.", "TranslateAccelerator": "Translates keyboard shortcut key strokes when a namespace extension's view has the focus.", "TranslateAcceleratorGlobal": "Handles global accelerators so that input objects can respond to the keyboard even when they are not active in the UI.", "TranslateAcceleratorIO": "Enables the object to process keyboard accelerators.", "TranslateAcceleratorSB": "Translates accelerator keystrokes intended for the browser's frame while the view is active.", "TranslateMenuMessage": "Translates a message for a Component Object Model object.", "TranslateURLA": "Applies common translations to a given URL string, creating a new URL string.", "TranslateURLW": "Applies common translations to a given URL string, creating a new URL string.", "TranslateWithSearchContext": "Called by the browser when the browser can not determine the protocol of a URL address.", "Travel": "Navigates to a travel entry in the travel log relative to the position of the current entry.", "TreeAdvise": "Enables a client to register with the control.", "TreeUnadvise": "Enables a client to unregister with the control.", "TriggerEdgeGesture": "This gesture toggles the app 's app bar, if the app supports one.", "UIActivate": "For example, if the TAB key is pressed when the tree has the focus, the view should be given the focus.", "UIActivateIO": "UI-activates or deactivates the object.", "UInt8Add": "Adds two values of type UINT8.", "UInt8Mult": "Multiplies two values of type UINT8.", "UInt8Sub": "Subtracts one value of type UINT8 from another.", "UInt8ToChar": "Converts a value of type UINT8 to a value of type CHAR.", "UInt8ToInt8": "Converts a value of type UINT8 to a value of type INT8.", "UIntAdd": "Adds two values of type UINT.", "UIntMult": "Multiplies one value of type UINT by another.", "UIntPtrAdd": "Adds two values of type UINT_PTR.", "UIntPtrMult": "Multiplies one value of type UINT_PTR by another.", "UIntPtrSub": "Subtracts one value of type UINT_PTR from another.", "UIntPtrToChar": "Converts a value of type UINT_PTR to a value of type CHAR.", "UIntPtrToInt": "Converts a value of type SIZE_T to a value of type INT.", "UIntPtrToInt16": "Converts a value of type UINT_PTR to a value of type INT16.", "UIntPtrToInt8": "Converts a value of type UINT_PTR to a value of type INT8.", "UIntPtrToIntPtr": "Converts a value of type UINT_PTR to a value of type INT_PTR.", "UIntPtrToLong": "Converts a value of type size_t to a value of type LONG.", "UIntPtrToLongLong": "Converts a value of type UINT_PTR to a value of type LONGLONG.", "UIntPtrToLongPtr": "Converts a value of type UINT_PTR to a value of type LONG_PTR.", "UIntPtrToShort": "Converts a value of type UINT_PTR to a value of type SHORT.", "UIntPtrToUChar": "Converts a value of type UINT_PTR to a value of type UCHAR.", "UIntPtrToUInt": "Converts a value of type UINT_PTR to a value of type UINT.", "UIntPtrToUInt16": "Converts a value of type UINT_PTR to a value of type UINT16.", "UIntPtrToUInt8": "Converts a value of type UINT_PTR to a value of type UINT8.", "UIntPtrToULong": "Converts a value of type UINT_PTR to a value of type ULONG.", "UIntPtrToUShort": "Converts a value of type UINT_PTR to a value of type USHORT.", "UIntSub": "Subtracts one value of type UINT from another.", "UIntToChar": "Converts a value of type UINT to a value of type CHAR.", "UIntToInt": "Converts a value of type UINT to a value of type INT.", "UIntToInt8": "Converts a value of type UINT to a value of type INT8.", "UIntToIntPtr": "Converts a value of type UINT to a value of type INT_PTR.", "UIntToLong": "Converts a value of type UINT to a value of type LONG.", "UIntToLongPtr": "Converts a value of type UINT to a value of type LONG_PTR.", "UIntToShort": "Converts a value of type UINT to a value of type SHORT.", "UIntToUChar": "Converts a value of type UINT to a value of type UCHAR.", "UIntToUInt8": "Converts a value of type UINT to a value of type UINT8.", "UIntToUShort": "Converts a value of type UINT to a value of type USHORT.", "ULongAdd": "Adds two values of type ULONG.", "ULongLongAdd": "Adds two values of type SIZE_T.", "ULongLongMult": "Multiplies one value of type size_t by another.", "ULongLongSub": "Subtracts one value of type SIZE_T from another.", "ULongLongToChar": "Converts a value of type ULONGLONG to a value of type CHAR.", "ULongLongToInt": "Converts a value of type ULONGLONG to a value of type INT.", "ULongLongToInt8": "Converts a value of type ULONGLONG to a value of type INT8.", "ULongLongToLong": "Converts a value of type ULONGLONG to a value of type LONG.", "ULongLongToLongLong": "Converts a value of type ULONGLONG to a value of type INT_PTR.", "ULongLongToLongPtr": "Converts a value of type ULONGLONG to a value of type LONG_PTR.", "ULongLongToShort": "Converts a value of type ULONGLONG to a value of type SHORT.", "ULongLongToUChar": "Converts a value of type ULONGLONG to a value of type UCHAR.", "ULongLongToUInt": "Converts a value of type ULONGLONG to a value of type UINT.", "ULongLongToUInt8": "Converts a value of type ULONGLONG to a value of type UINT8.", "ULongLongToUIntPtr": "Converts a value of type ULONGLONG to a value of type UINT_PTR.", "ULongLongToULong": "Converts a value of type ULONGLONG to a value of type ULONG.", "ULongLongToULongPtr": "Converts a value of type ULONGLONG to a value of type ULONG_PTR.", "ULongLongToUShort": "Converts a value of type ULONGLONG to a value of type USHORT.", "ULongMult": "Multiplies one value of type ULONG by another.", "ULongPtrAdd": "Adds two values of type ULONG_PTR.", "ULongPtrMult": "Multiplies one value of type ULONG_PTR by another.", "ULongPtrSub": "Subtracts one value of type ULONG_PTR from another.", "ULongPtrToChar": "Converts a value of type ULONG_PTR to a value of type CHAR.", "ULongPtrToInt": "Converts a value of type size_t to a value of type INT.", "ULongPtrToInt8": "Converts a value of type ULONG_PTR to a value of type INT8.", "ULongPtrToIntPtr": "Converts a value of type ULONG_PTR to a value of type INT_PTR.", "ULongPtrToLong": "Converts a value of type ULONG_PTR to a value of type LONG.", "ULongPtrToLongLong": "Converts a value of type SIZE_T to a value of type INT64.", "ULongPtrToLongPtr": "Converts a value of type ULONG_PTR to a value of type LONG_PTR.", "ULongPtrToShort": "Converts a value of type ULONG_PTR to a value of type SHORT.", "ULongPtrToUChar": "Converts a value of type ULONG_PTR to a value of type UCHAR.", "ULongPtrToUInt": "Converts a value of type ULONG_PTR to a value of type UINT.", "ULongPtrToUInt8": "Converts a value of type ULONG_PTR to a value of type UINT8.", "ULongPtrToUIntPtr": "Converts a value of type ULONG_PTR to a value of type UINT_PTR.", "ULongPtrToULong": "Converts a value of type ULONG_PTR to a value of type ULONG.", "ULongPtrToUShort": "Converts a value of type ULONG_PTR to a value of type USHORT.", "ULongSub": "Subtracts one value of type ULONG from another.", "ULongToChar": "Converts a value of type ULONG to a value of type CHAR.", "ULongToInt": "Converts a value of type ULONG to a value of type INT.", "ULongToInt8": "Converts a value of type ULONG to a value of type INT8.", "ULongToIntPtr": "Converts a value of type ULONG to a value of type INT_PTR.", "ULongToLong": "Converts a value of type ULONG to a value of type LONG.", "ULongToLongPtr": "Converts a value of type ULONG to a value of type LONG_PTR.", "ULongToShort": "Converts a value of type ULONG to a value of type SHORT.", "ULongToUChar": "Converts a value of type ULONG to a value of type UCHAR.", "ULongToUInt": "Converts a value of type ULONG to a value of type UINT.", "ULongToUInt8": "Converts a value of type ULONG to a value of type UINT8.", "ULongToUIntPtr": "Converts a value of type ULONG to a value of type UINT_PTR.", "ULongToUShort": "Converts a value of type ULONG to a value of type USHORT.", "Unadvise": "Terminates an advisory connection.", "UnAdvise": "Used by the Logon UI or Credential UI to advise the credential that event callbacks are no longer accepted.", "UngroupChildFromParent": "ISuspensionDependencyManager::UngroupChildFromParent method", "Unload": "Directs the preview handler to cease rendering a preview and to release all resources that have been allocated based on the item passed in during the initialization.", "UnloadUserProfile": "For more information, see the Remarks section of the LoadUserProfile function.", "UnregisterAppStateChangeNotification": "Cancels a change notification registered through RegisterAppStateChangeNotification.", "UnregisterFolder": "This method does not remove the folder itself.", "UnregisterForPackageStateChanges": "Stops receiving package state-change notifications associated with a previous call to RegisterForPackageStateChanges.", "UnregisterScaleChangeEvent": "This function replaces RevokeScaleChangeNotifications.", "UnregisterSyncMgrHandler": "Removes a handler 's class identifier from the registration.", "UnregisterTab": "Removes a thumbnail from an application's preview group when that tab or document is closed in the application.", "Unschedule": "Cancels the installation of an application published by an application publisher.", "Update": "Deprecated.", "UpdateAll": "Programmatically starts an update for all items.", "UpdateBackForwardState": "Deprecated.", "UpdateConflicts": "Informs Sync Center that conflicts have been added for a specific handler or item.", "UpdateEntry": "Saves the browser state of the current entry in preparation for a pending navigation.", "UpdateEvents": "Informs Sync Center that events have been added for a specific handler or item.", "UpdateExternal": "Deprecated.", "UpdateHandler": "Instructs Sync Center to reenumerate the items managed by a handler or informs it that properties of the handler have changed.", "UpdateHandlerCollection": "Instructs Sync Center to reenumerate the handler collection, or informs it that properties of a handler in the handler collection have changed.", "UpdateItem": "Informs Sync Center that properties of a sync item have changed.", "UpdateItems": "Programmatically starts an update for specified items.", "UpdateLocations": "Called to specify the text elements stating the source and target in the current progress dialog.", "UpdateObject": "UpdateObject may be altered or unavailable.", "UpdateProgress": "Updates the transfer progress status in the UI.", "UpdateRemoteCredential": "Updates a credential from a remote session.", "UpdateSecureLockIcon": "Updates the value of the _ eSecureLockIcon member of the BASEBROWSERDATA structure, which tracks the icon indicating a secure site, as well as updating the icon itself in the UI.", "UpdateText": "Called if descriptive text associated with the action will be changed.", "UpdateTransferState": "Updates the transfer state.", "UpdateWindowList": "Instructs the browser to update the pointer to an item identifier list in the window list.", "UrlApplySchemeA": "Determines a scheme for a specified URL string, and returns a string with an appropriate prefix.", "UrlApplySchemeW": "Determines a scheme for a specified URL string, and returns a string with an appropriate prefix.", "URLAssociationDialogA": "Invokes the unregistered URL protocol dialog box.", "URLAssociationDialogW": "Invokes the unregistered URL protocol dialog box.", "UrlCanonicalizeA": "Converts a URL string into canonical form.", "UrlCanonicalizeW": "Converts a URL string into canonical form.", "UrlCombineA": "When provided with a relative URL and its base, returns a URL in canonical form.", "UrlCombineW": "When provided with a relative URL and its base, returns a URL in canonical form.", "UrlCompareA": "Makes a case-sensitive comparison of two URL strings.", "UrlCompareW": "Makes a case-sensitive comparison of two URL strings.", "UrlCreateFromPathA": "Converts a Microsoft MS-DOS path to a canonicalized URL.", "UrlCreateFromPathW": "Converts a Microsoft MS-DOS path to a canonicalized URL.", "UrlEscapeA": "Converts characters or surrogate pairs in a URL that might be altered during transport across the Internet into their corresponding escape sequences.", "UrlEscapeSpaces": "A macro that converts space characters into their corresponding escape sequence.", "UrlEscapeW": "Converts characters or surrogate pairs in a URL that might be altered during transport across the Internet into their corresponding escape sequences.", "UrlFixupW": "UrlFixupW may be altered or unavailable.", "UrlGetLocationA": "Retrieves the location from a URL.", "UrlGetLocationW": "Retrieves the location from a URL.", "UrlGetPartA": "Accepts a URL string and returns a specified part of that URL.", "UrlGetPartW": "Accepts a URL string and returns a specified part of that URL.", "UrlHashA": "Hashes a URL string.", "UrlHashW": "Hashes a URL string.", "UrlIsA": "Tests whether a URL is a specified type.", "UrlIsFileUrlA": "Tests a URL to determine if it is a file URL.", "UrlIsFileUrlW": "Tests a URL to determine if it is a file URL.", "UrlIsNoHistoryA": "Returns whether a URL is a URL that browsers typically do not include in navigation history.", "UrlIsNoHistoryW": "Returns whether a URL is a URL that browsers typically do not include in navigation history.", "UrlIsOpaqueA": "Returns whether a URL is opaque.", "UrlIsOpaqueW": "Returns whether a URL is opaque.", "UrlIsW": "Tests whether a URL is a specified type.", "UrlUnescapeA": "Converts escape sequences back into ordinary characters.", "UrlUnescapeInPlace": "Converts escape sequences back into ordinary characters and overwrites the original string.", "UrlUnescapeW": "Converts escape sequences back into ordinary characters.", "UShortAdd": "Adds two values of type USHORT.", "UShortMult": "Multiplies one value of type USHORT by another.", "UShortSub": "Subtracts one value of type USHORT from another.", "UShortToChar": "Converts a value of type USHORT to a value of type CHAR.", "UShortToInt8": "Converts a value of type USHORT to a value of type INT8.", "UShortToShort": "Converts a value of type USHORT to a value of type SHORT.", "UShortToUChar": "Converts a value of type USHORT to a value of type UCHAR.", "UShortToUInt8": "Converts a value of type USHORT to a value of type UINT8.", "v_CheckZoneCrossing": "Called by the base class to validate a zone crossing when navigating from one page to another.", "v_GetViewStream": "Deprecated.", "v_MayGetNextToolbarFocus": "Used when translating accelerators through TranslateAcceleratorSB and in checking the cycle of focus between the view and the browser 's toolbars.", "v_MayTranslateAccelerator": "Called by a derived class to instruct the base class to proceed with the translation of keyboard mnemonics.", "v_ShowHideChildWindows": "Allows a derived class to update its child windows after a sizing event.", "Walk": "Initiates a recursive walk of the namespace from the specified root to the given depth.", "WalkComplete": "Removes data collected during a namespace walk.", "WhichPlatform": "WhichPlatform may be altered or unavailable.", "Win32DeleteFile": "Win32DeleteFile may be altered or unavailable.", "WinHelpA": "Launches Windows Help and passes additional data that indicates the nature of the help requested by the application.", "WinHelpW": "Launches Windows Help and passes additional data that indicates the nature of the help requested by the application.", "WndProcBS": "Allows a derived class to call the WinProc function of the base class.", "wnsprintfA": "Takes a variable-length argument list and returns the values of the arguments as a printf-style formatted string.", "wnsprintfW": "Takes a variable-length argument list and returns the values of the arguments as a printf-style formatted string.", "WriteAsync": "Writes information to a stream asynchronously.", "WriteCabinetState": "WriteCabinetState may be altered or unavailable.", "WritePropertyNPB": "Saves a property to the named property bag.", "wvnsprintfA": "Takes a list of arguments and returns the values of the arguments as a printf-style formatted string.", "wvnsprintfW": "Takes a list of arguments and returns the values of the arguments as a printf-style formatted string.", "YouAreAReplica": "Notifies an object that it may be subject to subsequent reconciliation through the Reconcile method."}